DYXX-X/Library_zh/ESP32_API_zh/cmock/CMock/test/iar/iar_v4/incIAR/ioat91sam7x256.h
// - ----------------------------------------------------------------------------
// -ATMEL微控制器软件支持-ROUSSET-
// - ----------------------------------------------------------------------------
// -  DISCLAIMER:  THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR
// -  IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
// -  MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
// -  DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,
// -  INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
// -  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,
// -  OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
// -  LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
// -  NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
// -  EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// - ----------------------------------------------------------------------------
// -文件名：AT91SAM7X256.h
// -对象：AT91SAM7X256定义
// -生成：AT91 SW应用程序组11/02/2005（15:17:24）
// - 
// -CVS参考号：/AT91SAM7X256.pl/1/114/2005年9月13日星期二15:06:52//
// -CVS参考：/SYS_SAM7X.pl/1.3/2005年2月1日星期二17:01:43//
// -CVS参考：/MC_SAM7X.pl/12/2005年5月20日星期五14:13:04//
// -CVS参考：/PMC_SAM7X.pl/1.4/2005年2月8日星期二13:58:10//
// -CVS参考：/RSTC_SAM7X.pl/12/2005年7月13日星期三14:57:50//
// -CVS参考：/UDP_SAM7X.pl/11/2005年5月10日星期二11:35:35//
// -CVS参考：/PWM_SAM7X.pl/11/2005年5月10日星期二11:53:07//
// -CVS参考：/AIC_6075B.pl/1.3/2005年5月20日星期五14:01:30//
// -CVS参考号：/PIO-6057A.pl/1.2/2005年2月3日星期四10:18:28//
// -CVS参考：/RTTC_6081A.pl/12/2004年11月9日星期二14:43:58//
// -CVS参考号：/PIC_6079A.pl/12/2004年11月9日星期二14:43:56//
// -CVS参考：/WDTC_6080A.pl/1.3/2004年11月9日星期二14:44:00//
// -CVS参考：/VREG_6085B.pl/1.1/2005年2月1日星期二16:05:48//
// -CVS参考：/PDC_6074C.pl/12/2005年2月3日星期四08:48:54//
// -CVS参考：/DBGU_6059D.pl/1.1/2005年1月31日星期一13:15:32//
// -CVS参考号：/SPI_6088D.pl/1.3/2005年5月20日星期五14:08:59//
// -CVS参考：/US_6089C.pl/11/Mon Jul 12 18:23:26 2004//
// -CVS参考：/SSC_6078B.pl/1.1/2005年7月13日星期三15:19:19//
// -CVS参考号：/TTWI_6061A.pl/1/11/2004年7月13日星期二07:38:06//
// -CVS参考：/TC_6082A.pl/1.7/2005年3月11日星期五12:52:17//
// -CVS参考号：/CAN_6019B.pl/11/2005年3月8日星期二12:42:22//
// -CVS参考：/EMACB_6119A.pl/1.6/2005年7月13日星期三15:05:35//
// -CVS参考号：/AADC_6051C.pl/11/10月17日星期五09:12:38 2003//
// - ----------------------------------------------------------------------------

#ifndef AT91SAM7X256_H
#define AT91SAM7X256_H

#ifdef __IAR_SYSTEMS_ICC__

typedef volatile unsigned int AT91_REG;// 硬件寄存器定义

// *****************************************************************************
//              系统外围设备的软件API定义
// *****************************************************************************
typedef struct _AT91S_SYS {
	AT91_REG	 AIC_SMR[32]; 	// 源模式寄存器
	AT91_REG	 AIC_SVR[32]; 	// 源向量寄存器
	AT91_REG	 AIC_IVR; 	// IRQ矢量寄存器
	AT91_REG	 AIC_FVR; 	// FIQ矢量寄存器
	AT91_REG	 AIC_ISR; 	// 中断状态寄存器
	AT91_REG	 AIC_IPR; 	// 中断挂起寄存器
	AT91_REG	 AIC_IMR; 	// 中断掩码寄存器
	AT91_REG	 AIC_CISR; 	// 核心中断状态寄存器
	AT91_REG	 Reserved0[2]; 	// 
	AT91_REG	 AIC_IECR; 	// 中断启用命令寄存器
	AT91_REG	 AIC_IDCR; 	// 中断禁用命令寄存器
	AT91_REG	 AIC_ICCR; 	// 中断清除命令寄存器
	AT91_REG	 AIC_ISCR; 	// 中断设置命令寄存器
	AT91_REG	 AIC_EOICR; 	// 中断命令寄存器结束
	AT91_REG	 AIC_SPU; 	// 虚假向量寄存器
	AT91_REG	 AIC_DCR; 	// 调试控制寄存器（保护）
	AT91_REG	 Reserved1[1]; 	// 
	AT91_REG	 AIC_FFER; 	// 快速强制启用寄存器
	AT91_REG	 AIC_FFDR; 	// 快速强制禁用寄存器
	AT91_REG	 AIC_FFSR; 	// 快速强制状态寄存器
	AT91_REG	 Reserved2[45]; 	// 
	AT91_REG	 DBGU_CR; 	// 控制寄存器
	AT91_REG	 DBGU_MR; 	// 模式寄存器
	AT91_REG	 DBGU_IER; 	// 中断启用寄存器
	AT91_REG	 DBGU_IDR; 	// 中断禁用寄存器
	AT91_REG	 DBGU_IMR; 	// 中断掩码寄存器
	AT91_REG	 DBGU_CSR; 	// 信道状态寄存器
	AT91_REG	 DBGU_RHR; 	// 接收机保持寄存器
	AT91_REG	 DBGU_THR; 	// 变送器保持寄存器
	AT91_REG	 DBGU_BRGR; 	// 波特率发生器寄存器
	AT91_REG	 Reserved3[7]; 	// 
	AT91_REG	 DBGU_CIDR; 	// 芯片ID寄存器
	AT91_REG	 DBGU_EXID; 	// 芯片ID扩展寄存器
	AT91_REG	 DBGU_FNTR; 	// 强制NTRST寄存器
	AT91_REG	 Reserved4[45]; 	// 
	AT91_REG	 DBGU_RPR; 	// 接收指针寄存器
	AT91_REG	 DBGU_RCR; 	// 接收计数器寄存器
	AT91_REG	 DBGU_TPR; 	// 发送指针寄存器
	AT91_REG	 DBGU_TCR; 	// 发送计数器寄存器
	AT91_REG	 DBGU_RNPR; 	// 接收下一个指针寄存器
	AT91_REG	 DBGU_RNCR; 	// 接收下一计数器寄存器
	AT91_REG	 DBGU_TNPR; 	// 发送下一指针寄存器
	AT91_REG	 DBGU_TNCR; 	// 发送下一计数器寄存器
	AT91_REG	 DBGU_PTCR; 	// PDC传输控制寄存器
	AT91_REG	 DBGU_PTSR; 	// PDC传输状态寄存器
	AT91_REG	 Reserved5[54]; 	// 
	AT91_REG	 PIOA_PER; 	// PIO启用寄存器
	AT91_REG	 PIOA_PDR; 	// PIO禁用寄存器
	AT91_REG	 PIOA_PSR; 	// PIO状态寄存器
	AT91_REG	 Reserved6[1]; 	// 
	AT91_REG	 PIOA_OER; 	// 输出启用寄存器
	AT91_REG	 PIOA_ODR; 	// 输出禁用寄存器
	AT91_REG	 PIOA_OSR; 	// 输出状态寄存器
	AT91_REG	 Reserved7[1]; 	// 
	AT91_REG	 PIOA_IFER; 	// 输入滤波器启用寄存器
	AT91_REG	 PIOA_IFDR; 	// 输入滤波器禁用寄存器
	AT91_REG	 PIOA_IFSR; 	// 输入过滤器状态寄存器
	AT91_REG	 Reserved8[1]; 	// 
	AT91_REG	 PIOA_SODR; 	// 设置输出数据寄存器
	AT91_REG	 PIOA_CODR; 	// 清除输出数据寄存器
	AT91_REG	 PIOA_ODSR; 	// 输出数据状态寄存器
	AT91_REG	 PIOA_PDSR; 	// 引脚数据状态寄存器
	AT91_REG	 PIOA_IER; 	// 中断启用寄存器
	AT91_REG	 PIOA_IDR; 	// 中断禁用寄存器
	AT91_REG	 PIOA_IMR; 	// 中断掩码寄存器
	AT91_REG	 PIOA_ISR; 	// 中断状态寄存器
	AT91_REG	 PIOA_MDER; 	// 多驱动程序启用寄存器
	AT91_REG	 PIOA_MDDR; 	// 多驱动程序禁用寄存器
	AT91_REG	 PIOA_MDSR; 	// 多驱动程序状态寄存器
	AT91_REG	 Reserved9[1]; 	// 
	AT91_REG	 PIOA_PPUDR; 	// 上拉禁用寄存器
	AT91_REG	 PIOA_PPUER; 	// 上拉启用寄存器
	AT91_REG	 PIOA_PPUSR; 	// 拉起状态寄存器
	AT91_REG	 Reserved10[1]; 	// 
	AT91_REG	 PIOA_ASR; 	// 选择一个寄存器
	AT91_REG	 PIOA_BSR; 	// 选择B寄存器
	AT91_REG	 PIOA_ABSR; 	// AB选择状态寄存器
	AT91_REG	 Reserved11[9]; 	// 
	AT91_REG	 PIOA_OWER; 	// 输出写入启用寄存器
	AT91_REG	 PIOA_OWDR; 	// 输出写入禁用寄存器
	AT91_REG	 PIOA_OWSR; 	// 输出写入状态寄存器
	AT91_REG	 Reserved12[85]; 	// 
	AT91_REG	 PIOB_PER; 	// PIO启用寄存器
	AT91_REG	 PIOB_PDR; 	// PIO禁用寄存器
	AT91_REG	 PIOB_PSR; 	// PIO状态寄存器
	AT91_REG	 Reserved13[1]; 	// 
	AT91_REG	 PIOB_OER; 	// 输出启用寄存器
	AT91_REG	 PIOB_ODR; 	// 输出禁用寄存器
	AT91_REG	 PIOB_OSR; 	// 输出状态寄存器
	AT91_REG	 Reserved14[1]; 	// 
	AT91_REG	 PIOB_IFER; 	// 输入滤波器启用寄存器
	AT91_REG	 PIOB_IFDR; 	// 输入滤波器禁用寄存器
	AT91_REG	 PIOB_IFSR; 	// 输入过滤器状态寄存器
	AT91_REG	 Reserved15[1]; 	// 
	AT91_REG	 PIOB_SODR; 	// 设置输出数据寄存器
	AT91_REG	 PIOB_CODR; 	// 清除输出数据寄存器
	AT91_REG	 PIOB_ODSR; 	// 输出数据状态寄存器
	AT91_REG	 PIOB_PDSR; 	// 引脚数据状态寄存器
	AT91_REG	 PIOB_IER; 	// 中断启用寄存器
	AT91_REG	 PIOB_IDR; 	// 中断禁用寄存器
	AT91_REG	 PIOB_IMR; 	// 中断掩码寄存器
	AT91_REG	 PIOB_ISR; 	// 中断状态寄存器
	AT91_REG	 PIOB_MDER; 	// 多驱动程序启用寄存器
	AT91_REG	 PIOB_MDDR; 	// 多驱动程序禁用寄存器
	AT91_REG	 PIOB_MDSR; 	// 多驱动程序状态寄存器
	AT91_REG	 Reserved16[1]; 	// 
	AT91_REG	 PIOB_PPUDR; 	// 上拉禁用寄存器
	AT91_REG	 PIOB_PPUER; 	// 上拉启用寄存器
	AT91_REG	 PIOB_PPUSR; 	// 拉起状态寄存器
	AT91_REG	 Reserved17[1]; 	// 
	AT91_REG	 PIOB_ASR; 	// 选择一个寄存器
	AT91_REG	 PIOB_BSR; 	// 选择B寄存器
	AT91_REG	 PIOB_ABSR; 	// AB选择状态寄存器
	AT91_REG	 Reserved18[9]; 	// 
	AT91_REG	 PIOB_OWER; 	// 输出写入启用寄存器
	AT91_REG	 PIOB_OWDR; 	// 输出写入禁用寄存器
	AT91_REG	 PIOB_OWSR; 	// 输出写入状态寄存器
	AT91_REG	 Reserved19[341]; 	// 
	AT91_REG	 PMC_SCER; 	// 系统时钟启用寄存器
	AT91_REG	 PMC_SCDR; 	// 系统时钟禁用寄存器
	AT91_REG	 PMC_SCSR; 	// 系统时钟状态寄存器
	AT91_REG	 Reserved20[1]; 	// 
	AT91_REG	 PMC_PCER; 	// 外围时钟启用寄存器
	AT91_REG	 PMC_PCDR; 	// 外围时钟禁用寄存器
	AT91_REG	 PMC_PCSR; 	// 外围时钟状态寄存器
	AT91_REG	 Reserved21[1]; 	// 
	AT91_REG	 PMC_MOR; 	// 主振荡器寄存器
	AT91_REG	 PMC_MCFR; 	// 主时钟频率寄存器
	AT91_REG	 Reserved22[1]; 	// 
	AT91_REG	 PMC_PLLR; 	// PLL寄存器
	AT91_REG	 PMC_MCKR; 	// 主时钟寄存器
	AT91_REG	 Reserved23[3]; 	// 
	AT91_REG	 PMC_PCKR[4]; 	// 可编程时钟寄存器
	AT91_REG	 Reserved24[4]; 	// 
	AT91_REG	 PMC_IER; 	// 中断启用寄存器
	AT91_REG	 PMC_IDR; 	// 中断禁用寄存器
	AT91_REG	 PMC_SR; 	// 状态寄存器
	AT91_REG	 PMC_IMR; 	// 中断掩码寄存器
	AT91_REG	 Reserved25[36]; 	// 
	AT91_REG	 RSTC_RCR; 	// 重置控制寄存器
	AT91_REG	 RSTC_RSR; 	// 重置状态寄存器
	AT91_REG	 RSTC_RMR; 	// 重置模式寄存器
	AT91_REG	 Reserved26[5]; 	// 
	AT91_REG	 RTTC_RTMR; 	// 实时模式寄存器
	AT91_REG	 RTTC_RTAR; 	// 实时报警寄存器
	AT91_REG	 RTTC_RTVR; 	// 实时值寄存器
	AT91_REG	 RTTC_RTSR; 	// 实时状态寄存器
	AT91_REG	 PITC_PIMR; 	// 周期间隔模式寄存器
	AT91_REG	 PITC_PISR; 	// 周期间隔状态寄存器
	AT91_REG	 PITC_PIVR; 	// 周期间隔值寄存器
	AT91_REG	 PITC_PIIR; 	// 周期间隔图像寄存器
	AT91_REG	 WDTC_WDCR; 	// 看门狗控制寄存器
	AT91_REG	 WDTC_WDMR; 	// 看门狗模式寄存器
	AT91_REG	 WDTC_WDSR; 	// 看门狗状态寄存器
	AT91_REG	 Reserved27[5]; 	// 
	AT91_REG	 VREG_MR; 	// 电压调节器模式寄存器
} AT91S_SYS, *AT91PS_SYS;


// *****************************************************************************
//              高级中断控制器的软件API定义
// *****************************************************************************
typedef struct _AT91S_AIC {
	AT91_REG	 AIC_SMR[32]; 	// 源模式寄存器
	AT91_REG	 AIC_SVR[32]; 	// 源向量寄存器
	AT91_REG	 AIC_IVR; 	// IRQ矢量寄存器
	AT91_REG	 AIC_FVR; 	// FIQ矢量寄存器
	AT91_REG	 AIC_ISR; 	// 中断状态寄存器
	AT91_REG	 AIC_IPR; 	// 中断挂起寄存器
	AT91_REG	 AIC_IMR; 	// 中断掩码寄存器
	AT91_REG	 AIC_CISR; 	// 核心中断状态寄存器
	AT91_REG	 Reserved0[2]; 	// 
	AT91_REG	 AIC_IECR; 	// 中断启用命令寄存器
	AT91_REG	 AIC_IDCR; 	// 中断禁用命令寄存器
	AT91_REG	 AIC_ICCR; 	// 中断清除命令寄存器
	AT91_REG	 AIC_ISCR; 	// 中断设置命令寄存器
	AT91_REG	 AIC_EOICR; 	// 中断命令寄存器结束
	AT91_REG	 AIC_SPU; 	// 虚假向量寄存器
	AT91_REG	 AIC_DCR; 	// 调试控制寄存器（保护）
	AT91_REG	 Reserved1[1]; 	// 
	AT91_REG	 AIC_FFER; 	// 快速强制启用寄存器
	AT91_REG	 AIC_FFDR; 	// 快速强制禁用寄存器
	AT91_REG	 AIC_FFSR; 	// 快速强制状态寄存器
} AT91S_AIC, *AT91PS_AIC;

