DYXX-X/Library_zh/ESP32_API_zh/cmock/CMock/test/iar/iar_v4/incIAR/ioat91sam7x256.h
// --------AIC_SMR：（AIC偏移：0x0）控制寄存器--------
#define AT91C_AIC_PRIOR       ((unsigned int) 0x7 <<  0) // （AIC）优先级
#define 	AT91C_AIC_PRIOR_LOWEST               ((unsigned int) 0x0) // （AIC）最低优先级
#define 	AT91C_AIC_PRIOR_HIGHEST              ((unsigned int) 0x7) // （AIC）最高优先级
#define AT91C_AIC_SRCTYPE     ((unsigned int) 0x3 <<  5) // （AIC）中断源类型
#define 	AT91C_AIC_SRCTYPE_INT_HIGH_LEVEL       ((unsigned int) 0x0 <<  5) // （AIC）内部源代码标签高度敏感
#define 	AT91C_AIC_SRCTYPE_EXT_LOW_LEVEL        ((unsigned int) 0x0 <<  5) // （AIC）外部源代码标签低级别敏感
#define 	AT91C_AIC_SRCTYPE_INT_POSITIVE_EDGE    ((unsigned int) 0x1 <<  5) // （AIC）内部源代码标签正边缘触发
#define 	AT91C_AIC_SRCTYPE_EXT_NEGATIVE_EDGE    ((unsigned int) 0x1 <<  5) // （AIC）外部源代码标签负边缘触发
#define 	AT91C_AIC_SRCTYPE_HIGH_LEVEL           ((unsigned int) 0x2 <<  5) // （AIC）内部或外部源代码标签高级别敏感
#define 	AT91C_AIC_SRCTYPE_POSITIVE_EDGE        ((unsigned int) 0x3 <<  5) // （AIC）内部或外部源代码标签正边缘触发
// --------AIC_CISR：（AIC偏移：0x114）AIC核心中断状态寄存器--------
#define AT91C_AIC_NFIQ        ((unsigned int) 0x1 <<  0) // （AIC）NFIQ状态
#define AT91C_AIC_NIRQ        ((unsigned int) 0x1 <<  1) // （AIC）NIRQ状态
// --------AIC_DCR：（AIC偏移：0x138）AIC调试控制寄存器（保护）--------
#define AT91C_AIC_DCR_PROT    ((unsigned int) 0x1 <<  0) // （AIC）保护模式
#define AT91C_AIC_DCR_GMSK    ((unsigned int) 0x1 <<  1) // （AIC）通用掩码

// *****************************************************************************
//              外设DMA控制器的软件API定义
// *****************************************************************************
typedef struct _AT91S_PDC {
	AT91_REG	 PDC_RPR; 	// 接收指针寄存器
	AT91_REG	 PDC_RCR; 	// 接收计数器寄存器
	AT91_REG	 PDC_TPR; 	// 发送指针寄存器
	AT91_REG	 PDC_TCR; 	// 发送计数器寄存器
	AT91_REG	 PDC_RNPR; 	// 接收下一个指针寄存器
	AT91_REG	 PDC_RNCR; 	// 接收下一计数器寄存器
	AT91_REG	 PDC_TNPR; 	// 发送下一指针寄存器
	AT91_REG	 PDC_TNCR; 	// 发送下一计数器寄存器
	AT91_REG	 PDC_PTCR; 	// PDC传输控制寄存器
	AT91_REG	 PDC_PTSR; 	// PDC传输状态寄存器
} AT91S_PDC, *AT91PS_PDC;

// --------PDC_PTCR：（PDC偏移：0x20）PDC传输控制寄存器--------
#define AT91C_PDC_RXTEN       ((unsigned int) 0x1 <<  0) // （PDC）接收器传输启用
#define AT91C_PDC_RXTDIS      ((unsigned int) 0x1 <<  1) // （PDC）接收器传输禁用
#define AT91C_PDC_TXTEN       ((unsigned int) 0x1 <<  8) // （PDC）发射器传输启用
#define AT91C_PDC_TXTDIS      ((unsigned int) 0x1 <<  9) // （PDC）发射器传输禁用
// --------PDC_PTSR：（PDC偏移：0x24）PDC传输状态寄存器--------

// *****************************************************************************
//              调试单元的软件API定义
// *****************************************************************************
typedef struct _AT91S_DBGU {
	AT91_REG	 DBGU_CR; 	// 控制寄存器
	AT91_REG	 DBGU_MR; 	// 模式寄存器
	AT91_REG	 DBGU_IER; 	// 中断启用寄存器
	AT91_REG	 DBGU_IDR; 	// 中断禁用寄存器
	AT91_REG	 DBGU_IMR; 	// 中断掩码寄存器
	AT91_REG	 DBGU_CSR; 	// 信道状态寄存器
	AT91_REG	 DBGU_RHR; 	// 接收机保持寄存器
	AT91_REG	 DBGU_THR; 	// 变送器保持寄存器
	AT91_REG	 DBGU_BRGR; 	// 波特率发生器寄存器
	AT91_REG	 Reserved0[7]; 	// 
	AT91_REG	 DBGU_CIDR; 	// 芯片ID寄存器
	AT91_REG	 DBGU_EXID; 	// 芯片ID扩展寄存器
	AT91_REG	 DBGU_FNTR; 	// 强制NTRST寄存器
	AT91_REG	 Reserved1[45]; 	// 
	AT91_REG	 DBGU_RPR; 	// 接收指针寄存器
	AT91_REG	 DBGU_RCR; 	// 接收计数器寄存器
	AT91_REG	 DBGU_TPR; 	// 发送指针寄存器
	AT91_REG	 DBGU_TCR; 	// 发送计数器寄存器
	AT91_REG	 DBGU_RNPR; 	// 接收下一个指针寄存器
	AT91_REG	 DBGU_RNCR; 	// 接收下一计数器寄存器
	AT91_REG	 DBGU_TNPR; 	// 发送下一指针寄存器
	AT91_REG	 DBGU_TNCR; 	// 发送下一计数器寄存器
	AT91_REG	 DBGU_PTCR; 	// PDC传输控制寄存器
	AT91_REG	 DBGU_PTSR; 	// PDC传输状态寄存器
} AT91S_DBGU, *AT91PS_DBGU;

// --------DBGU_CR：（DBGU偏移量：0x0）调试单元控制寄存器--------
#define AT91C_US_RSTRX        ((unsigned int) 0x1 <<  2) // （DBGU）重置接收器
#define AT91C_US_RSTTX        ((unsigned int) 0x1 <<  3) // （DBGU）复位变送器
#define AT91C_US_RXEN         ((unsigned int) 0x1 <<  4) // （DBGU）接收器启用
#define AT91C_US_RXDIS        ((unsigned int) 0x1 <<  5) // （DBGU）接收器禁用
#define AT91C_US_TXEN         ((unsigned int) 0x1 <<  6) // （DBGU）变送器启用
#define AT91C_US_TXDIS        ((unsigned int) 0x1 <<  7) // （DBGU）变送器禁用
#define AT91C_US_RSTSTA       ((unsigned int) 0x1 <<  8) // （DBGU）重置状态位
// --------DBGU_MR：（DBGU偏移量：0x4）调试单元模式寄存器--------
#define AT91C_US_PAR          ((unsigned int) 0x7 <<  9) // （DBGU）奇偶校验类型
#define 	AT91C_US_PAR_EVEN                 ((unsigned int) 0x0 <<  9) // （DBGU）偶校验
#define 	AT91C_US_PAR_ODD                  ((unsigned int) 0x1 <<  9) // （DBGU）奇数奇偶校验
#define 	AT91C_US_PAR_SPACE                ((unsigned int) 0x2 <<  9) // （DBGU）奇偶校验强制为0（空格）
#define 	AT91C_US_PAR_MARK                 ((unsigned int) 0x3 <<  9) // （DBGU）奇偶校验强制为1（标记）
#define 	AT91C_US_PAR_NONE                 ((unsigned int) 0x4 <<  9) // （DBGU）无奇偶校验
#define 	AT91C_US_PAR_MULTI_DROP           ((unsigned int) 0x6 <<  9) // （DBGU）多点模式
#define AT91C_US_CHMODE       ((unsigned int) 0x3 << 14) // （DBGU）信道模式
#define 	AT91C_US_CHMODE_NORMAL               ((unsigned int) 0x0 << 14) // （DBGU）正常模式：USART信道作为RX/TX USART运行。
#define 	AT91C_US_CHMODE_AUTO                 ((unsigned int) 0x1 << 14) // （DBGU）自动回声：接收器数据输入连接到TXD引脚。
#define 	AT91C_US_CHMODE_LOCAL                ((unsigned int) 0x2 << 14) // （DBGU）本地环回：发射机输出信号连接到接收机输入信号。
#define 	AT91C_US_CHMODE_REMOTE               ((unsigned int) 0x3 << 14) // （DBGU）远程环回：RXD引脚内部连接到TXD引脚。
// --------DBGU_IER:（DBGU偏移：0x8）调试单元中断启用寄存器--------
#define AT91C_US_RXRDY        ((unsigned int) 0x1 <<  0) // （DBGU）RXRDY中断
#define AT91C_US_TXRDY        ((unsigned int) 0x1 <<  1) // （DBGU）TXRDY中断
#define AT91C_US_ENDRX        ((unsigned int) 0x1 <<  3) // （DBGU）接收传输中断结束
#define AT91C_US_ENDTX        ((unsigned int) 0x1 <<  4) // （DBGU）传输中断结束
#define AT91C_US_OVRE         ((unsigned int) 0x1 <<  5) // （DBGU）超限中断
#define AT91C_US_FRAME        ((unsigned int) 0x1 <<  6) // （DBGU）成帧错误中断
#define AT91C_US_PARE         ((unsigned int) 0x1 <<  7) // （DBGU）奇偶错误中断
#define AT91C_US_TXEMPTY      ((unsigned int) 0x1 <<  9) // （DBGU）TXEMPTY中断
#define AT91C_US_TXBUFE       ((unsigned int) 0x1 << 11) // （DBGU）TXBUFE中断
#define AT91C_US_RXBUFF       ((unsigned int) 0x1 << 12) // （DBGU）RXBUFF中断
#define AT91C_US_COMM_TX      ((unsigned int) 0x1 << 30) // （DBGU）COMM_TX中断
#define AT91C_US_COMM_RX      ((unsigned int) 0x1 << 31) // （DBGU）COMM_RX中断
// --------DBGU_IDR:（DBGU偏移量：0xc）调试单元中断禁用寄存器--------
// --------DBGU_IMR：（DBGU偏移：0x10）调试单元中断掩码寄存器--------
// --------DBGU_CSR:（DBGU偏移：0x14）调试单元信道状态寄存器--------
// --------DBGU_FNTR：（DBGU偏移量：0x48）调试单元FORCE_NRST寄存器--------
#define AT91C_US_FORCE_NTRST  ((unsigned int) 0x1 <<  0) // JTAG中的（DBGU）部队NTRST

// *****************************************************************************
//              并行输入输出控制器的软件API定义
// *****************************************************************************
typedef struct _AT91S_PIO {
	AT91_REG	 PIO_PER; 	// PIO启用寄存器
	AT91_REG	 PIO_PDR; 	// PIO禁用寄存器
	AT91_REG	 PIO_PSR; 	// PIO状态寄存器
	AT91_REG	 Reserved0[1]; 	// 
	AT91_REG	 PIO_OER; 	// 输出启用寄存器
	AT91_REG	 PIO_ODR; 	// 输出禁用寄存器
	AT91_REG	 PIO_OSR; 	// 输出状态寄存器
	AT91_REG	 Reserved1[1]; 	// 
	AT91_REG	 PIO_IFER; 	// 输入滤波器启用寄存器
	AT91_REG	 PIO_IFDR; 	// 输入滤波器禁用寄存器
	AT91_REG	 PIO_IFSR; 	// 输入过滤器状态寄存器
	AT91_REG	 Reserved2[1]; 	// 
	AT91_REG	 PIO_SODR; 	// 设置输出数据寄存器
	AT91_REG	 PIO_CODR; 	// 清除输出数据寄存器
	AT91_REG	 PIO_ODSR; 	// 输出数据状态寄存器
	AT91_REG	 PIO_PDSR; 	// 引脚数据状态寄存器
	AT91_REG	 PIO_IER; 	// 中断启用寄存器
	AT91_REG	 PIO_IDR; 	// 中断禁用寄存器
	AT91_REG	 PIO_IMR; 	// 中断掩码寄存器
	AT91_REG	 PIO_ISR; 	// 中断状态寄存器
	AT91_REG	 PIO_MDER; 	// 多驱动程序启用寄存器
	AT91_REG	 PIO_MDDR; 	// 多驱动程序禁用寄存器
	AT91_REG	 PIO_MDSR; 	// 多驱动程序状态寄存器
	AT91_REG	 Reserved3[1]; 	// 
	AT91_REG	 PIO_PPUDR; 	// 上拉禁用寄存器
	AT91_REG	 PIO_PPUER; 	// 上拉启用寄存器
	AT91_REG	 PIO_PPUSR; 	// 拉起状态寄存器
	AT91_REG	 Reserved4[1]; 	// 
	AT91_REG	 PIO_ASR; 	// 选择一个寄存器
	AT91_REG	 PIO_BSR; 	// 选择B寄存器
	AT91_REG	 PIO_ABSR; 	// AB选择状态寄存器
	AT91_REG	 Reserved5[9]; 	// 
	AT91_REG	 PIO_OWER; 	// 输出写入启用寄存器
	AT91_REG	 PIO_OWDR; 	// 输出写入禁用寄存器
	AT91_REG	 PIO_OWSR; 	// 输出写入状态寄存器
} AT91S_PIO, *AT91PS_PIO;


// *****************************************************************************
//              时钟发生器控制器的软件API定义
// *****************************************************************************
typedef struct _AT91S_CKGR {
	AT91_REG	 CKGR_MOR; 	// 主振荡器寄存器
	AT91_REG	 CKGR_MCFR; 	// 主时钟频率寄存器
	AT91_REG	 Reserved0[1]; 	// 
	AT91_REG	 CKGR_PLLR; 	// PLL寄存器
} AT91S_CKGR, *AT91PS_CKGR;

// --------CKGR_MOR:（CKGR偏移：0x0）主振荡器寄存器--------
#define AT91C_CKGR_MOSCEN     ((unsigned int) 0x1 <<  0) // （CKGR）主振荡器启用
#define AT91C_CKGR_OSCBYPASS  ((unsigned int) 0x1 <<  1) // （CKGR）主振荡器旁路
#define AT91C_CKGR_OSCOUNT    ((unsigned int) 0xFF <<  8) // （CKGR）主振荡器启动时间
// --------CKGR_MCFR：（CKGR偏移：0x4）主时钟频率寄存器--------
#define AT91C_CKGR_MAINF      ((unsigned int) 0xFFFF <<  0) // （CKGR）主时钟频率
#define AT91C_CKGR_MAINRDY    ((unsigned int) 0x1 << 16) // （CKGR）主时钟就绪
// --------CKGR_PLLR：（CKGR偏移：0xc）PLL B寄存器--------
#define AT91C_CKGR_DIV        ((unsigned int) 0xFF <<  0) // 已选择（CKGR）分频器
#define 	AT91C_CKGR_DIV_0                    ((unsigned int) 0x0) // （CKGR）除法器输出为0
#define 	AT91C_CKGR_DIV_BYPASS               ((unsigned int) 0x1) // （CKGR）分流器旁通
#define AT91C_CKGR_PLLCOUNT   ((unsigned int) 0x3F <<  8) // （CKGR）PLL计数器
#define AT91C_CKGR_OUT        ((unsigned int) 0x3 << 14) // （CKGR）PLL输出频率范围
#define 	AT91C_CKGR_OUT_0                    ((unsigned int) 0x0 << 14) // （CKGR）请参考PLL数据表
#define 	AT91C_CKGR_OUT_1                    ((unsigned int) 0x1 << 14) // （CKGR）请参考PLL数据表
#define 	AT91C_CKGR_OUT_2                    ((unsigned int) 0x2 << 14) // （CKGR）请参考PLL数据表
#define 	AT91C_CKGR_OUT_3                    ((unsigned int) 0x3 << 14) // （CKGR）请参考PLL数据表
#define AT91C_CKGR_MUL        ((unsigned int) 0x7FF << 16) // （CKGR）PLL乘法器
#define AT91C_CKGR_USBDIV     ((unsigned int) 0x3 << 28) // （CKGR）USB时钟分频器
#define 	AT91C_CKGR_USBDIV_0                    ((unsigned int) 0x0 << 28) // （CKGR）分频器输出为PLL时钟输出
#define 	AT91C_CKGR_USBDIV_1                    ((unsigned int) 0x1 << 28) // （CKGR）分频器输出是PLL时钟输出除以2
#define 	AT91C_CKGR_USBDIV_2                    ((unsigned int) 0x2 << 28) // （CKGR）分频器输出是PLL时钟输出除以4

// *****************************************************************************
//              电源管理控制器的软件API定义
// *****************************************************************************
typedef struct _AT91S_PMC {
	AT91_REG	 PMC_SCER; 	// 系统时钟启用寄存器
	AT91_REG	 PMC_SCDR; 	// 系统时钟禁用寄存器
	AT91_REG	 PMC_SCSR; 	// 系统时钟状态寄存器
	AT91_REG	 Reserved0[1]; 	// 
	AT91_REG	 PMC_PCER; 	// 外围时钟启用寄存器
	AT91_REG	 PMC_PCDR; 	// 外围时钟禁用寄存器
	AT91_REG	 PMC_PCSR; 	// 外围时钟状态寄存器
	AT91_REG	 Reserved1[1]; 	// 
	AT91_REG	 PMC_MOR; 	// 主振荡器寄存器
	AT91_REG	 PMC_MCFR; 	// 主时钟频率寄存器
	AT91_REG	 Reserved2[1]; 	// 
	AT91_REG	 PMC_PLLR; 	// PLL寄存器
	AT91_REG	 PMC_MCKR; 	// 主时钟寄存器
	AT91_REG	 Reserved3[3]; 	// 
	AT91_REG	 PMC_PCKR[4]; 	// 可编程时钟寄存器
	AT91_REG	 Reserved4[4]; 	// 
	AT91_REG	 PMC_IER; 	// 中断启用寄存器
	AT91_REG	 PMC_IDR; 	// 中断禁用寄存器
	AT91_REG	 PMC_SR; 	// 状态寄存器
	AT91_REG	 PMC_IMR; 	// 中断掩码寄存器
} AT91S_PMC, *AT91PS_PMC;

// --------PMC_SCER：（PMC偏移：0x0）系统时钟启用寄存器--------
#define AT91C_PMC_PCK         ((unsigned int) 0x1 <<  0) // （PMC）处理器时钟
#define AT91C_PMC_UDP         ((unsigned int) 0x1 <<  7) // （PMC）USB设备端口时钟
#define AT91C_PMC_PCK0        ((unsigned int) 0x1 <<  8) // （PMC）可编程时钟输出
#define AT91C_PMC_PCK1        ((unsigned int) 0x1 <<  9) // （PMC）可编程时钟输出
#define AT91C_PMC_PCK2        ((unsigned int) 0x1 << 10) // （PMC）可编程时钟输出
#define AT91C_PMC_PCK3        ((unsigned int) 0x1 << 11) // （PMC）可编程时钟输出
// --------PMC_SCDR：（PMC偏移：0x4）系统时钟禁用寄存器--------
// --------PMC_SCSR：（PMC偏移：0x8）系统时钟状态寄存器--------
// --------CKGR_MOR:（PMC偏移：0x20）主振荡器寄存器--------
// --------CKGR_MCFR：（PMC偏移：0x24）主时钟频率寄存器--------
// --------CKGR_PLLR：（PMC偏移：0x2c）PLL B寄存器--------
// --------PMC_MCKR：（PMC偏移：0x30）主时钟寄存器--------
#define AT91C_PMC_CSS         ((unsigned int) 0x3 <<  0) // （PMC）可编程时钟选择
#define 	AT91C_PMC_CSS_SLOW_CLK             ((unsigned int) 0x0) // （PMC）选择慢速时钟
#define 	AT91C_PMC_CSS_MAIN_CLK             ((unsigned int) 0x1) // （PMC）选择主时钟
#define 	AT91C_PMC_CSS_PLL_CLK              ((unsigned int) 0x3) // （PMC）选择PLL时钟
#define AT91C_PMC_PRES        ((unsigned int) 0x7 <<  2) // （PMC）可编程时钟预分频器
#define 	AT91C_PMC_PRES_CLK                  ((unsigned int) 0x0 <<  2) // （PMC）所选时钟
#define 	AT91C_PMC_PRES_CLK_2                ((unsigned int) 0x1 <<  2) // （PMC）所选时钟除以2
#define 	AT91C_PMC_PRES_CLK_4                ((unsigned int) 0x2 <<  2) // （PMC）所选时钟除以4
#define 	AT91C_PMC_PRES_CLK_8                ((unsigned int) 0x3 <<  2) // （PMC）所选时钟除以8
#define 	AT91C_PMC_PRES_CLK_16               ((unsigned int) 0x4 <<  2) // （PMC）所选时钟除以16
#define 	AT91C_PMC_PRES_CLK_32               ((unsigned int) 0x5 <<  2) // （PMC）所选时钟除以32
#define 	AT91C_PMC_PRES_CLK_64               ((unsigned int) 0x6 <<  2) // （PMC）所选时钟除以64
// --------PMC_PCKR：（PMC偏移：0x40）可编程时钟寄存器--------
// --------PMC_IER：（PMC偏移：0x60）PMC中断启用寄存器--------
#define AT91C_PMC_MOSCS       ((unsigned int) 0x1 <<  0) // （PMC）MOSC状态/启用/禁用/掩码
#define AT91C_PMC_LOCK        ((unsigned int) 0x1 <<  2) // （PMC）PLL状态/启用/禁用/屏蔽
#define AT91C_PMC_MCKRDY      ((unsigned int) 0x1 <<  3) // （PMC）MCK_RDY状态/启用/禁用/掩码
#define AT91C_PMC_PCK0RDY     ((unsigned int) 0x1 <<  8) // （PMC）PCK0_RDY状态/启用/禁用/屏蔽
#define AT91C_PMC_PCK1RDY     ((unsigned int) 0x1 <<  9) // （PMC）PCK1_RDY状态/启用/禁用/屏蔽
#define AT91C_PMC_PCK2RDY     ((unsigned int) 0x1 << 10) // （PMC）PCK2_RDY状态/启用/禁用/屏蔽
#define AT91C_PMC_PCK3RDY     ((unsigned int) 0x1 << 11) // （PMC）PCK3_RDY状态/启用/禁用/屏蔽
// --------PMC_IDR：（PMC偏移：0x64）PMC中断禁用寄存器--------
// --------PMC_SR：（PMC偏移量：0x68）PMC状态寄存器--------
// --------PMC_IMR：（PMC偏移：0x6c）PMC中断掩码寄存器--------

// *****************************************************************************
//              重置控制器接口的软件API定义
// *****************************************************************************
typedef struct _AT91S_RSTC {
	AT91_REG	 RSTC_RCR; 	// 重置控制寄存器
	AT91_REG	 RSTC_RSR; 	// 重置状态寄存器
	AT91_REG	 RSTC_RMR; 	// 重置模式寄存器
} AT91S_RSTC, *AT91PS_RSTC;

// --------RSTC_RCR：（RSTC偏移：0x0）重置控制寄存器--------
#define AT91C_RSTC_PROCRST    ((unsigned int) 0x1 <<  0) // （RSTC）处理器重置
#define AT91C_RSTC_PERRST     ((unsigned int) 0x1 <<  2) // （RSTC）外围设备重置
#define AT91C_RSTC_EXTRST     ((unsigned int) 0x1 <<  3) // （RSTC）外部复位
#define AT91C_RSTC_KEY        ((unsigned int) 0xFF << 24) // （RSTC）密码
// --------RSTC_RSR：（RSTC偏移：0x4）重置状态寄存器--------
#define AT91C_RSTC_URSTS      ((unsigned int) 0x1 <<  0) // （RSTC）用户重置状态
#define AT91C_RSTC_BODSTS     ((unsigned int) 0x1 <<  1) // （RSTC）电量不足检测状态
#define AT91C_RSTC_RSTTYP     ((unsigned int) 0x7 <<  8) // （RSTC）重置类型
#define 	AT91C_RSTC_RSTTYP_POWERUP              ((unsigned int) 0x0 <<  8) // （RSTC）加电复位。VDDCORE上升。
#define 	AT91C_RSTC_RSTTYP_WAKEUP               ((unsigned int) 0x1 <<  8) // （RSTC）唤醒重置。VDDCORE上升。
#define 	AT91C_RSTC_RSTTYP_WATCHDOG             ((unsigned int) 0x2 <<  8) // （RSTC）监视器重置。发生看门狗溢出。
#define 	AT91C_RSTC_RSTTYP_SOFTWARE             ((unsigned int) 0x3 <<  8) // （RSTC）软件重置。软件要求处理器复位。
#define 	AT91C_RSTC_RSTTYP_USER                 ((unsigned int) 0x4 <<  8) // （RSTC）用户重置。检测到NRST引脚过低。
#define 	AT91C_RSTC_RSTTYP_BROWNOUT             ((unsigned int) 0x5 <<  8) // （RSTC）发生断电重置。
#define AT91C_RSTC_NRSTL      ((unsigned int) 0x1 << 16) // （RSTC）NRST引脚电平
#define AT91C_RSTC_SRCMP      ((unsigned int) 0x1 << 17) // （RSTC）软件重置命令正在进行。
// --------RSTC_RMR：（RSTC偏移：0x8）重置模式寄存器--------
#define AT91C_RSTC_URSTEN     ((unsigned int) 0x1 <<  0) // （RSTC）用户重置启用
#define AT91C_RSTC_URSTIEN    ((unsigned int) 0x1 <<  4) // （RSTC）用户重置中断启用
#define AT91C_RSTC_ERSTL      ((unsigned int) 0xF <<  8) // （RSTC）用户重置长度
#define AT91C_RSTC_BODIEN     ((unsigned int) 0x1 << 16) // （RSTC）断电检测中断启用

// *****************************************************************************
//              实时定时器控制器接口的软件API定义
// *****************************************************************************
typedef struct _AT91S_RTTC {
	AT91_REG	 RTTC_RTMR; 	// 实时模式寄存器
	AT91_REG	 RTTC_RTAR; 	// 实时报警寄存器
	AT91_REG	 RTTC_RTVR; 	// 实时值寄存器
	AT91_REG	 RTTC_RTSR; 	// 实时状态寄存器
} AT91S_RTTC, *AT91PS_RTTC;

