DYXX-X/Library_zh/ESP32_API_zh/cmock/CMock/test/iar/iar_v4/incIAR/ioat91sam7x256.h
// --------RTTC_RTMR：（RTTC偏移：0x0）实时模式寄存器--------
#define AT91C_RTTC_RTPRES     ((unsigned int) 0xFFFF <<  0) // （RTTC）实时计时器预分频器值
#define AT91C_RTTC_ALMIEN     ((unsigned int) 0x1 << 16) // （RTTC）报警中断启用
#define AT91C_RTTC_RTTINCIEN  ((unsigned int) 0x1 << 17) // （RTTC）实时定时器增量中断启用
#define AT91C_RTTC_RTTRST     ((unsigned int) 0x1 << 18) // （RTTC）实时计时器重启
// --------RTTC_RTAR：（RTTC偏移：0x4）实时报警寄存器--------
#define AT91C_RTTC_ALMV       ((unsigned int) 0x0 <<  0) // （RTTC）报警值
// --------RTTC_RTVR：（RTTC偏移：0x8）当前实时值寄存器--------
#define AT91C_RTTC_CRTV       ((unsigned int) 0x0 <<  0) // （RTTC）当前实时值
// --------RTTC_RTSR：（RTTC偏移：0xc）实时状态寄存器--------
#define AT91C_RTTC_ALMS       ((unsigned int) 0x1 <<  0) // （RTTC）实时报警状态
#define AT91C_RTTC_RTTINC     ((unsigned int) 0x1 <<  1) // （RTTC）实时计时器增量

// *****************************************************************************
//              周期间隔定时器控制器接口的软件API定义
// *****************************************************************************
typedef struct _AT91S_PITC {
	AT91_REG	 PITC_PIMR; 	// 周期间隔模式寄存器
	AT91_REG	 PITC_PISR; 	// 周期间隔状态寄存器
	AT91_REG	 PITC_PIVR; 	// 周期间隔值寄存器
	AT91_REG	 PITC_PIIR; 	// 周期间隔图像寄存器
} AT91S_PITC, *AT91PS_PITC;

// --------PITC_PIR:（PITC偏移：0x0）周期间隔模式寄存器--------
#define AT91C_PITC_PIV        ((unsigned int) 0xFFFFF <<  0) // （PITC）周期间隔值
#define AT91C_PITC_PITEN      ((unsigned int) 0x1 << 24) // （PITC）周期间隔计时器已启用
#define AT91C_PITC_PITIEN     ((unsigned int) 0x1 << 25) // （PITC）周期间隔定时器中断启用
// --------PITC_PISR:（PITC偏移量：0x4）周期间隔状态寄存器--------
#define AT91C_PITC_PITS       ((unsigned int) 0x1 <<  0) // （PITC）周期间隔计时器状态
// --------PITC_PIVR：（PITC偏移量：0x8）周期间隔值寄存器--------
#define AT91C_PITC_CPIV       ((unsigned int) 0xFFFFF <<  0) // （PITC）当前周期间隔值
#define AT91C_PITC_PICNT      ((unsigned int) 0xFFF << 20) // （PITC）周期间隔计数器
// --------PITC_PIR:（PITC偏移：0xc）周期间隔图像寄存器--------

// *****************************************************************************
//              看门狗定时器控制器接口的软件API定义
// *****************************************************************************
typedef struct _AT91S_WDTC {
	AT91_REG	 WDTC_WDCR; 	// 看门狗控制寄存器
	AT91_REG	 WDTC_WDMR; 	// 看门狗模式寄存器
	AT91_REG	 WDTC_WDSR; 	// 看门狗状态寄存器
} AT91S_WDTC, *AT91PS_WDTC;

// --------WDTC_WDCR：（WDTC偏移：0x0）周期间隔图像寄存器--------
#define AT91C_WDTC_WDRSTT     ((unsigned int) 0x1 <<  0) // （WDTC）监视器重新启动
#define AT91C_WDTC_KEY        ((unsigned int) 0xFF << 24) // （WDTC）看门狗密钥密码
// --------WDTC_WDMR：（WDTC偏移：0x4）看门狗模式寄存器--------
#define AT91C_WDTC_WDV        ((unsigned int) 0xFFF <<  0) // （WDTC）看门狗计时器重新启动
#define AT91C_WDTC_WDFIEN     ((unsigned int) 0x1 << 12) // （WDTC）看门狗故障中断启用
#define AT91C_WDTC_WDRSTEN    ((unsigned int) 0x1 << 13) // （WDTC）监视器重置启用
#define AT91C_WDTC_WDRPROC    ((unsigned int) 0x1 << 14) // （WDTC）看门狗计时器重新启动
#define AT91C_WDTC_WDDIS      ((unsigned int) 0x1 << 15) // （WDTC）看门狗禁用
#define AT91C_WDTC_WDD        ((unsigned int) 0xFFF << 16) // （WDTC）看门狗增量值
#define AT91C_WDTC_WDDBGHLT   ((unsigned int) 0x1 << 28) // （WDTC）监视器调试停止
#define AT91C_WDTC_WDIDLEHLT  ((unsigned int) 0x1 << 29) // （WDTC）看门狗空闲停止
// --------WDTC_WDSR:（WDTC偏移量：0x8）看门狗状态寄存器--------
#define AT91C_WDTC_WDUNF      ((unsigned int) 0x1 <<  0) // （WDTC）看门狗欠流
#define AT91C_WDTC_WDERR      ((unsigned int) 0x1 <<  1) // （WDTC）看门狗错误

// *****************************************************************************
//              稳压器模式控制器接口的软件API定义
// *****************************************************************************
typedef struct _AT91S_VREG {
	AT91_REG	 VREG_MR; 	// 电压调节器模式寄存器
} AT91S_VREG, *AT91PS_VREG;

// --------VREG_MR：（VREG偏移：0x0）电压调节器模式寄存器--------
#define AT91C_VREG_PSTDBY     ((unsigned int) 0x1 <<  0) // （VREG）电压调节器电源待机模式

// *****************************************************************************
//              存储器控制器接口的软件API定义
// *****************************************************************************
typedef struct _AT91S_MC {
	AT91_REG	 MC_RCR; 	// MC重映射控制寄存器
	AT91_REG	 MC_ASR; 	// MC中止状态寄存器
	AT91_REG	 MC_AASR; 	// MC中止地址状态寄存器
	AT91_REG	 Reserved0[21]; 	// 
	AT91_REG	 MC_FMR; 	// MC闪存模式寄存器
	AT91_REG	 MC_FCR; 	// MC闪存命令寄存器
	AT91_REG	 MC_FSR; 	// MC闪存状态寄存器
} AT91S_MC, *AT91PS_MC;

// --------MC_RCR：（MC偏移：0x0）MC重映射控制寄存器--------
#define AT91C_MC_RCB          ((unsigned int) 0x1 <<  0) // （MC）重映射命令位
// --------MC_ASR:（MC偏移量：0x4）MC中止状态寄存器--------
#define AT91C_MC_UNDADD       ((unsigned int) 0x1 <<  0) // （MC）未定义的地址中止状态
#define AT91C_MC_MISADD       ((unsigned int) 0x1 <<  1) // （MC）地址错误中止状态
#define AT91C_MC_ABTSZ        ((unsigned int) 0x3 <<  8) // （MC）中止大小状态
#define 	AT91C_MC_ABTSZ_BYTE                 ((unsigned int) 0x0 <<  8) // （MC）字节
#define 	AT91C_MC_ABTSZ_HWORD                ((unsigned int) 0x1 <<  8) // （MC）半字
#define 	AT91C_MC_ABTSZ_WORD                 ((unsigned int) 0x2 <<  8) // （MC）字
#define AT91C_MC_ABTTYP       ((unsigned int) 0x3 << 10) // （MC）中止类型状态
#define 	AT91C_MC_ABTTYP_DATAR                ((unsigned int) 0x0 << 10) // （MC）数据读取
#define 	AT91C_MC_ABTTYP_DATAW                ((unsigned int) 0x1 << 10) // （MC）数据写入
#define 	AT91C_MC_ABTTYP_FETCH                ((unsigned int) 0x2 << 10) // （MC）代码获取
#define AT91C_MC_MST0         ((unsigned int) 0x1 << 16) // （MC）主机0中止源
#define AT91C_MC_MST1         ((unsigned int) 0x1 << 17) // （MC）主1中止源
#define AT91C_MC_SVMST0       ((unsigned int) 0x1 << 24) // （MC）保存的主机0中止源
#define AT91C_MC_SVMST1       ((unsigned int) 0x1 << 25) // （MC）保存的主1中止源
// --------MC_FMR：（MC偏移：0x60）MC闪存模式寄存器--------
#define AT91C_MC_FRDY         ((unsigned int) 0x1 <<  0) // （MC）闪存就绪
#define AT91C_MC_LOCKE        ((unsigned int) 0x1 <<  2) // （MC）锁定错误
#define AT91C_MC_PROGE        ((unsigned int) 0x1 <<  3) // （MC）编程错误
#define AT91C_MC_NEBP         ((unsigned int) 0x1 <<  7) // （MC）编程前无擦除
#define AT91C_MC_FWS          ((unsigned int) 0x3 <<  8) // （MC）闪存等待状态
#define 	AT91C_MC_FWS_0FWS                 ((unsigned int) 0x0 <<  8) // （MC）1个周期用于读取，2个周期用于写入操作
#define 	AT91C_MC_FWS_1FWS                 ((unsigned int) 0x1 <<  8) // （MC）读取操作2个周期，写入操作3个周期
#define 	AT91C_MC_FWS_2FWS                 ((unsigned int) 0x2 <<  8) // （MC）3个周期用于读取，4个周期用于写入操作
#define 	AT91C_MC_FWS_3FWS                 ((unsigned int) 0x3 <<  8) // （MC）读操作4个周期，写操作4个
#define AT91C_MC_FMCN         ((unsigned int) 0xFF << 16) // （MC）闪存微秒循环数
// --------MC_FCR：（MC偏移：0x64）MC闪存命令寄存器--------
#define AT91C_MC_FCMD         ((unsigned int) 0xF <<  0) // （MC）闪存命令
#define 	AT91C_MC_FCMD_START_PROG           ((unsigned int) 0x1) // （MC）启动PAGEN指定页的编程。
#define 	AT91C_MC_FCMD_LOCK                 ((unsigned int) 0x2) // （MC）开始由字段PAGEN的位4至7定义的扇区的锁定序列。
#define 	AT91C_MC_FCMD_PROG_AND_LOCK        ((unsigned int) 0x3) // （MC）编程序列完成后，锁定序列自动发生。
#define 	AT91C_MC_FCMD_UNLOCK               ((unsigned int) 0x4) // （MC）开始由字段PAGEN的位4至7定义的扇区的解锁序列。
#define 	AT91C_MC_FCMD_ERASE_ALL            ((unsigned int) 0x8) // （MC）开始擦除整个闪存。如果至少有一个页面被锁定，则该命令将被取消。
#define 	AT91C_MC_FCMD_SET_GP_NVM           ((unsigned int) 0xB) // （MC）设置通用NVM位。
#define 	AT91C_MC_FCMD_CLR_GP_NVM           ((unsigned int) 0xD) // （MC）清除通用NVM位。
#define 	AT91C_MC_FCMD_SET_SECURITY         ((unsigned int) 0xF) // （MC）设置安全位。
#define AT91C_MC_PAGEN        ((unsigned int) 0x3FF <<  8) // （MC）页码
#define AT91C_MC_KEY          ((unsigned int) 0xFF << 24) // （MC）写入保护密钥
// --------MC_FSR:（MC偏移：0x68）MC闪存命令寄存器--------
#define AT91C_MC_SECURITY     ((unsigned int) 0x1 <<  4) // （MC）安全位状态
#define AT91C_MC_GPNVM0       ((unsigned int) 0x1 <<  8) // （MC）扇区0锁定状态
#define AT91C_MC_GPNVM1       ((unsigned int) 0x1 <<  9) // （MC）扇区1锁定状态
#define AT91C_MC_GPNVM2       ((unsigned int) 0x1 << 10) // （MC）扇区2锁定状态
#define AT91C_MC_GPNVM3       ((unsigned int) 0x1 << 11) // （MC）扇区3锁定状态
#define AT91C_MC_GPNVM4       ((unsigned int) 0x1 << 12) // （MC）扇区4锁定状态
#define AT91C_MC_GPNVM5       ((unsigned int) 0x1 << 13) // （MC）扇区5锁定状态
#define AT91C_MC_GPNVM6       ((unsigned int) 0x1 << 14) // （MC）扇区6锁定状态
#define AT91C_MC_GPNVM7       ((unsigned int) 0x1 << 15) // （MC）扇区7锁定状态
#define AT91C_MC_LOCKS0       ((unsigned int) 0x1 << 16) // （MC）扇区0锁定状态
#define AT91C_MC_LOCKS1       ((unsigned int) 0x1 << 17) // （MC）扇区1锁定状态
#define AT91C_MC_LOCKS2       ((unsigned int) 0x1 << 18) // （MC）扇区2锁定状态
#define AT91C_MC_LOCKS3       ((unsigned int) 0x1 << 19) // （MC）扇区3锁定状态
#define AT91C_MC_LOCKS4       ((unsigned int) 0x1 << 20) // （MC）扇区4锁定状态
#define AT91C_MC_LOCKS5       ((unsigned int) 0x1 << 21) // （MC）扇区5锁定状态
#define AT91C_MC_LOCKS6       ((unsigned int) 0x1 << 22) // （MC）扇区6锁定状态
#define AT91C_MC_LOCKS7       ((unsigned int) 0x1 << 23) // （MC）扇区7锁定状态
#define AT91C_MC_LOCKS8       ((unsigned int) 0x1 << 24) // （MC）扇区8锁定状态
#define AT91C_MC_LOCKS9       ((unsigned int) 0x1 << 25) // （MC）扇区9锁定状态
#define AT91C_MC_LOCKS10      ((unsigned int) 0x1 << 26) // （MC）扇区10锁定状态
#define AT91C_MC_LOCKS11      ((unsigned int) 0x1 << 27) // （MC）扇区11锁定状态
#define AT91C_MC_LOCKS12      ((unsigned int) 0x1 << 28) // （MC）扇区12锁定状态
#define AT91C_MC_LOCKS13      ((unsigned int) 0x1 << 29) // （MC）扇区13锁定状态
#define AT91C_MC_LOCKS14      ((unsigned int) 0x1 << 30) // （MC）扇区14锁定状态
#define AT91C_MC_LOCKS15      ((unsigned int) 0x1 << 31) // （MC）扇区15锁定状态

// *****************************************************************************
//              串行并行接口的软件API定义
// *****************************************************************************
typedef struct _AT91S_SPI {
	AT91_REG	 SPI_CR; 	// 控制寄存器
	AT91_REG	 SPI_MR; 	// 模式寄存器
	AT91_REG	 SPI_RDR; 	// 接收数据寄存器
	AT91_REG	 SPI_TDR; 	// 传输数据寄存器
	AT91_REG	 SPI_SR; 	// 状态寄存器
	AT91_REG	 SPI_IER; 	// 中断启用寄存器
	AT91_REG	 SPI_IDR; 	// 中断禁用寄存器
	AT91_REG	 SPI_IMR; 	// 中断掩码寄存器
	AT91_REG	 Reserved0[4]; 	// 
	AT91_REG	 SPI_CSR[4]; 	// 芯片选择寄存器
	AT91_REG	 Reserved1[48]; 	// 
	AT91_REG	 SPI_RPR; 	// 接收指针寄存器
	AT91_REG	 SPI_RCR; 	// 接收计数器寄存器
	AT91_REG	 SPI_TPR; 	// 发送指针寄存器
	AT91_REG	 SPI_TCR; 	// 发送计数器寄存器
	AT91_REG	 SPI_RNPR; 	// 接收下一个指针寄存器
	AT91_REG	 SPI_RNCR; 	// 接收下一计数器寄存器
	AT91_REG	 SPI_TNPR; 	// 发送下一指针寄存器
	AT91_REG	 SPI_TNCR; 	// 发送下一计数器寄存器
	AT91_REG	 SPI_PTCR; 	// PDC传输控制寄存器
	AT91_REG	 SPI_PTSR; 	// PDC传输状态寄存器
} AT91S_SPI, *AT91PS_SPI;

// --------SPI_CR：（SPI偏移：0x0）SPI控制寄存器--------
#define AT91C_SPI_SPIEN       ((unsigned int) 0x1 <<  0) // （SPI）SPI启用
#define AT91C_SPI_SPIDIS      ((unsigned int) 0x1 <<  1) // （SPI）SPI禁用
#define AT91C_SPI_SWRST       ((unsigned int) 0x1 <<  7) // （SPI）SPI软件复位
#define AT91C_SPI_LASTXFER    ((unsigned int) 0x1 << 24) // （SPI）SPI上次传输
// --------SPI_MR：（SPI偏移量：0x4）SPI模式寄存器--------
#define AT91C_SPI_MSTR        ((unsigned int) 0x1 <<  0) // （SPI）主/从模式
#define AT91C_SPI_PS          ((unsigned int) 0x1 <<  1) // （SPI）外围设备选择
#define 	AT91C_SPI_PS_FIXED                ((unsigned int) 0x0 <<  1) // （SPI）固定外设选择
#define 	AT91C_SPI_PS_VARIABLE             ((unsigned int) 0x1 <<  1) // （SPI）可变外围设备选择
#define AT91C_SPI_PCSDEC      ((unsigned int) 0x1 <<  2) // （SPI）芯片选择解码
#define AT91C_SPI_FDIV        ((unsigned int) 0x1 <<  3) // （SPI）时钟选择
#define AT91C_SPI_MODFDIS     ((unsigned int) 0x1 <<  4) // （SPI）模式故障检测
#define AT91C_SPI_LLB         ((unsigned int) 0x1 <<  7) // （SPI）时钟选择
#define AT91C_SPI_PCS         ((unsigned int) 0xF << 16) // （SPI）外围芯片选择
#define AT91C_SPI_DLYBCS      ((unsigned int) 0xFF << 24) // 芯片选择之间的（SPI）延迟
// --------SPI_RDR:（SPI偏移量：0x8）接收数据寄存器--------
#define AT91C_SPI_RD          ((unsigned int) 0xFFFF <<  0) // （SPI）接收数据
#define AT91C_SPI_RPCS        ((unsigned int) 0xF << 16) // （SPI）外围芯片选择状态
// --------SPI_TDR：（SPI偏移量：0xc）传输数据寄存器--------
#define AT91C_SPI_TD          ((unsigned int) 0xFFFF <<  0) // （SPI）传输数据
#define AT91C_SPI_TPCS        ((unsigned int) 0xF << 16) // （SPI）外围芯片选择状态
// --------SPI_SR：（SPI偏移量：0x10）状态寄存器--------
#define AT91C_SPI_RDRF        ((unsigned int) 0x1 <<  0) // （SPI）接收数据寄存器已满
#define AT91C_SPI_TDRE        ((unsigned int) 0x1 <<  1) // （SPI）传输数据寄存器为空
#define AT91C_SPI_MODF        ((unsigned int) 0x1 <<  2) // （SPI）模式故障错误
#define AT91C_SPI_OVRES       ((unsigned int) 0x1 <<  3) // （SPI）超限错误状态
#define AT91C_SPI_ENDRX       ((unsigned int) 0x1 <<  4) // （SPI）接收器传输结束
#define AT91C_SPI_ENDTX       ((unsigned int) 0x1 <<  5) // （SPI）接收器传输结束
#define AT91C_SPI_RXBUFF      ((unsigned int) 0x1 <<  6) // （SPI）RXBUFF中断
#define AT91C_SPI_TXBUFE      ((unsigned int) 0x1 <<  7) // （SPI）TXBUFE中断
#define AT91C_SPI_NSSR        ((unsigned int) 0x1 <<  8) // （SPI）NSSR中断
#define AT91C_SPI_TXEMPTY     ((unsigned int) 0x1 <<  9) // （SPI）TXEMPTY中断
#define AT91C_SPI_SPIENS      ((unsigned int) 0x1 << 16) // （SPI）启用状态
// --------SPI_IER：（SPI偏移：0x14）中断启用寄存器--------
// --------SPI_IDR：（SPI偏移量：0x18）中断禁用寄存器--------
// --------SPI_IMR：（SPI偏移量：0x1c）中断掩码寄存器--------
// --------SPI_CSR:（SPI偏移：0x30）芯片选择寄存器--------
#define AT91C_SPI_CPOL        ((unsigned int) 0x1 <<  0) // （SPI）时钟极性
#define AT91C_SPI_NCPHA       ((unsigned int) 0x1 <<  1) // （SPI）时钟相位
#define AT91C_SPI_CSAAT       ((unsigned int) 0x1 <<  3) // 传输后激活（SPI）芯片选择
#define AT91C_SPI_BITS        ((unsigned int) 0xF <<  4) // （SPI）每次传输位
#define 	AT91C_SPI_BITS_8                    ((unsigned int) 0x0 <<  4) // （SPI）每次传输8位
#define 	AT91C_SPI_BITS_9                    ((unsigned int) 0x1 <<  4) // （SPI）每次传输9位
#define 	AT91C_SPI_BITS_10                   ((unsigned int) 0x2 <<  4) // （SPI）每次传输10位
#define 	AT91C_SPI_BITS_11                   ((unsigned int) 0x3 <<  4) // （SPI）每次传输11位
#define 	AT91C_SPI_BITS_12                   ((unsigned int) 0x4 <<  4) // （SPI）每次传输12位
#define 	AT91C_SPI_BITS_13                   ((unsigned int) 0x5 <<  4) // （SPI）每次传输13位
#define 	AT91C_SPI_BITS_14                   ((unsigned int) 0x6 <<  4) // （SPI）每次传输14位
#define 	AT91C_SPI_BITS_15                   ((unsigned int) 0x7 <<  4) // （SPI）每次传输15位
#define 	AT91C_SPI_BITS_16                   ((unsigned int) 0x8 <<  4) // （SPI）每次传输16位
#define AT91C_SPI_SCBR        ((unsigned int) 0xFF <<  8) // （SPI）串行时钟波特率
#define AT91C_SPI_DLYBS       ((unsigned int) 0xFF << 16) // SPCK之前的（SPI）延迟
#define AT91C_SPI_DLYBCT      ((unsigned int) 0xFF << 24) // （SPI）连续传输之间的延迟

// *****************************************************************************
//              用于Usart的软件API定义
// *****************************************************************************
typedef struct _AT91S_USART {
	AT91_REG	 US_CR; 	// 控制寄存器
	AT91_REG	 US_MR; 	// 模式寄存器
	AT91_REG	 US_IER; 	// 中断启用寄存器
	AT91_REG	 US_IDR; 	// 中断禁用寄存器
	AT91_REG	 US_IMR; 	// 中断掩码寄存器
	AT91_REG	 US_CSR; 	// 信道状态寄存器
	AT91_REG	 US_RHR; 	// 接收机保持寄存器
	AT91_REG	 US_THR; 	// 变送器保持寄存器
	AT91_REG	 US_BRGR; 	// 波特率发生器寄存器
	AT91_REG	 US_RTOR; 	// 接收机超时寄存器
	AT91_REG	 US_TTGR; 	// 变送器时间保护寄存器
	AT91_REG	 Reserved0[5]; 	// 
	AT91_REG	 US_FIDI; 	// FI_DI_Ratio寄存器
	AT91_REG	 US_NER; 	// Nb错误寄存器
	AT91_REG	 Reserved1[1]; 	// 
	AT91_REG	 US_IF; 	// IRDA_FILTER寄存器
	AT91_REG	 Reserved2[44]; 	// 
	AT91_REG	 US_RPR; 	// 接收指针寄存器
	AT91_REG	 US_RCR; 	// 接收计数器寄存器
	AT91_REG	 US_TPR; 	// 发送指针寄存器
	AT91_REG	 US_TCR; 	// 发送计数器寄存器
	AT91_REG	 US_RNPR; 	// 接收下一个指针寄存器
	AT91_REG	 US_RNCR; 	// 接收下一计数器寄存器
	AT91_REG	 US_TNPR; 	// 发送下一指针寄存器
	AT91_REG	 US_TNCR; 	// 发送下一计数器寄存器
	AT91_REG	 US_PTCR; 	// PDC传输控制寄存器
	AT91_REG	 US_PTSR; 	// PDC传输状态寄存器
} AT91S_USART, *AT91PS_USART;

// --------US_CR：（USART偏移：0x0）调试单元控制寄存器--------
#define AT91C_US_STTBRK       ((unsigned int) 0x1 <<  9) // （USART）开始休息
#define AT91C_US_STPBRK       ((unsigned int) 0x1 << 10) // （USART）停车休息
#define AT91C_US_STTTO        ((unsigned int) 0x1 << 11) // （USART）开始超时
#define AT91C_US_SENDA        ((unsigned int) 0x1 << 12) // （USART）发送地址
#define AT91C_US_RSTIT        ((unsigned int) 0x1 << 13) // （USART）重置迭代
#define AT91C_US_RSTNACK      ((unsigned int) 0x1 << 14) // （USART）重置不确认
#define AT91C_US_RETTO        ((unsigned int) 0x1 << 15) // （USART）重新排列超时
#define AT91C_US_DTREN        ((unsigned int) 0x1 << 16) // （USART）数据终端就绪启用
#define AT91C_US_DTRDIS       ((unsigned int) 0x1 << 17) // （USART）数据终端就绪禁用
#define AT91C_US_RTSEN        ((unsigned int) 0x1 << 18) // （USART）请求发送启用
#define AT91C_US_RTSDIS       ((unsigned int) 0x1 << 19) // （USART）请求发送禁用
// --------US_MR：（USART偏移：0x4）调试单元模式寄存器--------
#define AT91C_US_USMODE       ((unsigned int) 0xF <<  0) // （USART）USART模式
#define 	AT91C_US_USMODE_NORMAL               ((unsigned int) 0x0) // （USART）正常
#define 	AT91C_US_USMODE_RS485                ((unsigned int) 0x1) // (USART) RS485
#define 	AT91C_US_USMODE_HWHSH                ((unsigned int) 0x2) // （USART）硬件握手
#define 	AT91C_US_USMODE_MODEM                ((unsigned int) 0x3) // （USART）调制解调器
#define 	AT91C_US_USMODE_ISO7816_0            ((unsigned int) 0x4) // （USART）ISO7816协议：T=0
#define 	AT91C_US_USMODE_ISO7816_1            ((unsigned int) 0x6) // （USART）ISO7816协议：T=1
#define 	AT91C_US_USMODE_IRDA                 ((unsigned int) 0x8) // （USART）伊拉克陆军部
#define 	AT91C_US_USMODE_SWHSH                ((unsigned int) 0xC) // （USART）软件握手
#define AT91C_US_CLKS         ((unsigned int) 0x3 <<  4) // （USART）时钟选择（波特率发生器输入时钟
#define 	AT91C_US_CLKS_CLOCK                ((unsigned int) 0x0 <<  4) // （USART）时钟
#define 	AT91C_US_CLKS_FDIV1                ((unsigned int) 0x1 <<  4) // （美国陆军）fdiv1
#define 	AT91C_US_CLKS_SLOW                 ((unsigned int) 0x2 <<  4) // （USART）慢锁（ARM）
#define 	AT91C_US_CLKS_EXT                  ((unsigned int) 0x3 <<  4) // （USART）外部（SCK）
#define AT91C_US_CHRL         ((unsigned int) 0x3 <<  6) // （USART）时钟选择（波特率发生器输入时钟
#define 	AT91C_US_CHRL_5_BITS               ((unsigned int) 0x0 <<  6) // （USART）字符长度：5位
#define 	AT91C_US_CHRL_6_BITS               ((unsigned int) 0x1 <<  6) // （USART）字符长度：6位
#define 	AT91C_US_CHRL_7_BITS               ((unsigned int) 0x2 <<  6) // （USART）字符长度：7位
#define 	AT91C_US_CHRL_8_BITS               ((unsigned int) 0x3 <<  6) // （USART）字符长度：8位
#define AT91C_US_SYNC         ((unsigned int) 0x1 <<  8) // （USART）同步模式选择
#define AT91C_US_NBSTOP       ((unsigned int) 0x3 << 12) // （USART）停止位数
#define 	AT91C_US_NBSTOP_1_BIT                ((unsigned int) 0x0 << 12) // （USART）1个停止位
#define 	AT91C_US_NBSTOP_15_BIT               ((unsigned int) 0x1 << 12) // （USART）异步（SYNC=0）2个停止位同步（SYNC=1）2个终止位
#define 	AT91C_US_NBSTOP_2_BIT                ((unsigned int) 0x2 << 12) // （USART）2个停止位
#define AT91C_US_MSBF         ((unsigned int) 0x1 << 16) // （USART）位顺序
#define AT91C_US_MODE9        ((unsigned int) 0x1 << 17) // （USART）9位字符长度
#define AT91C_US_CKLO         ((unsigned int) 0x1 << 18) // （USART）时钟输出选择
#define AT91C_US_OVER         ((unsigned int) 0x1 << 19) // （USART）过采样模式
#define AT91C_US_INACK        ((unsigned int) 0x1 << 20) // （USART）禁止不确认
#define AT91C_US_DSNACK       ((unsigned int) 0x1 << 21) // （USART）禁用连续NACK
#define AT91C_US_MAX_ITER     ((unsigned int) 0x1 << 24) // （USART）重复次数
#define AT91C_US_FILTER       ((unsigned int) 0x1 << 28) // （USART）接收线滤波器
// --------US_IER：（USART偏移：0x8）调试单元中断启用寄存器--------
#define AT91C_US_RXBRK        ((unsigned int) 0x1 <<  2) // （USART）休息接收/休息结束
#define AT91C_US_TIMEOUT      ((unsigned int) 0x1 <<  8) // （USART）接收机超时
#define AT91C_US_ITERATION    ((unsigned int) 0x1 << 10) // （USART）达到的最大重复次数
#define AT91C_US_NACK         ((unsigned int) 0x1 << 13) // （USART）不承认
#define AT91C_US_RIIC         ((unsigned int) 0x1 << 16) // （USART）响铃指示器输入更改标志
#define AT91C_US_DSRIC        ((unsigned int) 0x1 << 17) // （USART）数据集就绪输入更改标志
#define AT91C_US_DCDIC        ((unsigned int) 0x1 << 18) // （USART）数据载体标志
#define AT91C_US_CTSIC        ((unsigned int) 0x1 << 19) // （USART）清除以发送输入更改标志
// --------US_IDR：（USART偏移：0xc）调试单元中断禁用寄存器--------
// --------US_IMR：（USART偏移：0x10）调试单元中断掩码寄存器--------
// --------US_CSR:（USART偏移：0x14）调试单元信道状态寄存器--------
#define AT91C_US_RI           ((unsigned int) 0x1 << 20) // （USART）RI输入图像
#define AT91C_US_DSR          ((unsigned int) 0x1 << 21) // （USART）DSR输入图像
#define AT91C_US_DCD          ((unsigned int) 0x1 << 22) // （USART）DCD输入图像
#define AT91C_US_CTS          ((unsigned int) 0x1 << 23) // （USART）CTS输入图像

// *****************************************************************************
//              同步串行控制器接口的软件API定义
// *****************************************************************************
typedef struct _AT91S_SSC {
	AT91_REG	 SSC_CR; 	// 控制寄存器
	AT91_REG	 SSC_CMR; 	// 时钟模式寄存器
	AT91_REG	 Reserved0[2]; 	// 
	AT91_REG	 SSC_RCMR; 	// 接收时钟模式寄存器
	AT91_REG	 SSC_RFMR; 	// 接收帧模式寄存器
	AT91_REG	 SSC_TCMR; 	// 发送时钟模式寄存器
	AT91_REG	 SSC_TFMR; 	// 发送帧模式寄存器
	AT91_REG	 SSC_RHR; 	// 接收保持寄存器
	AT91_REG	 SSC_THR; 	// 发送保持寄存器
	AT91_REG	 Reserved1[2]; 	// 
	AT91_REG	 SSC_RSHR; 	// 接收同步保持寄存器
	AT91_REG	 SSC_TSHR; 	// 传输同步保持寄存器
	AT91_REG	 Reserved2[2]; 	// 
	AT91_REG	 SSC_SR; 	// 状态寄存器
	AT91_REG	 SSC_IER; 	// 中断启用寄存器
	AT91_REG	 SSC_IDR; 	// 中断禁用寄存器
	AT91_REG	 SSC_IMR; 	// 中断掩码寄存器
	AT91_REG	 Reserved3[44]; 	// 
	AT91_REG	 SSC_RPR; 	// 接收指针寄存器
	AT91_REG	 SSC_RCR; 	// 接收计数器寄存器
	AT91_REG	 SSC_TPR; 	// 发送指针寄存器
	AT91_REG	 SSC_TCR; 	// 发送计数器寄存器
	AT91_REG	 SSC_RNPR; 	// 接收下一个指针寄存器
	AT91_REG	 SSC_RNCR; 	// 接收下一计数器寄存器
	AT91_REG	 SSC_TNPR; 	// 发送下一指针寄存器
	AT91_REG	 SSC_TNCR; 	// 发送下一计数器寄存器
	AT91_REG	 SSC_PTCR; 	// PDC传输控制寄存器
	AT91_REG	 SSC_PTSR; 	// PDC传输状态寄存器
} AT91S_SSC, *AT91PS_SSC;

