DYXX-X/Library_zh/ESP32_API_zh/cmock/CMock/test/iar/iar_v4/incIAR/ioat91sam7x256.h
// --------SSC_CR：（SSC偏移：0x0）SSC控制寄存器--------
#define AT91C_SSC_RXEN        ((unsigned int) 0x1 <<  0) // （SSC）接收启用
#define AT91C_SSC_RXDIS       ((unsigned int) 0x1 <<  1) // （SSC）接收禁用
#define AT91C_SSC_TXEN        ((unsigned int) 0x1 <<  8) // （SSC）传输启用
#define AT91C_SSC_TXDIS       ((unsigned int) 0x1 <<  9) // （SSC）发送禁用
#define AT91C_SSC_SWRST       ((unsigned int) 0x1 << 15) // （SSC）软件重置
// --------SSC_RCMR：（SSC偏移：0x10）SSC接收时钟模式寄存器--------
#define AT91C_SSC_CKS         ((unsigned int) 0x3 <<  0) // （SSC）接收/发送时钟选择
#define 	AT91C_SSC_CKS_DIV                  ((unsigned int) 0x0) // （SSC）分频时钟
#define 	AT91C_SSC_CKS_TK                   ((unsigned int) 0x1) // （SSC）TK时钟信号
#define 	AT91C_SSC_CKS_RK                   ((unsigned int) 0x2) // （SSC）RK销
#define AT91C_SSC_CKO         ((unsigned int) 0x7 <<  2) // （SSC）接收/发送时钟输出模式选择
#define 	AT91C_SSC_CKO_NONE                 ((unsigned int) 0x0 <<  2) // （SSC）接收/发送时钟输出模式：无RK引脚：仅输入
#define 	AT91C_SSC_CKO_CONTINOUS            ((unsigned int) 0x1 <<  2) // （SSC）连续接收/发送时钟RK引脚：输出
#define 	AT91C_SSC_CKO_DATA_TX              ((unsigned int) 0x2 <<  2) // （SSC）仅在数据传输期间接收/发送时钟RK引脚：输出
#define AT91C_SSC_CKI         ((unsigned int) 0x1 <<  5) // （SSC）接收/发送时钟反转
#define AT91C_SSC_CKG         ((unsigned int) 0x3 <<  6) // （SSC）接收/发送时钟门控选择
#define 	AT91C_SSC_CKG_NONE                 ((unsigned int) 0x0 <<  6) // （SSC）接收/发送时钟门控：无，连续时钟
#define 	AT91C_SSC_CKG_LOW                  ((unsigned int) 0x1 <<  6) // （SSC）仅在RF低时启用接收/发送时钟
#define 	AT91C_SSC_CKG_HIGH                 ((unsigned int) 0x2 <<  6) // （SSC）仅当RF高时才启用接收/发送时钟
#define AT91C_SSC_START       ((unsigned int) 0xF <<  8) // （SSC）接收/发送开始选择
#define 	AT91C_SSC_START_CONTINOUS            ((unsigned int) 0x0 <<  8) // （SSC）一旦启用接收器，在前一数据传输结束后立即连续。
#define 	AT91C_SSC_START_TX                   ((unsigned int) 0x1 <<  8) // （SSC）发送/接收启动
#define 	AT91C_SSC_START_LOW_RF               ((unsigned int) 0x2 <<  8) // （SSC）射频输入低电平检测
#define 	AT91C_SSC_START_HIGH_RF              ((unsigned int) 0x3 <<  8) // （SSC）射频输入高电平检测
#define 	AT91C_SSC_START_FALL_RF              ((unsigned int) 0x4 <<  8) // （SSC）检测RF输入的下降沿
#define 	AT91C_SSC_START_RISE_RF              ((unsigned int) 0x5 <<  8) // （SSC）检测RF输入上的上升沿
#define 	AT91C_SSC_START_LEVEL_RF             ((unsigned int) 0x6 <<  8) // （SSC）检测射频输入的任何电平变化
#define 	AT91C_SSC_START_EDGE_RF              ((unsigned int) 0x7 <<  8) // （SSC）检测RF输入上的任何边缘
#define 	AT91C_SSC_START_0                    ((unsigned int) 0x8 <<  8) // （SSC）比较0
#define AT91C_SSC_STOP        ((unsigned int) 0x1 << 12) // （SSC）接收停止选择
#define AT91C_SSC_STTDLY      ((unsigned int) 0xFF << 16) // （SSC）接收/发送开始延迟
#define AT91C_SSC_PERIOD      ((unsigned int) 0xFF << 24) // （SSC）接收/发送周期分频器选择
// --------SSC_RFMR：（SSC偏移：0x14）SSC接收帧模式寄存器--------
#define AT91C_SSC_DATLEN      ((unsigned int) 0x1F <<  0) // （SSC）数据长度
#define AT91C_SSC_LOOP        ((unsigned int) 0x1 <<  5) // （SSC）回路模式
#define AT91C_SSC_MSBF        ((unsigned int) 0x1 <<  7) // （SSC）最高有效位优先
#define AT91C_SSC_DATNB       ((unsigned int) 0xF <<  8) // （SSC）每帧数据数
#define AT91C_SSC_FSLEN       ((unsigned int) 0xF << 16) // （SSC）接收/发送帧同步长度
#define AT91C_SSC_FSOS        ((unsigned int) 0x7 << 20) // （SSC）接收/发送帧同步输出选择
#define 	AT91C_SSC_FSOS_NONE                 ((unsigned int) 0x0 << 20) // （SSC）所选接收/发送帧同步信号：无RK引脚输入
#define 	AT91C_SSC_FSOS_NEGATIVE             ((unsigned int) 0x1 << 20) // （SSC）所选接收/发送帧同步信号：负脉冲
#define 	AT91C_SSC_FSOS_POSITIVE             ((unsigned int) 0x2 << 20) // （SSC）所选接收/发送帧同步信号：正脉冲
#define 	AT91C_SSC_FSOS_LOW                  ((unsigned int) 0x3 << 20) // （SSC）所选接收/发送帧同步信号：数据传输期间驱动器低
#define 	AT91C_SSC_FSOS_HIGH                 ((unsigned int) 0x4 << 20) // （SSC）所选接收/发送帧同步信号：数据传输期间驱动器高
#define 	AT91C_SSC_FSOS_TOGGLE               ((unsigned int) 0x5 << 20) // （SSC）所选接收/发送帧同步信号：在每次数据传输开始时切换
#define AT91C_SSC_FSEDGE      ((unsigned int) 0x1 << 24) // （SSC）帧同步边缘检测
// --------SSC_TCMR：（SSC偏移：0x18）SSC传输时钟模式寄存器--------
// --------SSC_TFMR：（SSC偏移：0x1c）SSC传输帧模式寄存器--------
#define AT91C_SSC_DATDEF      ((unsigned int) 0x1 <<  5) // （SSC）数据默认值
#define AT91C_SSC_FSDEN       ((unsigned int) 0x1 << 23) // （SSC）帧同步数据启用
// --------SSC_SR：（SSC偏移量：0x40）SSC状态寄存器--------
#define AT91C_SSC_TXRDY       ((unsigned int) 0x1 <<  0) // （SSC）传输就绪
#define AT91C_SSC_TXEMPTY     ((unsigned int) 0x1 <<  1) // （SSC）传输空
#define AT91C_SSC_ENDTX       ((unsigned int) 0x1 <<  2) // （SSC）传输结束
#define AT91C_SSC_TXBUFE      ((unsigned int) 0x1 <<  3) // （SSC）传输缓冲区清空
#define AT91C_SSC_RXRDY       ((unsigned int) 0x1 <<  4) // （SSC）接收就绪
#define AT91C_SSC_OVRUN       ((unsigned int) 0x1 <<  5) // （SSC）接收超限
#define AT91C_SSC_ENDRX       ((unsigned int) 0x1 <<  6) // （SSC）接收结束
#define AT91C_SSC_RXBUFF      ((unsigned int) 0x1 <<  7) // （SSC）接收缓冲区已满
#define AT91C_SSC_CP0         ((unsigned int) 0x1 <<  8) // （SSC）比较0
#define AT91C_SSC_CP1         ((unsigned int) 0x1 <<  9) // （SSC）比较1
#define AT91C_SSC_TXSYN       ((unsigned int) 0x1 << 10) // （SSC）传输同步
#define AT91C_SSC_RXSYN       ((unsigned int) 0x1 << 11) // （SSC）接收同步
#define AT91C_SSC_TXENA       ((unsigned int) 0x1 << 16) // （SSC）传输启用
#define AT91C_SSC_RXENA       ((unsigned int) 0x1 << 17) // （SSC）接收启用
// --------SSC_IER:（SSC偏移：0x44）SSC中断启用寄存器--------
// --------SSC_IDR：（SSC偏移：0x48）SSC中断禁用寄存器--------
// --------SSC_IMR：（SSC偏移：0x4c）SSC中断掩码寄存器--------

// *****************************************************************************
//              双线接口的软件API定义
// *****************************************************************************
typedef struct _AT91S_TWI {
	AT91_REG	 TWI_CR; 	// 控制寄存器
	AT91_REG	 TWI_MMR; 	// 主模式寄存器
	AT91_REG	 Reserved0[1]; 	// 
	AT91_REG	 TWI_IADR; 	// 内部地址寄存器
	AT91_REG	 TWI_CWGR; 	// 时钟波形发生器寄存器
	AT91_REG	 Reserved1[3]; 	// 
	AT91_REG	 TWI_SR; 	// 状态寄存器
	AT91_REG	 TWI_IER; 	// 中断启用寄存器
	AT91_REG	 TWI_IDR; 	// 中断禁用寄存器
	AT91_REG	 TWI_IMR; 	// 中断掩码寄存器
	AT91_REG	 TWI_RHR; 	// 接收保持寄存器
	AT91_REG	 TWI_THR; 	// 发送保持寄存器
} AT91S_TWI, *AT91PS_TWI;

// --------TWI_CR:（TWI偏移：0x0）TWI控制寄存器--------
#define AT91C_TWI_START       ((unsigned int) 0x1 <<  0) // （TWI）发送启动条件
#define AT91C_TWI_STOP        ((unsigned int) 0x1 <<  1) // （TWI）发送STOP条件
#define AT91C_TWI_MSEN        ((unsigned int) 0x1 <<  2) // （TWI）TWI主传输已启用
#define AT91C_TWI_MSDIS       ((unsigned int) 0x1 <<  3) // （TWI）TWI主传输已禁用
#define AT91C_TWI_SWRST       ((unsigned int) 0x1 <<  7) // （TWI）软件重置
// --------TWI_MMR：（TWI偏移：0x4）TWI主模式寄存器--------
#define AT91C_TWI_IADRSZ      ((unsigned int) 0x3 <<  8) // （TWI）内部设备地址大小
#define 	AT91C_TWI_IADRSZ_NO                   ((unsigned int) 0x0 <<  8) // （TWI）无内部设备地址
#define 	AT91C_TWI_IADRSZ_1_BYTE               ((unsigned int) 0x1 <<  8) // （TWI）一字节内部设备地址
#define 	AT91C_TWI_IADRSZ_2_BYTE               ((unsigned int) 0x2 <<  8) // （TWI）双字节内部设备地址
#define 	AT91C_TWI_IADRSZ_3_BYTE               ((unsigned int) 0x3 <<  8) // （TWI）三字节内部设备地址
#define AT91C_TWI_MREAD       ((unsigned int) 0x1 << 12) // （TWI）主读取方向
#define AT91C_TWI_DADR        ((unsigned int) 0x7F << 16) // （TWI）设备地址
// --------TWI_CWGR:（TWI偏移：0x10）TWI时钟波形发生器寄存器--------
#define AT91C_TWI_CLDIV       ((unsigned int) 0xFF <<  0) // （TWI）时钟低分频器
#define AT91C_TWI_CHDIV       ((unsigned int) 0xFF <<  8) // （TWI）时钟高分频器
#define AT91C_TWI_CKDIV       ((unsigned int) 0x7 << 16) // （TWI）时钟分频器
// --------TWI_SR:（TWI偏移：0x20）TWI状态寄存器--------
#define AT91C_TWI_TXCOMP      ((unsigned int) 0x1 <<  0) // （TWI）传输完成
#define AT91C_TWI_RXRDY       ((unsigned int) 0x1 <<  1) // （TWI）接收保持寄存器ReaDY
#define AT91C_TWI_TXRDY       ((unsigned int) 0x1 <<  2) // （TWI）发送保持寄存器ReaDY
#define AT91C_TWI_OVRE        ((unsigned int) 0x1 <<  6) // （TWI）超限错误
#define AT91C_TWI_UNRE        ((unsigned int) 0x1 <<  7) // （TWI）欠载错误
#define AT91C_TWI_NACK        ((unsigned int) 0x1 <<  8) // （TWI）未确认
// --------TWI_IER：（TWI偏移：0x24）TWI中断启用寄存器--------
// --------TWI_IDR:（TWI偏移：0x28）TWI中断禁用寄存器--------
// --------TWI_IR:（TWI偏移：0x2c）TWI中断掩码寄存器--------

// *****************************************************************************
//              PWMC通道接口的软件API定义
// *****************************************************************************
typedef struct _AT91S_PWMC_CH {
	AT91_REG	 PWMC_CMR; 	// 信道模式寄存器
	AT91_REG	 PWMC_CDTYR; 	// 通道占空比寄存器
	AT91_REG	 PWMC_CPRDR; 	// 信道周期寄存器
	AT91_REG	 PWMC_CCNTR; 	// 信道计数器寄存器
	AT91_REG	 PWMC_CUPDR; 	// 信道更新寄存器
	AT91_REG	 PWMC_Reserved[3]; 	// 保留
} AT91S_PWMC_CH, *AT91PS_PWMC_CH;

// --------PWMC_CMR：（PWMC_CH偏移：0x0）PWMC信道模式寄存器--------
#define AT91C_PWMC_CPRE       ((unsigned int) 0xF <<  0) // （PWMC_CH）信道预缩放器：PWMC_CLKx
#define 	AT91C_PWMC_CPRE_MCK                  ((unsigned int) 0x0) // (PWMC_CH) 
#define 	AT91C_PWMC_CPRE_MCKA                 ((unsigned int) 0xB) // (PWMC_CH) 
#define 	AT91C_PWMC_CPRE_MCKB                 ((unsigned int) 0xC) // (PWMC_CH) 
#define AT91C_PWMC_CALG       ((unsigned int) 0x1 <<  8) // （PWMC_CH）通道对齐
#define AT91C_PWMC_CPOL       ((unsigned int) 0x1 <<  9) // （PWMC_CH）通道极性
#define AT91C_PWMC_CPD        ((unsigned int) 0x1 << 10) // （PWMC_CH）信道更新周期
// --------PWMC_CDTYR：（PWMC_CH偏移：0x4）PWMC通道占空比寄存器--------
#define AT91C_PWMC_CDTY       ((unsigned int) 0x0 <<  0) // （PWMC_CH）通道占空比
// --------PWMC_CPRDR:（PWMC_CH偏移：0x8）PWMC信道周期寄存器--------
#define AT91C_PWMC_CPRD       ((unsigned int) 0x0 <<  0) // （PWMC_CH）信道周期
// --------PWMC_CCNTR：（PWMC_CH偏移：0xc）PWMC信道计数器寄存器--------
#define AT91C_PWMC_CCNT       ((unsigned int) 0x0 <<  0) // （PWMC_CH）信道计数器
// --------PWMC_CUPDR:（PWMC_CH偏移：0x10）PWMC信道更新寄存器--------
#define AT91C_PWMC_CUPD       ((unsigned int) 0x0 <<  0) // （PWMC_CH）信道更新

// *****************************************************************************
//              脉宽调制控制器接口的软件API定义
// *****************************************************************************
typedef struct _AT91S_PWMC {
	AT91_REG	 PWMC_MR; 	// PWMC模式寄存器
	AT91_REG	 PWMC_ENA; 	// PWMC启用寄存器
	AT91_REG	 PWMC_DIS; 	// PWMC禁用寄存器
	AT91_REG	 PWMC_SR; 	// PWMC状态寄存器
	AT91_REG	 PWMC_IER; 	// PWMC中断启用寄存器
	AT91_REG	 PWMC_IDR; 	// PWMC中断禁用寄存器
	AT91_REG	 PWMC_IMR; 	// PWMC中断掩码寄存器
	AT91_REG	 PWMC_ISR; 	// PWMC中断状态寄存器
	AT91_REG	 Reserved0[55]; 	// 
	AT91_REG	 PWMC_VR; 	// PWMC版本寄存器
	AT91_REG	 Reserved1[64]; 	// 
	AT91S_PWMC_CH	 PWMC_CH[4]; 	// PWMC通道
} AT91S_PWMC, *AT91PS_PWMC;

// --------PWMC_MR：（PWMC偏移：0x0）PWMC模式寄存器--------
#define AT91C_PWMC_DIVA       ((unsigned int) 0xFF <<  0) // （PWMC）CLKA除法因子。
#define AT91C_PWMC_PREA       ((unsigned int) 0xF <<  8) // （PWMC）分频器输入时钟预分频器A
#define 	AT91C_PWMC_PREA_MCK                  ((unsigned int) 0x0 <<  8) // (PWMC) 
#define AT91C_PWMC_DIVB       ((unsigned int) 0xFF << 16) // （PWMC）CLKB除法因子。
#define AT91C_PWMC_PREB       ((unsigned int) 0xF << 24) // （PWMC）分频器输入时钟预分频器B
#define 	AT91C_PWMC_PREB_MCK                  ((unsigned int) 0x0 << 24) // (PWMC) 
// --------PWMC_ENA:（PWMC偏移：0x4）PWMC启用寄存器--------
#define AT91C_PWMC_CHID0      ((unsigned int) 0x1 <<  0) // （PWMC）信道ID 0
#define AT91C_PWMC_CHID1      ((unsigned int) 0x1 <<  1) // （PWMC）通道ID 1
#define AT91C_PWMC_CHID2      ((unsigned int) 0x1 <<  2) // （PWMC）信道ID 2
#define AT91C_PWMC_CHID3      ((unsigned int) 0x1 <<  3) // （PWMC）信道ID 3
// --------PWMC_DIS：（PWMC偏移：0x8）PWMC禁用寄存器--------
// --------PWMC_SR：（PWMC偏移：0xc）PWMC状态寄存器--------
// --------PWMC_IER:（PWMC偏移：0x10）PWMC中断启用寄存器--------
// --------PWMC_IDR:（PWMC偏移：0x14）PWMC中断禁用寄存器--------
// --------PWMC_IMR：（PWMC偏移：0x18）PWMC中断掩码寄存器--------
// --------PWMC_ISR:（PWMC偏移：0x1c）PWMC中断状态寄存器--------

// *****************************************************************************
//              USB设备接口的软件API定义
// *****************************************************************************
typedef struct _AT91S_UDP {
	AT91_REG	 UDP_NUM; 	// 帧号寄存器
	AT91_REG	 UDP_GLBSTATE; 	// 全局状态寄存器
	AT91_REG	 UDP_FADDR; 	// 功能地址寄存器
	AT91_REG	 Reserved0[1]; 	// 
	AT91_REG	 UDP_IER; 	// 中断启用寄存器
	AT91_REG	 UDP_IDR; 	// 中断禁用寄存器
	AT91_REG	 UDP_IMR; 	// 中断掩码寄存器
	AT91_REG	 UDP_ISR; 	// 中断状态寄存器
	AT91_REG	 UDP_ICR; 	// 中断清除寄存器
	AT91_REG	 Reserved1[1]; 	// 
	AT91_REG	 UDP_RSTEP; 	// 重置终结点寄存器
	AT91_REG	 Reserved2[1]; 	// 
	AT91_REG	 UDP_CSR[6]; 	// 端点控制和状态寄存器
	AT91_REG	 Reserved3[2]; 	// 
	AT91_REG	 UDP_FDR[6]; 	// 端点FIFO数据寄存器
	AT91_REG	 Reserved4[3]; 	// 
	AT91_REG	 UDP_TXVC; 	// 收发器控制寄存器
} AT91S_UDP, *AT91PS_UDP;

// --------UDP_FRM_NUM：（UDP偏移：0x0）USB帧号寄存器--------
#define AT91C_UDP_FRM_NUM     ((unsigned int) 0x7FF <<  0) // 分组字段格式中定义的（UDP）帧号
#define AT91C_UDP_FRM_ERR     ((unsigned int) 0x1 << 16) // （UDP）帧错误
#define AT91C_UDP_FRM_OK      ((unsigned int) 0x1 << 17) // （UDP）帧正常
// --------UDP_GLB_STATE:（UDP偏移：0x4）USB全局状态寄存器--------
#define AT91C_UDP_FADDEN      ((unsigned int) 0x1 <<  0) // （UDP）功能地址启用
#define AT91C_UDP_CONFG       ((unsigned int) 0x1 <<  1) // （UDP）已配置
#define AT91C_UDP_ESR         ((unsigned int) 0x1 <<  2) // （UDP）启用发送恢复
#define AT91C_UDP_RSMINPR     ((unsigned int) 0x1 <<  3) // （UDP）已将恢复发送到主机
#define AT91C_UDP_RMWUPE      ((unsigned int) 0x1 <<  4) // （UDP）远程唤醒启用
// --------UDP_FADDR:（UDP偏移量：0x8）USB功能地址寄存器--------
#define AT91C_UDP_FADD        ((unsigned int) 0xFF <<  0) // （UDP）函数地址值
#define AT91C_UDP_FEN         ((unsigned int) 0x1 <<  8) // （UDP）功能启用
// --------UDP_IER:（UDP偏移：0x10）USB中断启用寄存器--------
#define AT91C_UDP_EPINT0      ((unsigned int) 0x1 <<  0) // （UDP）端点0中断
#define AT91C_UDP_EPINT1      ((unsigned int) 0x1 <<  1) // （UDP）端点0中断
#define AT91C_UDP_EPINT2      ((unsigned int) 0x1 <<  2) // （UDP）端点2中断
#define AT91C_UDP_EPINT3      ((unsigned int) 0x1 <<  3) // （UDP）端点3中断
#define AT91C_UDP_EPINT4      ((unsigned int) 0x1 <<  4) // （UDP）端点4中断
#define AT91C_UDP_EPINT5      ((unsigned int) 0x1 <<  5) // （UDP）端点5中断
#define AT91C_UDP_RXSUSP      ((unsigned int) 0x1 <<  8) // （UDP）USB挂起中断
#define AT91C_UDP_RXRSM       ((unsigned int) 0x1 <<  9) // （UDP）USB恢复中断
#define AT91C_UDP_EXTRSM      ((unsigned int) 0x1 << 10) // （UDP）USB外部恢复中断
#define AT91C_UDP_SOFINT      ((unsigned int) 0x1 << 11) // （UDP）USB帧开始中断
#define AT91C_UDP_WAKEUP      ((unsigned int) 0x1 << 13) // （UDP）USB恢复中断
// --------UDP_IDR：（UDP偏移：0x14）USB中断禁用寄存器--------
// --------UDP_IMR：（UDP偏移：0x18）USB中断掩码寄存器--------
// --------UDP_ISR：（UDP偏移：0x1c）USB中断状态寄存器--------
#define AT91C_UDP_ENDBUSRES   ((unsigned int) 0x1 << 12) // （UDP）USB总线端重置中断
// --------UDP_ICR：（UDP偏移：0x20）USB中断清除寄存器--------
// --------UDP_RST_EP:（UDP偏移：0x28）USB重置端点寄存器--------
#define AT91C_UDP_EP0         ((unsigned int) 0x1 <<  0) // （UDP）重置终结点0
#define AT91C_UDP_EP1         ((unsigned int) 0x1 <<  1) // （UDP）重置终结点1
#define AT91C_UDP_EP2         ((unsigned int) 0x1 <<  2) // （UDP）重置终结点2
#define AT91C_UDP_EP3         ((unsigned int) 0x1 <<  3) // （UDP）重置终结点3
#define AT91C_UDP_EP4         ((unsigned int) 0x1 <<  4) // （UDP）重置终结点4
#define AT91C_UDP_EP5         ((unsigned int) 0x1 <<  5) // （UDP）重置终结点5
// --------UDP_CSR：（UDP偏移量：0x30）USB端点控制和状态寄存器--------
#define AT91C_UDP_TXCOMP      ((unsigned int) 0x1 <<  0) // （UDP）使用以前写入DPR的数据生成IN数据包
#define AT91C_UDP_RX_DATA_BK0 ((unsigned int) 0x1 <<  1) // （UDP）接收数据库0
#define AT91C_UDP_RXSETUP     ((unsigned int) 0x1 <<  2) // （UDP）向主机（控制端点）发送STALL
#define AT91C_UDP_ISOERROR    ((unsigned int) 0x1 <<  3) // （UDP）等时错误（等时端点）
#define AT91C_UDP_TXPKTRDY    ((unsigned int) 0x1 <<  4) // （UDP）传输数据包就绪
#define AT91C_UDP_FORCESTALL  ((unsigned int) 0x1 <<  5) // （UDP）强制暂停（由Control、Bulk和Isochronous端点使用）。
#define AT91C_UDP_RX_DATA_BK1 ((unsigned int) 0x1 <<  6) // （UDP）接收数据库1（仅由具有乒乓属性的端点使用）。
#define AT91C_UDP_DIR         ((unsigned int) 0x1 <<  7) // （UDP）传输方向
#define AT91C_UDP_EPTYPE      ((unsigned int) 0x7 <<  8) // （UDP）终结点类型
#define 	AT91C_UDP_EPTYPE_CTRL                 ((unsigned int) 0x0 <<  8) // （UDP）控制
#define 	AT91C_UDP_EPTYPE_ISO_OUT              ((unsigned int) 0x1 <<  8) // （UDP）等时输出
#define 	AT91C_UDP_EPTYPE_BULK_OUT             ((unsigned int) 0x2 <<  8) // （UDP）批量输出
#define 	AT91C_UDP_EPTYPE_INT_OUT              ((unsigned int) 0x3 <<  8) // （UDP）中断OUT
#define 	AT91C_UDP_EPTYPE_ISO_IN               ((unsigned int) 0x5 <<  8) // （UDP）同步输入
#define 	AT91C_UDP_EPTYPE_BULK_IN              ((unsigned int) 0x6 <<  8) // （UDP）批量输入
#define 	AT91C_UDP_EPTYPE_INT_IN               ((unsigned int) 0x7 <<  8) // （UDP）中断IN
#define AT91C_UDP_DTGLE       ((unsigned int) 0x1 << 11) // （UDP）数据切换
#define AT91C_UDP_EPEDS       ((unsigned int) 0x1 << 15) // （UDP）端点启用禁用
#define AT91C_UDP_RXBYTECNT   ((unsigned int) 0x7FF << 16) // （UDP）FIFO中可用的字节数
// --------UDP_TXVC:（UDP偏移：0x74）收发器控制寄存器--------
#define AT91C_UDP_TXVDIS      ((unsigned int) 0x1 <<  8) // (UDP) 
#define AT91C_UDP_PUON        ((unsigned int) 0x1 <<  9) // （UDP）上拉打开

// *****************************************************************************
//              定时器计数器通道接口的软件API定义
// *****************************************************************************
typedef struct _AT91S_TC {
	AT91_REG	 TC_CCR; 	// 信道控制寄存器
	AT91_REG	 TC_CMR; 	// 信道模式寄存器（捕获模式/波形模式）
	AT91_REG	 Reserved0[2]; 	// 
	AT91_REG	 TC_CV; 	// 计数器值
	AT91_REG	 TC_RA; 	// 寄存器A
	AT91_REG	 TC_RB; 	// 寄存器B
	AT91_REG	 TC_RC; 	// 寄存器C
	AT91_REG	 TC_SR; 	// 状态寄存器
	AT91_REG	 TC_IER; 	// 中断启用寄存器
	AT91_REG	 TC_IDR; 	// 中断禁用寄存器
	AT91_REG	 TC_IMR; 	// 中断掩码寄存器
} AT91S_TC, *AT91PS_TC;

