DYXX-X/Library_zh/ESP32_API_zh/cmock/CMock/test/iar/iar_v4/incIAR/ioat91sam7x256.h
// --------TC_CCR：（TC偏移：0x0）TC信道控制寄存器--------
#define AT91C_TC_CLKEN        ((unsigned int) 0x1 <<  0) // （TC）计数器时钟启用命令
#define AT91C_TC_CLKDIS       ((unsigned int) 0x1 <<  1) // （TC）计数器时钟禁用命令
#define AT91C_TC_SWTRG        ((unsigned int) 0x1 <<  2) // （TC）软件触发命令
// --------TC_CMR：（TC偏移：0x4）TC信道模式寄存器：捕获模式/波形模式--------
#define AT91C_TC_CLKS         ((unsigned int) 0x7 <<  0) // （TC）时钟选择
#define 	AT91C_TC_CLKS_TIMER_DIV1_CLOCK     ((unsigned int) 0x0) // （TC）选择的时钟：TIMER_DIV1_Clock
#define 	AT91C_TC_CLKS_TIMER_DIV2_CLOCK     ((unsigned int) 0x1) // （TC）选择的时钟：TIMER_DIV2_Clock
#define 	AT91C_TC_CLKS_TIMER_DIV3_CLOCK     ((unsigned int) 0x2) // （TC）选择的时钟：TIMER_DIV3_Clock
#define 	AT91C_TC_CLKS_TIMER_DIV4_CLOCK     ((unsigned int) 0x3) // （TC）选择的时钟：TIMER_DIV4_Clock
#define 	AT91C_TC_CLKS_TIMER_DIV5_CLOCK     ((unsigned int) 0x4) // （TC）选择的时钟：TIMER_DIV5_Clock
#define 	AT91C_TC_CLKS_XC0                  ((unsigned int) 0x5) // （TC）选择的时钟：XC0
#define 	AT91C_TC_CLKS_XC1                  ((unsigned int) 0x6) // （TC）选择的时钟：XC1
#define 	AT91C_TC_CLKS_XC2                  ((unsigned int) 0x7) // （TC）选择的时钟：XC2
#define AT91C_TC_CLKI         ((unsigned int) 0x1 <<  3) // （TC）时钟反转
#define AT91C_TC_BURST        ((unsigned int) 0x3 <<  4) // （TC）突发信号选择
#define 	AT91C_TC_BURST_NONE                 ((unsigned int) 0x0 <<  4) // （TC）时钟不受外部信号门控
#define 	AT91C_TC_BURST_XC0                  ((unsigned int) 0x1 <<  4) // （TC）XC0与所选时钟“与”
#define 	AT91C_TC_BURST_XC1                  ((unsigned int) 0x2 <<  4) // （TC）XC1与所选时钟“与”
#define 	AT91C_TC_BURST_XC2                  ((unsigned int) 0x3 <<  4) // （TC）XC2与所选时钟“与”
#define AT91C_TC_CPCSTOP      ((unsigned int) 0x1 <<  6) // （TC）计数器时钟停止，RC比较
#define AT91C_TC_LDBSTOP      ((unsigned int) 0x1 <<  6) // （TC）计数器时钟因RB加载而停止
#define AT91C_TC_CPCDIS       ((unsigned int) 0x1 <<  7) // 使用RC比较禁用（TC）计数器时钟
#define AT91C_TC_LDBDIS       ((unsigned int) 0x1 <<  7) // （TC）计数器时钟禁用，RB加载
#define AT91C_TC_ETRGEDG      ((unsigned int) 0x3 <<  8) // （TC）外部触发边缘选择
#define 	AT91C_TC_ETRGEDG_NONE                 ((unsigned int) 0x0 <<  8) // （TC）边缘：无
#define 	AT91C_TC_ETRGEDG_RISING               ((unsigned int) 0x1 <<  8) // （TC）边缘：上升边缘
#define 	AT91C_TC_ETRGEDG_FALLING              ((unsigned int) 0x2 <<  8) // （TC）边缘：下降边缘
#define 	AT91C_TC_ETRGEDG_BOTH                 ((unsigned int) 0x3 <<  8) // （TC）边缘：每个边缘
#define AT91C_TC_EEVTEDG      ((unsigned int) 0x3 <<  8) // （TC）外部事件边缘选择
#define 	AT91C_TC_EEVTEDG_NONE                 ((unsigned int) 0x0 <<  8) // （TC）边缘：无
#define 	AT91C_TC_EEVTEDG_RISING               ((unsigned int) 0x1 <<  8) // （TC）边缘：上升边缘
#define 	AT91C_TC_EEVTEDG_FALLING              ((unsigned int) 0x2 <<  8) // （TC）边缘：下降边缘
#define 	AT91C_TC_EEVTEDG_BOTH                 ((unsigned int) 0x3 <<  8) // （TC）边缘：每个边缘
#define AT91C_TC_EEVT         ((unsigned int) 0x3 << 10) // （TC）外部事件选择
#define 	AT91C_TC_EEVT_TIOB                 ((unsigned int) 0x0 << 10) // （TC）选择为外部事件的信号：TIOB TIOB方向：输入
#define 	AT91C_TC_EEVT_XC0                  ((unsigned int) 0x1 << 10) // （TC）选择为外部事件的信号：XC0 TIOB方向：输出
#define 	AT91C_TC_EEVT_XC1                  ((unsigned int) 0x2 << 10) // （TC）选择为外部事件的信号：XC1 TIOB方向：输出
#define 	AT91C_TC_EEVT_XC2                  ((unsigned int) 0x3 << 10) // （TC）选择为外部事件的信号：XC2 TIOB方向：输出
#define AT91C_TC_ABETRG       ((unsigned int) 0x1 << 10) // （TC）TIOA或TIOB外部触发选择
#define AT91C_TC_ENETRG       ((unsigned int) 0x1 << 12) // （TC）外部事件触发器启用
#define AT91C_TC_WAVESEL      ((unsigned int) 0x3 << 13) // （TC）波形选择
#define 	AT91C_TC_WAVESEL_UP                   ((unsigned int) 0x0 << 13) // RC比较上无自动触发的（TC）UP模式
#define 	AT91C_TC_WAVESEL_UPDOWN               ((unsigned int) 0x1 << 13) // （TC）UPDOWN模式，无RC比较自动触发
#define 	AT91C_TC_WAVESEL_UP_AUTO              ((unsigned int) 0x2 << 13) // RC比较自动触发的（TC）UP模式
#define 	AT91C_TC_WAVESEL_UPDOWN_AUTO          ((unsigned int) 0x3 << 13) // （TC）UPDOWN模式，RC比较时自动触发
#define AT91C_TC_CPCTRG       ((unsigned int) 0x1 << 14) // （TC）RC比较触发启用
#define AT91C_TC_WAVE         ((unsigned int) 0x1 << 15) // (TC) 
#define AT91C_TC_ACPA         ((unsigned int) 0x3 << 16) // （TC）RA比较对TIOA的影响
#define 	AT91C_TC_ACPA_NONE                 ((unsigned int) 0x0 << 16) // （TC）影响：无
#define 	AT91C_TC_ACPA_SET                  ((unsigned int) 0x1 << 16) // （TC）效果：设置
#define 	AT91C_TC_ACPA_CLEAR                ((unsigned int) 0x2 << 16) // （TC）效果：清晰
#define 	AT91C_TC_ACPA_TOGGLE               ((unsigned int) 0x3 << 16) // （TC）效果：切换
#define AT91C_TC_LDRA         ((unsigned int) 0x3 << 16) // （TC）RA加载选择
#define 	AT91C_TC_LDRA_NONE                 ((unsigned int) 0x0 << 16) // （TC）边缘：无
#define 	AT91C_TC_LDRA_RISING               ((unsigned int) 0x1 << 16) // （TC）边缘：TIOA的上升边缘
#define 	AT91C_TC_LDRA_FALLING              ((unsigned int) 0x2 << 16) // （TC）边缘：TIOA的下降边缘
#define 	AT91C_TC_LDRA_BOTH                 ((unsigned int) 0x3 << 16) // （TC）边缘：TIOA的每个边缘
#define AT91C_TC_ACPC         ((unsigned int) 0x3 << 18) // （TC）RC比较对TIOA的影响
#define 	AT91C_TC_ACPC_NONE                 ((unsigned int) 0x0 << 18) // （TC）影响：无
#define 	AT91C_TC_ACPC_SET                  ((unsigned int) 0x1 << 18) // （TC）效果：设置
#define 	AT91C_TC_ACPC_CLEAR                ((unsigned int) 0x2 << 18) // （TC）效果：清晰
#define 	AT91C_TC_ACPC_TOGGLE               ((unsigned int) 0x3 << 18) // （TC）效果：切换
#define AT91C_TC_LDRB         ((unsigned int) 0x3 << 18) // （TC）RB加载选择
#define 	AT91C_TC_LDRB_NONE                 ((unsigned int) 0x0 << 18) // （TC）边缘：无
#define 	AT91C_TC_LDRB_RISING               ((unsigned int) 0x1 << 18) // （TC）边缘：TIOA的上升边缘
#define 	AT91C_TC_LDRB_FALLING              ((unsigned int) 0x2 << 18) // （TC）边缘：TIOA的下降边缘
#define 	AT91C_TC_LDRB_BOTH                 ((unsigned int) 0x3 << 18) // （TC）边缘：TIOA的每个边缘
#define AT91C_TC_AEEVT        ((unsigned int) 0x3 << 20) // （TC）外部事件对TIOA的影响
#define 	AT91C_TC_AEEVT_NONE                 ((unsigned int) 0x0 << 20) // （TC）影响：无
#define 	AT91C_TC_AEEVT_SET                  ((unsigned int) 0x1 << 20) // （TC）效果：设置
#define 	AT91C_TC_AEEVT_CLEAR                ((unsigned int) 0x2 << 20) // （TC）效果：清晰
#define 	AT91C_TC_AEEVT_TOGGLE               ((unsigned int) 0x3 << 20) // （TC）效果：切换
#define AT91C_TC_ASWTRG       ((unsigned int) 0x3 << 22) // （TC）软件触发对TIOA的影响
#define 	AT91C_TC_ASWTRG_NONE                 ((unsigned int) 0x0 << 22) // （TC）影响：无
#define 	AT91C_TC_ASWTRG_SET                  ((unsigned int) 0x1 << 22) // （TC）效果：设置
#define 	AT91C_TC_ASWTRG_CLEAR                ((unsigned int) 0x2 << 22) // （TC）效果：清晰
#define 	AT91C_TC_ASWTRG_TOGGLE               ((unsigned int) 0x3 << 22) // （TC）效果：切换
#define AT91C_TC_BCPB         ((unsigned int) 0x3 << 24) // （TC）RB比较对TIOB的影响
#define 	AT91C_TC_BCPB_NONE                 ((unsigned int) 0x0 << 24) // （TC）影响：无
#define 	AT91C_TC_BCPB_SET                  ((unsigned int) 0x1 << 24) // （TC）效果：设置
#define 	AT91C_TC_BCPB_CLEAR                ((unsigned int) 0x2 << 24) // （TC）效果：清晰
#define 	AT91C_TC_BCPB_TOGGLE               ((unsigned int) 0x3 << 24) // （TC）效果：切换
#define AT91C_TC_BCPC         ((unsigned int) 0x3 << 26) // （TC）RC比较对TIOB的影响
#define 	AT91C_TC_BCPC_NONE                 ((unsigned int) 0x0 << 26) // （TC）影响：无
#define 	AT91C_TC_BCPC_SET                  ((unsigned int) 0x1 << 26) // （TC）效果：设置
#define 	AT91C_TC_BCPC_CLEAR                ((unsigned int) 0x2 << 26) // （TC）效果：清晰
#define 	AT91C_TC_BCPC_TOGGLE               ((unsigned int) 0x3 << 26) // （TC）效果：切换
#define AT91C_TC_BEEVT        ((unsigned int) 0x3 << 28) // （TC）外部事件对TIOB的影响
#define 	AT91C_TC_BEEVT_NONE                 ((unsigned int) 0x0 << 28) // （TC）影响：无
#define 	AT91C_TC_BEEVT_SET                  ((unsigned int) 0x1 << 28) // （TC）效果：设置
#define 	AT91C_TC_BEEVT_CLEAR                ((unsigned int) 0x2 << 28) // （TC）效果：清晰
#define 	AT91C_TC_BEEVT_TOGGLE               ((unsigned int) 0x3 << 28) // （TC）效果：切换
#define AT91C_TC_BSWTRG       ((unsigned int) 0x3 << 30) // （TC）软件触发对TIOB的影响
#define 	AT91C_TC_BSWTRG_NONE                 ((unsigned int) 0x0 << 30) // （TC）影响：无
#define 	AT91C_TC_BSWTRG_SET                  ((unsigned int) 0x1 << 30) // （TC）效果：设置
#define 	AT91C_TC_BSWTRG_CLEAR                ((unsigned int) 0x2 << 30) // （TC）效果：清晰
#define 	AT91C_TC_BSWTRG_TOGGLE               ((unsigned int) 0x3 << 30) // （TC）效果：切换
// --------TC_SR：（TC偏移：0x20）TC信道状态寄存器--------
#define AT91C_TC_COVFS        ((unsigned int) 0x1 <<  0) // （TC）计数器溢出
#define AT91C_TC_LOVRS        ((unsigned int) 0x1 <<  1) // （TC）负载超限
#define AT91C_TC_CPAS         ((unsigned int) 0x1 <<  2) // （TC）RA比较
#define AT91C_TC_CPBS         ((unsigned int) 0x1 <<  3) // （TC）RB比较
#define AT91C_TC_CPCS         ((unsigned int) 0x1 <<  4) // （TC）RC比较
#define AT91C_TC_LDRAS        ((unsigned int) 0x1 <<  5) // （TC）RA加载
#define AT91C_TC_LDRBS        ((unsigned int) 0x1 <<  6) // （TC）RB加载
#define AT91C_TC_ETRGS        ((unsigned int) 0x1 <<  7) // （TC）外部触发器
#define AT91C_TC_CLKSTA       ((unsigned int) 0x1 << 16) // （TC）时钟启用
#define AT91C_TC_MTIOA        ((unsigned int) 0x1 << 17) // （TC）TIOA后视镜
#define AT91C_TC_MTIOB        ((unsigned int) 0x1 << 18) // （TC）TIOA后视镜
// --------TC_IER：（TC偏移：0x24）TC通道中断启用寄存器--------
// --------TC_IDR：（TC偏移：0x28）TC通道中断禁用寄存器--------
// --------TC_IMR：（TC偏移：0x2c）TC通道中断掩码寄存器--------

// *****************************************************************************
//              定时器计数器接口的软件API定义
// *****************************************************************************
typedef struct _AT91S_TCB {
	AT91S_TC	 TCB_TC0; 	// TC通道0
	AT91_REG	 Reserved0[4]; 	// 
	AT91S_TC	 TCB_TC1; 	// TC通道1
	AT91_REG	 Reserved1[4]; 	// 
	AT91S_TC	 TCB_TC2; 	// TC通道2
	AT91_REG	 Reserved2[4]; 	// 
	AT91_REG	 TCB_BCR; 	// TC块控制寄存器
	AT91_REG	 TCB_BMR; 	// TC块模式寄存器
} AT91S_TCB, *AT91PS_TCB;

// --------TCB_BCR：（TCB偏移量：0xc0）TC块控制寄存器--------
#define AT91C_TCB_SYNC        ((unsigned int) 0x1 <<  0) // （TCB）同步命令
// --------TCB_BMR：（TCB偏移量：0xc4）TC块模式寄存器--------
#define AT91C_TCB_TC0XC0S     ((unsigned int) 0x3 <<  0) // （TCB）外部时钟信号0选择
#define 	AT91C_TCB_TC0XC0S_TCLK0                ((unsigned int) 0x0) // （TCB）TCLK0连接到XC0
#define 	AT91C_TCB_TC0XC0S_NONE                 ((unsigned int) 0x1) // （TCB）无信号连接到XC0
#define 	AT91C_TCB_TC0XC0S_TIOA1                ((unsigned int) 0x2) // （TCB）TIOA1连接到XC0
#define 	AT91C_TCB_TC0XC0S_TIOA2                ((unsigned int) 0x3) // （TCB）TIOA2连接到XC0
#define AT91C_TCB_TC1XC1S     ((unsigned int) 0x3 <<  2) // （TCB）外部时钟信号1选择
#define 	AT91C_TCB_TC1XC1S_TCLK1                ((unsigned int) 0x0 <<  2) // （TCB）TCLK1连接到XC1
#define 	AT91C_TCB_TC1XC1S_NONE                 ((unsigned int) 0x1 <<  2) // （TCB）无信号连接到XC1
#define 	AT91C_TCB_TC1XC1S_TIOA0                ((unsigned int) 0x2 <<  2) // （TCB）TIOA0连接到XC1
#define 	AT91C_TCB_TC1XC1S_TIOA2                ((unsigned int) 0x3 <<  2) // （TCB）TIOA2连接到XC1
#define AT91C_TCB_TC2XC2S     ((unsigned int) 0x3 <<  4) // （TCB）外部时钟信号2选择
#define 	AT91C_TCB_TC2XC2S_TCLK2                ((unsigned int) 0x0 <<  4) // （TCB）TCLK2连接到XC2
#define 	AT91C_TCB_TC2XC2S_NONE                 ((unsigned int) 0x1 <<  4) // （TCB）无信号连接到XC2
#define 	AT91C_TCB_TC2XC2S_TIOA0                ((unsigned int) 0x2 <<  4) // （TCB）TIOA0连接到XC2
#define 	AT91C_TCB_TC2XC2S_TIOA1                ((unsigned int) 0x3 <<  4) // （TCB）TIOA2连接到XC2

// *****************************************************************************
//              控制区域网络邮箱接口的软件API定义
// *****************************************************************************
typedef struct _AT91S_CAN_MB {
	AT91_REG	 CAN_MB_MMR; 	// 邮箱模式寄存器
	AT91_REG	 CAN_MB_MAM; 	// 邮箱接受掩码寄存器
	AT91_REG	 CAN_MB_MID; 	// 邮箱ID注册
	AT91_REG	 CAN_MB_MFID; 	// 邮箱系列ID注册
	AT91_REG	 CAN_MB_MSR; 	// 邮箱状态寄存器
	AT91_REG	 CAN_MB_MDL; 	// MailBox数据低寄存器
	AT91_REG	 CAN_MB_MDH; 	// 邮箱数据高位寄存器
	AT91_REG	 CAN_MB_MCR; 	// 邮箱控制寄存器
} AT91S_CAN_MB, *AT91PS_CAN_MB;

