DYXX-X/Library_zh/ESP32_API_zh/cmock/CMock/test/iar/iar_v4/incIAR/ioat91sam7x256.h
// --------CAN_MMR：（CAN_MB偏移：0x0）CAN消息模式寄存器--------
#define AT91C_CAN_MTIMEMARK   ((unsigned int) 0xFFFF <<  0) // （CAN_MB）邮箱时间标记
#define AT91C_CAN_PRIOR       ((unsigned int) 0xF << 16) // （CAN_MB）邮箱优先级
#define AT91C_CAN_MOT         ((unsigned int) 0x7 << 24) // （CAN_MB）邮箱对象类型
#define 	AT91C_CAN_MOT_DIS                  ((unsigned int) 0x0 << 24) // (CAN_MB) 
#define 	AT91C_CAN_MOT_RX                   ((unsigned int) 0x1 << 24) // (CAN_MB) 
#define 	AT91C_CAN_MOT_RXOVERWRITE          ((unsigned int) 0x2 << 24) // (CAN_MB) 
#define 	AT91C_CAN_MOT_TX                   ((unsigned int) 0x3 << 24) // (CAN_MB) 
#define 	AT91C_CAN_MOT_CONSUMER             ((unsigned int) 0x4 << 24) // (CAN_MB) 
#define 	AT91C_CAN_MOT_PRODUCER             ((unsigned int) 0x5 << 24) // (CAN_MB) 
// --------CAN_MAM：（CAN_MB偏移：0x4）CAN消息接受掩码寄存器--------
#define AT91C_CAN_MIDvB       ((unsigned int) 0x3FFFF <<  0) // （CAN_MB）扩展模式中标识符的互补位
#define AT91C_CAN_MIDvA       ((unsigned int) 0x7FF << 18) // （CAN_MB）标准帧模式标识符
#define AT91C_CAN_MIDE        ((unsigned int) 0x1 << 29) // （CAN_MB）标识符版本
// --------CAN_MID:（CAN_MB偏移：0x8）CAN消息ID寄存器--------
// --------CAN_MFID：（CAN_MB偏移：0xc）CAN消息系列ID寄存器--------
// --------CAN_MSR:（CAN_MB偏移：0x10）CAN消息状态寄存器--------
#define AT91C_CAN_MTIMESTAMP  ((unsigned int) 0xFFFF <<  0) // （CAN_MB）计时器值
#define AT91C_CAN_MDLC        ((unsigned int) 0xF << 16) // （CAN_MB）邮箱数据长度代码
#define AT91C_CAN_MRTR        ((unsigned int) 0x1 << 20) // （CAN_MB）邮箱远程传输请求
#define AT91C_CAN_MABT        ((unsigned int) 0x1 << 22) // （CAN_MB）邮箱消息中止
#define AT91C_CAN_MRDY        ((unsigned int) 0x1 << 23) // （CAN_MB）邮箱就绪
#define AT91C_CAN_MMI         ((unsigned int) 0x1 << 24) // （CAN_MB）邮箱消息已忽略
// --------CAN_MDL:（CAN_MB偏移：0x14）CAN消息数据低寄存器--------
// --------CAN_MDH:（CAN_MB偏移：0x18）CAN消息数据高位寄存器--------
// --------CAN_MCR：（CAN_MB偏移：0x1c）CAN消息控制寄存器--------
#define AT91C_CAN_MACR        ((unsigned int) 0x1 << 22) // （CAN_MB）中止邮箱请求
#define AT91C_CAN_MTCR        ((unsigned int) 0x1 << 23) // （CAN_MB）邮箱传输命令

// *****************************************************************************
//              控制区域网络接口的软件API定义
// *****************************************************************************
typedef struct _AT91S_CAN {
	AT91_REG	 CAN_MR; 	// 模式寄存器
	AT91_REG	 CAN_IER; 	// 中断启用寄存器
	AT91_REG	 CAN_IDR; 	// 中断禁用寄存器
	AT91_REG	 CAN_IMR; 	// 中断掩码寄存器
	AT91_REG	 CAN_SR; 	// 状态寄存器
	AT91_REG	 CAN_BR; 	// 波特率寄存器
	AT91_REG	 CAN_TIM; 	// 计时器寄存器
	AT91_REG	 CAN_TIMESTP; 	// 时间戳寄存器
	AT91_REG	 CAN_ECR; 	// 错误计数器寄存器
	AT91_REG	 CAN_TCR; 	// 传输命令寄存器
	AT91_REG	 CAN_ACR; 	// 中止命令寄存器
	AT91_REG	 Reserved0[52]; 	// 
	AT91_REG	 CAN_VR; 	// 版本寄存器
	AT91_REG	 Reserved1[64]; 	// 
	AT91S_CAN_MB	 CAN_MB0; 	// CAN邮箱0
	AT91S_CAN_MB	 CAN_MB1; 	// CAN邮箱1
	AT91S_CAN_MB	 CAN_MB2; 	// CAN邮箱2
	AT91S_CAN_MB	 CAN_MB3; 	// CAN邮箱3
	AT91S_CAN_MB	 CAN_MB4; 	// CAN邮箱4
	AT91S_CAN_MB	 CAN_MB5; 	// CAN邮箱5
	AT91S_CAN_MB	 CAN_MB6; 	// CAN邮箱6
	AT91S_CAN_MB	 CAN_MB7; 	// CAN邮箱7
	AT91S_CAN_MB	 CAN_MB8; 	// CAN邮箱8
	AT91S_CAN_MB	 CAN_MB9; 	// CAN邮箱9
	AT91S_CAN_MB	 CAN_MB10; 	// CAN邮箱10
	AT91S_CAN_MB	 CAN_MB11; 	// CAN邮箱11
	AT91S_CAN_MB	 CAN_MB12; 	// CAN邮箱12
	AT91S_CAN_MB	 CAN_MB13; 	// CAN邮箱13
	AT91S_CAN_MB	 CAN_MB14; 	// CAN邮箱14
	AT91S_CAN_MB	 CAN_MB15; 	// CAN邮箱15
} AT91S_CAN, *AT91PS_CAN;

// --------CAN_MR：（CAN偏移：0x0）CAN模式寄存器--------
#define AT91C_CAN_CANEN       ((unsigned int) 0x1 <<  0) // （CAN）CAN控制器启用
#define AT91C_CAN_LPM         ((unsigned int) 0x1 <<  1) // （CAN）禁用/启用低功率模式
#define AT91C_CAN_ABM         ((unsigned int) 0x1 <<  2) // （CAN）禁用/启用自动驾驶/监听模式
#define AT91C_CAN_OVL         ((unsigned int) 0x1 <<  3) // （CAN）禁用/启用过载框架
#define AT91C_CAN_TEOF        ((unsigned int) 0x1 <<  4) // （CAN）帧两端的时间戳消息
#define AT91C_CAN_TTM         ((unsigned int) 0x1 <<  5) // （CAN）禁用/启用时间触发模式
#define AT91C_CAN_TIMFRZ      ((unsigned int) 0x1 <<  6) // （CAN）启用计时器冻结
#define AT91C_CAN_DRPT        ((unsigned int) 0x1 <<  7) // （CAN）禁用重复
// --------CAN_IER：（CAN偏移：0x4）CAN中断启用寄存器--------
#define AT91C_CAN_MB0         ((unsigned int) 0x1 <<  0) // （CAN）邮箱0标志
#define AT91C_CAN_MB1         ((unsigned int) 0x1 <<  1) // （CAN）邮箱1标志
#define AT91C_CAN_MB2         ((unsigned int) 0x1 <<  2) // （CAN）邮箱2标志
#define AT91C_CAN_MB3         ((unsigned int) 0x1 <<  3) // （CAN）邮箱3标志
#define AT91C_CAN_MB4         ((unsigned int) 0x1 <<  4) // （CAN）邮箱4标志
#define AT91C_CAN_MB5         ((unsigned int) 0x1 <<  5) // （CAN）邮箱5标志
#define AT91C_CAN_MB6         ((unsigned int) 0x1 <<  6) // （CAN）邮箱6标志
#define AT91C_CAN_MB7         ((unsigned int) 0x1 <<  7) // （CAN）邮箱7标志
#define AT91C_CAN_MB8         ((unsigned int) 0x1 <<  8) // （CAN）邮箱8标志
#define AT91C_CAN_MB9         ((unsigned int) 0x1 <<  9) // （CAN）邮箱9标志
#define AT91C_CAN_MB10        ((unsigned int) 0x1 << 10) // （CAN）邮箱10标志
#define AT91C_CAN_MB11        ((unsigned int) 0x1 << 11) // （CAN）邮箱11标志
#define AT91C_CAN_MB12        ((unsigned int) 0x1 << 12) // （CAN）邮箱12标志
#define AT91C_CAN_MB13        ((unsigned int) 0x1 << 13) // （CAN）邮箱13标志
#define AT91C_CAN_MB14        ((unsigned int) 0x1 << 14) // （CAN）邮箱14标志
#define AT91C_CAN_MB15        ((unsigned int) 0x1 << 15) // （CAN）邮箱15标志
#define AT91C_CAN_ERRA        ((unsigned int) 0x1 << 16) // （CAN）错误激活模式标志
#define AT91C_CAN_WARN        ((unsigned int) 0x1 << 17) // （CAN）警告限制标志
#define AT91C_CAN_ERRP        ((unsigned int) 0x1 << 18) // （CAN）错误被动模式标志
#define AT91C_CAN_BOFF        ((unsigned int) 0x1 << 19) // （CAN）总线关闭模式标志
#define AT91C_CAN_SLEEP       ((unsigned int) 0x1 << 20) // （CAN）休眠标志
#define AT91C_CAN_WAKEUP      ((unsigned int) 0x1 << 21) // （CAN）唤醒标志
#define AT91C_CAN_TOVF        ((unsigned int) 0x1 << 22) // （CAN）计时器溢出标志
#define AT91C_CAN_TSTP        ((unsigned int) 0x1 << 23) // （CAN）时间戳标志
#define AT91C_CAN_CERR        ((unsigned int) 0x1 << 24) // （CAN）CRC错误
#define AT91C_CAN_SERR        ((unsigned int) 0x1 << 25) // （CAN）填充错误
#define AT91C_CAN_AERR        ((unsigned int) 0x1 << 26) // （CAN）确认错误
#define AT91C_CAN_FERR        ((unsigned int) 0x1 << 27) // （CAN）表单错误
#define AT91C_CAN_BERR        ((unsigned int) 0x1 << 28) // （CAN）位错误
// --------CAN_IDR:（CAN偏移：0x8）CAN中断禁用寄存器--------
// --------CAN_IMR：（CAN偏移：0xc）CAN中断掩码寄存器--------
// --------CAN_SR：（CAN偏移：0x10）CAN状态寄存器--------
#define AT91C_CAN_RBSY        ((unsigned int) 0x1 << 29) // （CAN）接收器忙
#define AT91C_CAN_TBSY        ((unsigned int) 0x1 << 30) // （CAN）发射器忙
#define AT91C_CAN_OVLY        ((unsigned int) 0x1 << 31) // （CAN）过载忙
// --------CAN_BR：（CAN偏移：0x14）CAN波特率寄存器--------
#define AT91C_CAN_PHASE2      ((unsigned int) 0x7 <<  0) // （CAN）阶段2段
#define AT91C_CAN_PHASE1      ((unsigned int) 0x7 <<  4) // （CAN）阶段1段
#define AT91C_CAN_PROPAG      ((unsigned int) 0x7 <<  8) // （CAN）编程时间段
#define AT91C_CAN_SYNC        ((unsigned int) 0x3 << 12) // （CAN）重新同步跳跃宽度段
#define AT91C_CAN_BRP         ((unsigned int) 0x7F << 16) // （CAN）波特率预分频器
#define AT91C_CAN_SMP         ((unsigned int) 0x1 << 24) // （CAN）采样模式
// --------CAN_TIM:（CAN偏移：0x18）CAN计时器寄存器--------
#define AT91C_CAN_TIMER       ((unsigned int) 0xFFFF <<  0) // （CAN）计时器字段
// --------CAN_TIMESTP:（CAN偏移：0x1c）CAN时间戳寄存器--------
// --------CAN_ECR:（CAN偏移：0x20）CAN错误计数器寄存器--------
#define AT91C_CAN_REC         ((unsigned int) 0xFF <<  0) // （CAN）接收错误计数器
#define AT91C_CAN_TEC         ((unsigned int) 0xFF << 16) // （CAN）传输错误计数器
// --------CAN_TCR：（CAN偏移：0x24）CAN传输命令寄存器--------
#define AT91C_CAN_TIMRST      ((unsigned int) 0x1 << 31) // （CAN）计时器重置字段
// --------CAN_ACR:（CAN偏移：0x28）CAN中止命令寄存器--------

// *****************************************************************************
//              以太网MAC 10/100的软件API定义
// *****************************************************************************
typedef struct _AT91S_EMAC {
	AT91_REG	 EMAC_NCR; 	// 网络控制寄存器
	AT91_REG	 EMAC_NCFGR; 	// 网络配置寄存器
	AT91_REG	 EMAC_NSR; 	// 网络状态寄存器
	AT91_REG	 Reserved0[2]; 	// 
	AT91_REG	 EMAC_TSR; 	// 传输状态寄存器
	AT91_REG	 EMAC_RBQP; 	// 接收缓冲区队列指针
	AT91_REG	 EMAC_TBQP; 	// 传输缓冲区队列指针
	AT91_REG	 EMAC_RSR; 	// 接收状态寄存器
	AT91_REG	 EMAC_ISR; 	// 中断状态寄存器
	AT91_REG	 EMAC_IER; 	// 中断启用寄存器
	AT91_REG	 EMAC_IDR; 	// 中断禁用寄存器
	AT91_REG	 EMAC_IMR; 	// 中断掩码寄存器
	AT91_REG	 EMAC_MAN; 	// PHY维护寄存器
	AT91_REG	 EMAC_PTR; 	// 暂停时间寄存器
	AT91_REG	 EMAC_PFR; 	// 暂停帧接收寄存器
	AT91_REG	 EMAC_FTO; 	// 帧发送OK寄存器
	AT91_REG	 EMAC_SCF; 	// 单碰撞帧寄存器
	AT91_REG	 EMAC_MCF; 	// 多冲突帧寄存器
	AT91_REG	 EMAC_FRO; 	// 帧接收OK寄存器
	AT91_REG	 EMAC_FCSE; 	// 帧检查序列错误寄存器
	AT91_REG	 EMAC_ALE; 	// 对齐错误寄存器
	AT91_REG	 EMAC_DTF; 	// 延迟传输帧寄存器
	AT91_REG	 EMAC_LCOL; 	// 延迟碰撞登记
	AT91_REG	 EMAC_ECOL; 	// 过度碰撞寄存器
	AT91_REG	 EMAC_TUND; 	// 传输欠载错误寄存器
	AT91_REG	 EMAC_CSE; 	// 载波检测错误寄存器
	AT91_REG	 EMAC_RRE; 	// 接收资源错误寄存器
	AT91_REG	 EMAC_ROV; 	// 接收溢出错误寄存器
	AT91_REG	 EMAC_RSE; 	// 接收符号错误寄存器
	AT91_REG	 EMAC_ELE; 	// 超长错误寄存器
	AT91_REG	 EMAC_RJA; 	// 接收Jabbers注册
	AT91_REG	 EMAC_USF; 	// 缩小帧寄存器
	AT91_REG	 EMAC_STE; 	// SQE测试错误寄存器
	AT91_REG	 EMAC_RLE; 	// 接收长度字段不匹配寄存器
	AT91_REG	 EMAC_TPF; 	// 发送的暂停帧寄存器
	AT91_REG	 EMAC_HRB; 	// 哈希地址底部[31:0]
	AT91_REG	 EMAC_HRT; 	// 哈希地址顶部[63:32]
	AT91_REG	 EMAC_SA1L; 	// 特定地址1底部，前4字节
	AT91_REG	 EMAC_SA1H; 	// 特定地址1顶部，最后2字节
	AT91_REG	 EMAC_SA2L; 	// 特定地址2底部，前4字节
	AT91_REG	 EMAC_SA2H; 	// 特定地址2顶部，最后2个字节
	AT91_REG	 EMAC_SA3L; 	// 特定地址3底部，前4字节
	AT91_REG	 EMAC_SA3H; 	// 特定地址3顶部，最后2个字节
	AT91_REG	 EMAC_SA4L; 	// 特定地址4底部，前4字节
	AT91_REG	 EMAC_SA4H; 	// 特定地址4顶部，最后2个字节
	AT91_REG	 EMAC_TID; 	// 类型ID检查寄存器
	AT91_REG	 EMAC_TPQ; 	// 传输暂停量子寄存器
	AT91_REG	 EMAC_USRIO; 	// 用户输入/输出寄存器
	AT91_REG	 EMAC_WOL; 	// LAN唤醒寄存器
	AT91_REG	 Reserved1[13]; 	// 
	AT91_REG	 EMAC_REV; 	// 修订登记簿
} AT91S_EMAC, *AT91PS_EMAC;

// --------EMAC_NCR：（EMAC偏移：0x0）--------
#define AT91C_EMAC_LB         ((unsigned int) 0x1 <<  0) // （EMAC）环回。可选择的设置后，回送信号处于高电平。
#define AT91C_EMAC_LLB        ((unsigned int) 0x1 <<  1) // （EMAC）本地环回。
#define AT91C_EMAC_RE         ((unsigned int) 0x1 <<  2) // （EMAC）接收启用。
#define AT91C_EMAC_TE         ((unsigned int) 0x1 <<  3) // （EMAC）发射启用。
#define AT91C_EMAC_MPE        ((unsigned int) 0x1 <<  4) // （EMAC）管理端口启用。
#define AT91C_EMAC_CLRSTAT    ((unsigned int) 0x1 <<  5) // （EMAC）清除统计寄存器。
#define AT91C_EMAC_INCSTAT    ((unsigned int) 0x1 <<  6) // （EMAC）增量统计寄存器。
#define AT91C_EMAC_WESTAT     ((unsigned int) 0x1 <<  7) // （EMAC）统计寄存器的写入启用。
#define AT91C_EMAC_BP         ((unsigned int) 0x1 <<  8) // （EMAC）背压。
#define AT91C_EMAC_TSTART     ((unsigned int) 0x1 <<  9) // （EMAC）开始传输。
#define AT91C_EMAC_THALT      ((unsigned int) 0x1 << 10) // （EMAC）传输停止。
#define AT91C_EMAC_TPFR       ((unsigned int) 0x1 << 11) // （EMAC）发送暂停帧
#define AT91C_EMAC_TZQ        ((unsigned int) 0x1 << 12) // （EMAC）发送零量子暂停帧
// --------EMAC_NCFGR：（EMAC偏移：0x4）网络配置寄存器--------
#define AT91C_EMAC_SPD        ((unsigned int) 0x1 <<  0) // （EMAC）速度。
#define AT91C_EMAC_FD         ((unsigned int) 0x1 <<  1) // （EMAC）全双工。
#define AT91C_EMAC_JFRAME     ((unsigned int) 0x1 <<  3) // （EMAC）巨型框架。
#define AT91C_EMAC_CAF        ((unsigned int) 0x1 <<  4) // （EMAC）复制所有帧。
#define AT91C_EMAC_NBC        ((unsigned int) 0x1 <<  5) // （EMAC）没有广播。
#define AT91C_EMAC_MTI        ((unsigned int) 0x1 <<  6) // （EMAC）多播哈希事件启用
#define AT91C_EMAC_UNI        ((unsigned int) 0x1 <<  7) // （EMAC）启用单播哈希。
#define AT91C_EMAC_BIG        ((unsigned int) 0x1 <<  8) // （EMAC）接收1522字节。
#define AT91C_EMAC_EAE        ((unsigned int) 0x1 <<  9) // （EMAC）外部地址匹配启用。
#define AT91C_EMAC_CLK        ((unsigned int) 0x3 << 10) // (EMAC) 
#define 	AT91C_EMAC_CLK_HCLK_8               ((unsigned int) 0x0 << 10) // （EMAC）HCLK除以8
#define 	AT91C_EMAC_CLK_HCLK_16              ((unsigned int) 0x1 << 10) // （EMAC）HCLK除以16
#define 	AT91C_EMAC_CLK_HCLK_32              ((unsigned int) 0x2 << 10) // （EMAC）HCLK除以32
#define 	AT91C_EMAC_CLK_HCLK_64              ((unsigned int) 0x3 << 10) // （EMAC）HCLK除以64
#define AT91C_EMAC_RTY        ((unsigned int) 0x1 << 12) // (EMAC) 
#define AT91C_EMAC_PAE        ((unsigned int) 0x1 << 13) // (EMAC) 
#define AT91C_EMAC_RBOF       ((unsigned int) 0x3 << 14) // (EMAC) 
#define 	AT91C_EMAC_RBOF_OFFSET_0             ((unsigned int) 0x0 << 14) // （EMAC）从接收缓冲区开始无偏移
#define 	AT91C_EMAC_RBOF_OFFSET_1             ((unsigned int) 0x1 << 14) // （EMAC）从接收缓冲区开始的一个字节偏移
#define 	AT91C_EMAC_RBOF_OFFSET_2             ((unsigned int) 0x2 << 14) // （EMAC）从接收缓冲区开始偏移两个字节
#define 	AT91C_EMAC_RBOF_OFFSET_3             ((unsigned int) 0x3 << 14) // （EMAC）从接收缓冲区开始偏移三个字节
#define AT91C_EMAC_RLCE       ((unsigned int) 0x1 << 16) // （EMAC）接收长度字段检查启用
#define AT91C_EMAC_DRFCS      ((unsigned int) 0x1 << 17) // （EMAC）放弃接收FCS
#define AT91C_EMAC_EFRHD      ((unsigned int) 0x1 << 18) // (EMAC) 
#define AT91C_EMAC_IRXFCS     ((unsigned int) 0x1 << 19) // （EMAC）忽略RX FCS
// --------EMAC_NSR:（EMAC偏移量：0x8）网络状态寄存器--------
#define AT91C_EMAC_LINKR      ((unsigned int) 0x1 <<  0) // (EMAC) 
#define AT91C_EMAC_MDIO       ((unsigned int) 0x1 <<  1) // (EMAC) 
#define AT91C_EMAC_IDLE       ((unsigned int) 0x1 <<  2) // (EMAC) 
// --------EMAC_TSR：（EMAC偏移：0x14）传输状态寄存器--------
#define AT91C_EMAC_UBR        ((unsigned int) 0x1 <<  0) // (EMAC) 
#define AT91C_EMAC_COL        ((unsigned int) 0x1 <<  1) // (EMAC) 
#define AT91C_EMAC_RLES       ((unsigned int) 0x1 <<  2) // (EMAC) 
#define AT91C_EMAC_TGO        ((unsigned int) 0x1 <<  3) // （EMAC）发送开始
#define AT91C_EMAC_BEX        ((unsigned int) 0x1 <<  4) // （EMAC）中间帧缓冲区耗尽
#define AT91C_EMAC_COMP       ((unsigned int) 0x1 <<  5) // (EMAC) 
#define AT91C_EMAC_UND        ((unsigned int) 0x1 <<  6) // (EMAC) 
// --------EMAC_RSR：（EMAC偏移：0x20）接收状态寄存器--------
#define AT91C_EMAC_BNA        ((unsigned int) 0x1 <<  0) // (EMAC) 
#define AT91C_EMAC_REC        ((unsigned int) 0x1 <<  1) // (EMAC) 
#define AT91C_EMAC_OVR        ((unsigned int) 0x1 <<  2) // (EMAC) 
// --------EMAC_ISR：（EMAC偏移：0x24）中断状态寄存器--------
#define AT91C_EMAC_MFD        ((unsigned int) 0x1 <<  0) // (EMAC) 
#define AT91C_EMAC_RCOMP      ((unsigned int) 0x1 <<  1) // (EMAC) 
#define AT91C_EMAC_RXUBR      ((unsigned int) 0x1 <<  2) // (EMAC) 
#define AT91C_EMAC_TXUBR      ((unsigned int) 0x1 <<  3) // (EMAC) 
#define AT91C_EMAC_TUNDR      ((unsigned int) 0x1 <<  4) // (EMAC) 
#define AT91C_EMAC_RLEX       ((unsigned int) 0x1 <<  5) // (EMAC) 
#define AT91C_EMAC_TXERR      ((unsigned int) 0x1 <<  6) // (EMAC) 
#define AT91C_EMAC_TCOMP      ((unsigned int) 0x1 <<  7) // (EMAC) 
#define AT91C_EMAC_LINK       ((unsigned int) 0x1 <<  9) // (EMAC) 
#define AT91C_EMAC_ROVR       ((unsigned int) 0x1 << 10) // (EMAC) 
#define AT91C_EMAC_HRESP      ((unsigned int) 0x1 << 11) // (EMAC) 
#define AT91C_EMAC_PFRE       ((unsigned int) 0x1 << 12) // (EMAC) 
#define AT91C_EMAC_PTZ        ((unsigned int) 0x1 << 13) // (EMAC) 
// --------EMAC_IER:（EMAC偏移：0x28）中断启用寄存器--------
// --------EMAC_IDR：（EMAC偏移：0x2c）中断禁用寄存器--------
// --------EMAC_IMR：（EMAC偏移：0x30）中断掩码寄存器--------
// --------EMAC_MAN：（EMAC偏移：0x34）PHY维护寄存器--------
#define AT91C_EMAC_DATA       ((unsigned int) 0xFFFF <<  0) // (EMAC) 
#define AT91C_EMAC_CODE       ((unsigned int) 0x3 << 16) // (EMAC) 
#define AT91C_EMAC_REGA       ((unsigned int) 0x1F << 18) // (EMAC) 
#define AT91C_EMAC_PHYA       ((unsigned int) 0x1F << 23) // (EMAC) 
#define AT91C_EMAC_RW         ((unsigned int) 0x3 << 28) // (EMAC) 
#define AT91C_EMAC_SOF        ((unsigned int) 0x3 << 30) // (EMAC) 
// --------EMAC_USRIO：（EMAC偏移：0xc0）用户输入输出寄存器--------
#define AT91C_EMAC_RMII       ((unsigned int) 0x1 <<  0) // （EMAC）减少MII
#define AT91C_EMAC_CLKEN      ((unsigned int) 0x1 <<  1) // （EMAC）时钟启用
// --------EMAC_WOL：（EMAC偏移：0xc4）LAN唤醒寄存器--------
#define AT91C_EMAC_IP         ((unsigned int) 0xFFFF <<  0) // （EMAC）ARP请求IP地址
#define AT91C_EMAC_MAG        ((unsigned int) 0x1 << 16) // （EMAC）魔术包事件启用
#define AT91C_EMAC_ARP        ((unsigned int) 0x1 << 17) // （EMAC）ARP请求事件启用
#define AT91C_EMAC_SA1        ((unsigned int) 0x1 << 18) // （EMAC）特定地址寄存器1事件启用
// --------EMAC_REV：（EMAC偏移：0xfc）修订寄存器--------
#define AT91C_EMAC_REVREF     ((unsigned int) 0xFFFF <<  0) // (EMAC) 
#define AT91C_EMAC_PARTREF    ((unsigned int) 0xFFFF << 16) // (EMAC) 

// *****************************************************************************
//              模数转换器的软件API定义
// *****************************************************************************
typedef struct _AT91S_ADC {
	AT91_REG	 ADC_CR; 	// ADC控制寄存器
	AT91_REG	 ADC_MR; 	// ADC模式寄存器
	AT91_REG	 Reserved0[2]; 	// 
	AT91_REG	 ADC_CHER; 	// ADC通道启用寄存器
	AT91_REG	 ADC_CHDR; 	// ADC通道禁用寄存器
	AT91_REG	 ADC_CHSR; 	// ADC通道状态寄存器
	AT91_REG	 ADC_SR; 	// ADC状态寄存器
	AT91_REG	 ADC_LCDR; 	// ADC上次转换的数据寄存器
	AT91_REG	 ADC_IER; 	// ADC中断启用寄存器
	AT91_REG	 ADC_IDR; 	// ADC中断禁用寄存器
	AT91_REG	 ADC_IMR; 	// ADC中断掩码寄存器
	AT91_REG	 ADC_CDR0; 	// ADC通道数据寄存器0
	AT91_REG	 ADC_CDR1; 	// ADC通道数据寄存器1
	AT91_REG	 ADC_CDR2; 	// ADC通道数据寄存器2
	AT91_REG	 ADC_CDR3; 	// ADC通道数据寄存器3
	AT91_REG	 ADC_CDR4; 	// ADC通道数据寄存器4
	AT91_REG	 ADC_CDR5; 	// ADC通道数据寄存器5
	AT91_REG	 ADC_CDR6; 	// ADC通道数据寄存器6
	AT91_REG	 ADC_CDR7; 	// ADC通道数据寄存器7
	AT91_REG	 Reserved1[44]; 	// 
	AT91_REG	 ADC_RPR; 	// 接收指针寄存器
	AT91_REG	 ADC_RCR; 	// 接收计数器寄存器
	AT91_REG	 ADC_TPR; 	// 发送指针寄存器
	AT91_REG	 ADC_TCR; 	// 发送计数器寄存器
	AT91_REG	 ADC_RNPR; 	// 接收下一个指针寄存器
	AT91_REG	 ADC_RNCR; 	// 接收下一计数器寄存器
	AT91_REG	 ADC_TNPR; 	// 发送下一指针寄存器
	AT91_REG	 ADC_TNCR; 	// 发送下一计数器寄存器
	AT91_REG	 ADC_PTCR; 	// PDC传输控制寄存器
	AT91_REG	 ADC_PTSR; 	// PDC传输状态寄存器
} AT91S_ADC, *AT91PS_ADC;

// --------ADC_CR:（ADC偏移：0x0）ADC控制寄存器--------
#define AT91C_ADC_SWRST       ((unsigned int) 0x1 <<  0) // （ADC）软件重置
#define AT91C_ADC_START       ((unsigned int) 0x1 <<  1) // （ADC）开始转换
// --------ADC_MR:（ADC偏移：0x4）ADC模式寄存器--------
#define AT91C_ADC_TRGEN       ((unsigned int) 0x1 <<  0) // （ADC）触发启用
#define 	AT91C_ADC_TRGEN_DIS                  ((unsigned int) 0x0) // （ADC）Hradware触发器已禁用。只能通过软件启动转换
#define 	AT91C_ADC_TRGEN_EN                   ((unsigned int) 0x1) // （ADC）启用TRGSEL字段选择的硬件触发器。
#define AT91C_ADC_TRGSEL      ((unsigned int) 0x7 <<  1) // （ADC）触发选择
#define 	AT91C_ADC_TRGSEL_TIOA0                ((unsigned int) 0x0 <<  1) // （ADC）所选TRGSEL=TIAO0
#define 	AT91C_ADC_TRGSEL_TIOA1                ((unsigned int) 0x1 <<  1) // （ADC）所选TRGSEL=TIAO1
#define 	AT91C_ADC_TRGSEL_TIOA2                ((unsigned int) 0x2 <<  1) // （ADC）所选TRGSEL=TIAO2
#define 	AT91C_ADC_TRGSEL_TIOA3                ((unsigned int) 0x3 <<  1) // （ADC）所选TRGSEL=TIAO3
#define 	AT91C_ADC_TRGSEL_TIOA4                ((unsigned int) 0x4 <<  1) // （ADC）所选TRGSEL=TIAO4
#define 	AT91C_ADC_TRGSEL_TIOA5                ((unsigned int) 0x5 <<  1) // （ADC）所选TRGSEL=TIAO5
#define 	AT91C_ADC_TRGSEL_EXT                  ((unsigned int) 0x6 <<  1) // （ADC）所选TRGSEL=外部触发器
#define AT91C_ADC_LOWRES      ((unsigned int) 0x1 <<  4) // （ADC）分辨率。
#define 	AT91C_ADC_LOWRES_10_BIT               ((unsigned int) 0x0 <<  4) // （ADC）10位分辨率
#define 	AT91C_ADC_LOWRES_8_BIT                ((unsigned int) 0x1 <<  4) // （ADC）8位分辨率
#define AT91C_ADC_SLEEP       ((unsigned int) 0x1 <<  5) // （ADC）睡眠模式
#define 	AT91C_ADC_SLEEP_NORMAL_MODE          ((unsigned int) 0x0 <<  5) // （ADC）正常模式
#define 	AT91C_ADC_SLEEP_MODE                 ((unsigned int) 0x1 <<  5) // （ADC）睡眠模式
#define AT91C_ADC_PRESCAL     ((unsigned int) 0x3F <<  8) // （ADC）预缩放速率选择
#define AT91C_ADC_STARTUP     ((unsigned int) 0x1F << 16) // （ADC）启动时间
#define AT91C_ADC_SHTIM       ((unsigned int) 0xF << 24) // （ADC）采样和保持时间
// --------ADC_CHER：（ADC偏移：0x10）ADC通道启用寄存器--------
#define AT91C_ADC_CH0         ((unsigned int) 0x1 <<  0) // （ADC）通道0
#define AT91C_ADC_CH1         ((unsigned int) 0x1 <<  1) // （ADC）通道1
#define AT91C_ADC_CH2         ((unsigned int) 0x1 <<  2) // （ADC）通道2
#define AT91C_ADC_CH3         ((unsigned int) 0x1 <<  3) // （ADC）通道3
#define AT91C_ADC_CH4         ((unsigned int) 0x1 <<  4) // （ADC）通道4
#define AT91C_ADC_CH5         ((unsigned int) 0x1 <<  5) // （ADC）通道5
#define AT91C_ADC_CH6         ((unsigned int) 0x1 <<  6) // （ADC）通道6
#define AT91C_ADC_CH7         ((unsigned int) 0x1 <<  7) // （ADC）通道7
// --------ADC_CHDR：（ADC偏移：0x14）ADC通道禁用寄存器--------
// --------ADC_HSR:（ADC偏移：0x18）ADC通道状态寄存器--------
// --------ADC_SR：（ADC偏移量：0x1c）ADC状态寄存器--------
#define AT91C_ADC_EOC0        ((unsigned int) 0x1 <<  0) // （ADC）转换结束
#define AT91C_ADC_EOC1        ((unsigned int) 0x1 <<  1) // （ADC）转换结束
#define AT91C_ADC_EOC2        ((unsigned int) 0x1 <<  2) // （ADC）转换结束
#define AT91C_ADC_EOC3        ((unsigned int) 0x1 <<  3) // （ADC）转换结束
#define AT91C_ADC_EOC4        ((unsigned int) 0x1 <<  4) // （ADC）转换结束
#define AT91C_ADC_EOC5        ((unsigned int) 0x1 <<  5) // （ADC）转换结束
#define AT91C_ADC_EOC6        ((unsigned int) 0x1 <<  6) // （ADC）转换结束
#define AT91C_ADC_EOC7        ((unsigned int) 0x1 <<  7) // （ADC）转换结束
#define AT91C_ADC_OVRE0       ((unsigned int) 0x1 <<  8) // （ADC）超限错误
#define AT91C_ADC_OVRE1       ((unsigned int) 0x1 <<  9) // （ADC）超限错误
#define AT91C_ADC_OVRE2       ((unsigned int) 0x1 << 10) // （ADC）超限错误
#define AT91C_ADC_OVRE3       ((unsigned int) 0x1 << 11) // （ADC）超限错误
#define AT91C_ADC_OVRE4       ((unsigned int) 0x1 << 12) // （ADC）超限错误
#define AT91C_ADC_OVRE5       ((unsigned int) 0x1 << 13) // （ADC）超限错误
#define AT91C_ADC_OVRE6       ((unsigned int) 0x1 << 14) // （ADC）超限错误
#define AT91C_ADC_OVRE7       ((unsigned int) 0x1 << 15) // （ADC）超限错误
#define AT91C_ADC_DRDY        ((unsigned int) 0x1 << 16) // （ADC）数据就绪
#define AT91C_ADC_GOVRE       ((unsigned int) 0x1 << 17) // （ADC）一般超限
#define AT91C_ADC_ENDRX       ((unsigned int) 0x1 << 18) // （ADC）接收器传输结束
#define AT91C_ADC_RXBUFF      ((unsigned int) 0x1 << 19) // （ADC）RXBUFF中断
// --------ADC_LCD:（ADC偏移量：0x20）ADC上次转换的数据寄存器--------
#define AT91C_ADC_LDATA       ((unsigned int) 0x3FF <<  0) // （ADC）上次转换的数据
// --------ADC_IER:（ADC偏移：0x24）ADC中断启用寄存器--------
// --------ADC_IDR:（ADC偏移量：0x28）ADC中断禁用寄存器--------
// --------ADC_IMR:（ADC偏移量：0x2c）ADC中断掩码寄存器--------
// --------ADC_CDR0:（ADC偏移量：0x30）ADC通道数据寄存器0--------
#define AT91C_ADC_DATA        ((unsigned int) 0x3FF <<  0) // （ADC）转换数据
// --------ADC_CDR1:（ADC偏移：0x34）ADC通道数据寄存器1---------
// --------ADC_CDR2:（ADC偏移：0x38）ADC通道数据寄存器2---------
// --------ADC_CDR3:（ADC偏移：0x3c）ADC通道数据寄存器3---------
// --------ADC_CDR4:（ADC偏移：0x40）ADC通道数据寄存器4---------
// --------ADC_CDR5:（ADC偏移：0x44）ADC通道数据寄存器5---------
// --------ADC_CDR6：（ADC偏移量：0x48）ADC通道数据寄存器6---------
// --------ADC_CDR7：（ADC偏移量：0x4c）ADC通道数据寄存器7---------

