DYXX-X/Library_zh/ESP32_API_zh/cmock/CMock/test/iar/iar_v4/incIAR/ioat91sam7x256.h
// *****************************************************************************
//               REGISTER ADDRESS DEFINITION FOR AT91SAM7X256
// *****************************************************************************
// ============SYS外围设备的寄存器定义============
// ============AIC外围设备的寄存器定义============
#define AT91C_AIC_IVR   ((AT91_REG *) 	0xFFFFF100) // （AIC）IRQ矢量寄存器
#define AT91C_AIC_SMR   ((AT91_REG *) 	0xFFFFF000) // （AIC）源模式寄存器
#define AT91C_AIC_FVR   ((AT91_REG *) 	0xFFFFF104) // （AIC）FIQ矢量寄存器
#define AT91C_AIC_DCR   ((AT91_REG *) 	0xFFFFF138) // （AIC）调试控制寄存器（保护）
#define AT91C_AIC_EOICR ((AT91_REG *) 	0xFFFFF130) // （AIC）中断命令寄存器结束
#define AT91C_AIC_SVR   ((AT91_REG *) 	0xFFFFF080) // （AIC）源矢量寄存器
#define AT91C_AIC_FFSR  ((AT91_REG *) 	0xFFFFF148) // （AIC）快速强制状态寄存器
#define AT91C_AIC_ICCR  ((AT91_REG *) 	0xFFFFF128) // （AIC）中断清除命令寄存器
#define AT91C_AIC_ISR   ((AT91_REG *) 	0xFFFFF108) // （AIC）中断状态寄存器
#define AT91C_AIC_IMR   ((AT91_REG *) 	0xFFFFF110) // （AIC）中断掩码寄存器
#define AT91C_AIC_IPR   ((AT91_REG *) 	0xFFFFF10C) // （AIC）中断挂起寄存器
#define AT91C_AIC_FFER  ((AT91_REG *) 	0xFFFFF140) // （AIC）快速强制启用寄存器
#define AT91C_AIC_IECR  ((AT91_REG *) 	0xFFFFF120) // （AIC）中断启用命令寄存器
#define AT91C_AIC_ISCR  ((AT91_REG *) 	0xFFFFF12C) // （AIC）中断设置命令寄存器
#define AT91C_AIC_FFDR  ((AT91_REG *) 	0xFFFFF144) // （AIC）快速强制禁用寄存器
#define AT91C_AIC_CISR  ((AT91_REG *) 	0xFFFFF114) // （AIC）核心中断状态寄存器
#define AT91C_AIC_IDCR  ((AT91_REG *) 	0xFFFFF124) // （AIC）中断禁用命令寄存器
#define AT91C_AIC_SPU   ((AT91_REG *) 	0xFFFFF134) // （AIC）杂散矢量寄存器
// ============PDC_DBGU外围设备的寄存器定义============
#define AT91C_DBGU_TCR  ((AT91_REG *) 	0xFFFFF30C) // （PDC_DBGU）发送计数器寄存器
#define AT91C_DBGU_RNPR ((AT91_REG *) 	0xFFFFF310) // （PDC_DBGU）接收下一个指针寄存器
#define AT91C_DBGU_TNPR ((AT91_REG *) 	0xFFFFF318) // （PDC_DBGU）发送下一个指针寄存器
#define AT91C_DBGU_TPR  ((AT91_REG *) 	0xFFFFF308) // （PDC_DBGU）发送指针寄存器
#define AT91C_DBGU_RPR  ((AT91_REG *) 	0xFFFFF300) // （PDC_DBGU）接收指针寄存器
#define AT91C_DBGU_RCR  ((AT91_REG *) 	0xFFFFF304) // （PDC_DBGU）接收计数器寄存器
#define AT91C_DBGU_RNCR ((AT91_REG *) 	0xFFFFF314) // （PDC_DBGU）接收下一个计数器寄存器
#define AT91C_DBGU_PTCR ((AT91_REG *) 	0xFFFFF320) // （PDC_DBGU）PDC传输控制寄存器
#define AT91C_DBGU_PTSR ((AT91_REG *) 	0xFFFFF324) // （PDC_DBGU）PDC传输状态寄存器
#define AT91C_DBGU_TNCR ((AT91_REG *) 	0xFFFFF31C) // （PDC_DBGU）发送下一计数器寄存器
// ============DBGU外围设备的寄存器定义============
#define AT91C_DBGU_EXID ((AT91_REG *) 	0xFFFFF244) // （DBGU）芯片ID扩展寄存器
#define AT91C_DBGU_BRGR ((AT91_REG *) 	0xFFFFF220) // （DBGU）波特率生成器寄存器
#define AT91C_DBGU_IDR  ((AT91_REG *) 	0xFFFFF20C) // （DBGU）中断禁用寄存器
#define AT91C_DBGU_CSR  ((AT91_REG *) 	0xFFFFF214) // （DBGU）信道状态寄存器
#define AT91C_DBGU_CIDR ((AT91_REG *) 	0xFFFFF240) // （DBGU）芯片ID寄存器
#define AT91C_DBGU_MR   ((AT91_REG *) 	0xFFFFF204) // （DBGU）模式寄存器
#define AT91C_DBGU_IMR  ((AT91_REG *) 	0xFFFFF210) // （DBGU）中断掩码寄存器
#define AT91C_DBGU_CR   ((AT91_REG *) 	0xFFFFF200) // （DBGU）控制寄存器
#define AT91C_DBGU_FNTR ((AT91_REG *) 	0xFFFFF248) // （DBGU）强制NTRST寄存器
#define AT91C_DBGU_THR  ((AT91_REG *) 	0xFFFFF21C) // （DBGU）发射机保持寄存器
#define AT91C_DBGU_RHR  ((AT91_REG *) 	0xFFFFF218) // （DBGU）接收机保持寄存器
#define AT91C_DBGU_IER  ((AT91_REG *) 	0xFFFFF208) // （DBGU）中断启用寄存器
// ============PIOA外围设备的寄存器定义============
#define AT91C_PIOA_ODR  ((AT91_REG *) 	0xFFFFF414) // （PIOA）输出禁用寄存器
#define AT91C_PIOA_SODR ((AT91_REG *) 	0xFFFFF430) // （PIOA）设置输出数据寄存器
#define AT91C_PIOA_ISR  ((AT91_REG *) 	0xFFFFF44C) // （PIOA）中断状态寄存器
#define AT91C_PIOA_ABSR ((AT91_REG *) 	0xFFFFF478) // （PIOA）AB选择状态寄存器
#define AT91C_PIOA_IER  ((AT91_REG *) 	0xFFFFF440) // （PIOA）中断启用寄存器
#define AT91C_PIOA_PPUDR ((AT91_REG *) 	0xFFFFF460) // （PIOA）上拉禁用寄存器
#define AT91C_PIOA_IMR  ((AT91_REG *) 	0xFFFFF448) // （PIOA）中断掩码寄存器
#define AT91C_PIOA_PER  ((AT91_REG *) 	0xFFFFF400) // （PIOA）PIO启用寄存器
#define AT91C_PIOA_IFDR ((AT91_REG *) 	0xFFFFF424) // （PIOA）输入滤波器禁用寄存器
#define AT91C_PIOA_OWDR ((AT91_REG *) 	0xFFFFF4A4) // （PIOA）输出写入禁用寄存器
#define AT91C_PIOA_MDSR ((AT91_REG *) 	0xFFFFF458) // （PIOA）多驱动程序状态寄存器
#define AT91C_PIOA_IDR  ((AT91_REG *) 	0xFFFFF444) // （PIOA）中断禁用寄存器
#define AT91C_PIOA_ODSR ((AT91_REG *) 	0xFFFFF438) // （PIOA）输出数据状态寄存器
#define AT91C_PIOA_PPUSR ((AT91_REG *) 	0xFFFFF468) // （PIOA）上拉状态寄存器
#define AT91C_PIOA_OWSR ((AT91_REG *) 	0xFFFFF4A8) // （PIOA）输出写入状态寄存器
#define AT91C_PIOA_BSR  ((AT91_REG *) 	0xFFFFF474) // （PIOA）选择B寄存器
#define AT91C_PIOA_OWER ((AT91_REG *) 	0xFFFFF4A0) // （PIOA）输出写入启用寄存器
#define AT91C_PIOA_IFER ((AT91_REG *) 	0xFFFFF420) // （PIOA）输入滤波器启用寄存器
#define AT91C_PIOA_PDSR ((AT91_REG *) 	0xFFFFF43C) // （PIOA）引脚数据状态寄存器
#define AT91C_PIOA_PPUER ((AT91_REG *) 	0xFFFFF464) // （PIOA）上拉启用寄存器
#define AT91C_PIOA_OSR  ((AT91_REG *) 	0xFFFFF418) // （PIOA）输出状态寄存器
#define AT91C_PIOA_ASR  ((AT91_REG *) 	0xFFFFF470) // （PIOA）选择一个寄存器
#define AT91C_PIOA_MDDR ((AT91_REG *) 	0xFFFFF454) // （PIOA）多驱动程序禁用寄存器
#define AT91C_PIOA_CODR ((AT91_REG *) 	0xFFFFF434) // （PIOA）清除输出数据寄存器
#define AT91C_PIOA_MDER ((AT91_REG *) 	0xFFFFF450) // （PIOA）多驱动程序启用寄存器
#define AT91C_PIOA_PDR  ((AT91_REG *) 	0xFFFFF404) // （PIOA）PIO禁用寄存器
#define AT91C_PIOA_IFSR ((AT91_REG *) 	0xFFFFF428) // （PIOA）输入滤波器状态寄存器
#define AT91C_PIOA_OER  ((AT91_REG *) 	0xFFFFF410) // （PIOA）输出启用寄存器
#define AT91C_PIOA_PSR  ((AT91_REG *) 	0xFFFFF408) // （PIOA）PIO状态寄存器
// ============PIOB外围设备的寄存器定义============
#define AT91C_PIOB_OWDR ((AT91_REG *) 	0xFFFFF6A4) // （PIOB）输出写禁止寄存器
#define AT91C_PIOB_MDER ((AT91_REG *) 	0xFFFFF650) // （PIOB）多驱动器启用寄存器
#define AT91C_PIOB_PPUSR ((AT91_REG *) 	0xFFFFF668) // （PIOB）上拉状态寄存器
#define AT91C_PIOB_IMR  ((AT91_REG *) 	0xFFFFF648) // （PIOB）中断掩码寄存器
#define AT91C_PIOB_ASR  ((AT91_REG *) 	0xFFFFF670) // （PIOB）选择寄存器
#define AT91C_PIOB_PPUDR ((AT91_REG *) 	0xFFFFF660) // （PIOB）上拉禁用寄存器
#define AT91C_PIOB_PSR  ((AT91_REG *) 	0xFFFFF608) // （PIOB）PIO状态寄存器
#define AT91C_PIOB_IER  ((AT91_REG *) 	0xFFFFF640) // （PIOB）中断启用寄存器
#define AT91C_PIOB_CODR ((AT91_REG *) 	0xFFFFF634) // （PIOB）清除输出数据寄存器
#define AT91C_PIOB_OWER ((AT91_REG *) 	0xFFFFF6A0) // （PIOB）输出写入启用寄存器
#define AT91C_PIOB_ABSR ((AT91_REG *) 	0xFFFFF678) // （PIOB）AB选择状态寄存器
#define AT91C_PIOB_IFDR ((AT91_REG *) 	0xFFFFF624) // （PIOB）输入滤波器禁用寄存器
#define AT91C_PIOB_PDSR ((AT91_REG *) 	0xFFFFF63C) // （PIOB）引脚数据状态寄存器
#define AT91C_PIOB_IDR  ((AT91_REG *) 	0xFFFFF644) // （PIOB）中断禁用寄存器
#define AT91C_PIOB_OWSR ((AT91_REG *) 	0xFFFFF6A8) // （PIOB）输出写入状态寄存器
#define AT91C_PIOB_PDR  ((AT91_REG *) 	0xFFFFF604) // （PIOB）PIO禁用寄存器
#define AT91C_PIOB_ODR  ((AT91_REG *) 	0xFFFFF614) // （PIOB）输出禁用寄存器
#define AT91C_PIOB_IFSR ((AT91_REG *) 	0xFFFFF628) // （PIOB）输入滤波器状态寄存器
#define AT91C_PIOB_PPUER ((AT91_REG *) 	0xFFFFF664) // （PIOB）上拉启用寄存器
#define AT91C_PIOB_SODR ((AT91_REG *) 	0xFFFFF630) // （PIOB）设置输出数据寄存器
#define AT91C_PIOB_ISR  ((AT91_REG *) 	0xFFFFF64C) // （PIOB）中断状态寄存器
#define AT91C_PIOB_ODSR ((AT91_REG *) 	0xFFFFF638) // （PIOB）输出数据状态寄存器
#define AT91C_PIOB_OSR  ((AT91_REG *) 	0xFFFFF618) // （PIOB）输出状态寄存器
#define AT91C_PIOB_MDSR ((AT91_REG *) 	0xFFFFF658) // （PIOB）多驱动程序状态寄存器
#define AT91C_PIOB_IFER ((AT91_REG *) 	0xFFFFF620) // （PIOB）输入滤波器启用寄存器
#define AT91C_PIOB_BSR  ((AT91_REG *) 	0xFFFFF674) // （PIOB）选择B寄存器
#define AT91C_PIOB_MDDR ((AT91_REG *) 	0xFFFFF654) // （PIOB）多驱动器禁用寄存器
#define AT91C_PIOB_OER  ((AT91_REG *) 	0xFFFFF610) // （PIOB）输出启用寄存器
#define AT91C_PIOB_PER  ((AT91_REG *) 	0xFFFFF600) // （PIOB）PIO启用寄存器
// ============CKGR外围设备的寄存器定义============
#define AT91C_CKGR_MOR  ((AT91_REG *) 	0xFFFFFC20) // （CKGR）主振荡器寄存器
#define AT91C_CKGR_PLLR ((AT91_REG *) 	0xFFFFFC2C) // （CKGR）PLL寄存器
#define AT91C_CKGR_MCFR ((AT91_REG *) 	0xFFFFFC24) // （CKGR）主时钟频率寄存器
// ===========PMC外围设备的寄存器定义==========
#define AT91C_PMC_IDR   ((AT91_REG *) 	0xFFFFFC64) // （PMC）中断禁用寄存器
#define AT91C_PMC_MOR   ((AT91_REG *) 	0xFFFFFC20) // （PMC）主振荡器寄存器
#define AT91C_PMC_PLLR  ((AT91_REG *) 	0xFFFFFC2C) // （PMC）PLL寄存器
#define AT91C_PMC_PCER  ((AT91_REG *) 	0xFFFFFC10) // （PMC）外围时钟启用寄存器
#define AT91C_PMC_PCKR  ((AT91_REG *) 	0xFFFFFC40) // （PMC）可编程时钟寄存器
#define AT91C_PMC_MCKR  ((AT91_REG *) 	0xFFFFFC30) // （PMC）主时钟寄存器
#define AT91C_PMC_SCDR  ((AT91_REG *) 	0xFFFFFC04) // （PMC）系统时钟禁用寄存器
#define AT91C_PMC_PCDR  ((AT91_REG *) 	0xFFFFFC14) // （PMC）外围时钟禁用寄存器
#define AT91C_PMC_SCSR  ((AT91_REG *) 	0xFFFFFC08) // （PMC）系统时钟状态寄存器
#define AT91C_PMC_PCSR  ((AT91_REG *) 	0xFFFFFC18) // （PMC）外围时钟状态寄存器
#define AT91C_PMC_MCFR  ((AT91_REG *) 	0xFFFFFC24) // （PMC）主时钟频率寄存器
#define AT91C_PMC_SCER  ((AT91_REG *) 	0xFFFFFC00) // （PMC）系统时钟启用寄存器
#define AT91C_PMC_IMR   ((AT91_REG *) 	0xFFFFFC6C) // （PMC）中断掩码寄存器
#define AT91C_PMC_IER   ((AT91_REG *) 	0xFFFFFC60) // （PMC）中断启用寄存器
#define AT91C_PMC_SR    ((AT91_REG *) 	0xFFFFFC68) // （PMC）状态寄存器
// ============RSTC外围设备的寄存器定义============
#define AT91C_RSTC_RCR  ((AT91_REG *) 	0xFFFFFD00) // （RSTC）复位控制寄存器
#define AT91C_RSTC_RMR  ((AT91_REG *) 	0xFFFFFD08) // （RSTC）复位模式寄存器
#define AT91C_RSTC_RSR  ((AT91_REG *) 	0xFFFFFD04) // （RSTC）重置状态寄存器
// ============RTTC外围设备的寄存器定义============
#define AT91C_RTTC_RTSR ((AT91_REG *) 	0xFFFFFD2C) // （RTTC）实时状态寄存器
#define AT91C_RTTC_RTMR ((AT91_REG *) 	0xFFFFFD20) // （RTTC）实时模式寄存器
#define AT91C_RTTC_RTVR ((AT91_REG *) 	0xFFFFFD28) // （RTTC）实时值寄存器
#define AT91C_RTTC_RTAR ((AT91_REG *) 	0xFFFFFD24) // （RTTC）实时报警寄存器
// ============PITC外围设备的寄存器定义============
#define AT91C_PITC_PIVR ((AT91_REG *) 	0xFFFFFD38) // （PITC）周期间隔值寄存器
#define AT91C_PITC_PISR ((AT91_REG *) 	0xFFFFFD34) // （PITC）周期间隔状态寄存器
#define AT91C_PITC_PIIR ((AT91_REG *) 	0xFFFFFD3C) // （PITC）周期间隔图像寄存器
#define AT91C_PITC_PIMR ((AT91_REG *) 	0xFFFFFD30) // （PITC）周期间隔模式寄存器
// ============WDTC外围设备的寄存器定义============
#define AT91C_WDTC_WDCR ((AT91_REG *) 	0xFFFFFD40) // （WDTC）看门狗控制寄存器
#define AT91C_WDTC_WDSR ((AT91_REG *) 	0xFFFFFD48) // （WDTC）看门狗状态寄存器
#define AT91C_WDTC_WDMR ((AT91_REG *) 	0xFFFFFD44) // （WDTC）看门狗模式寄存器
// ============VREG外围设备的寄存器定义============
#define AT91C_VREG_MR   ((AT91_REG *) 	0xFFFFFD60) // （VREG）电压调节器模式寄存器
// ============MC外围设备的寄存器定义============
#define AT91C_MC_ASR    ((AT91_REG *) 	0xFFFFFF04) // （MC）MC中止状态寄存器
#define AT91C_MC_RCR    ((AT91_REG *) 	0xFFFFFF00) // （MC）MC重映射控制寄存器
#define AT91C_MC_FCR    ((AT91_REG *) 	0xFFFFFF64) // （MC）MC闪存命令寄存器
#define AT91C_MC_AASR   ((AT91_REG *) 	0xFFFFFF08) // （MC）MC中止地址状态寄存器
#define AT91C_MC_FSR    ((AT91_REG *) 	0xFFFFFF68) // （MC）MC闪存状态寄存器
#define AT91C_MC_FMR    ((AT91_REG *) 	0xFFFFFF60) // （MC）MC闪存模式寄存器
// ============PDC_SPI1外围设备的寄存器定义============
#define AT91C_SPI1_PTCR ((AT91_REG *) 	0xFFFE4120) // （PDC_SPI1）PDC传输控制寄存器
#define AT91C_SPI1_RPR  ((AT91_REG *) 	0xFFFE4100) // （PDC_SPI1）接收指针寄存器
#define AT91C_SPI1_TNCR ((AT91_REG *) 	0xFFFE411C) // （PDC_SPI1）发送下一计数器寄存器
#define AT91C_SPI1_TPR  ((AT91_REG *) 	0xFFFE4108) // （PDC_SPI1）发送指针寄存器
#define AT91C_SPI1_TNPR ((AT91_REG *) 	0xFFFE4118) // （PDC_SPI1）发送下一个指针寄存器
#define AT91C_SPI1_TCR  ((AT91_REG *) 	0xFFFE410C) // （PDC_SPI1）发送计数器寄存器
#define AT91C_SPI1_RCR  ((AT91_REG *) 	0xFFFE4104) // （PDC_SPI1）接收计数器寄存器
#define AT91C_SPI1_RNPR ((AT91_REG *) 	0xFFFE4110) // （PDC_SPI1）接收下一个指针寄存器
#define AT91C_SPI1_RNCR ((AT91_REG *) 	0xFFFE4114) // （PDC_SPI1）接收下一个计数器寄存器
#define AT91C_SPI1_PTSR ((AT91_REG *) 	0xFFFE4124) // （PDC_SPI1）PDC传输状态寄存器
// ============SPI1外围设备的寄存器定义============
#define AT91C_SPI1_IMR  ((AT91_REG *) 	0xFFFE401C) // （SPI1）中断掩码寄存器
#define AT91C_SPI1_IER  ((AT91_REG *) 	0xFFFE4014) // （SPI1）中断启用寄存器
#define AT91C_SPI1_MR   ((AT91_REG *) 	0xFFFE4004) // （SPI1）模式寄存器
#define AT91C_SPI1_RDR  ((AT91_REG *) 	0xFFFE4008) // （SPI1）接收数据寄存器
#define AT91C_SPI1_IDR  ((AT91_REG *) 	0xFFFE4018) // （SPI1）中断禁用寄存器
#define AT91C_SPI1_SR   ((AT91_REG *) 	0xFFFE4010) // （SPI1）状态寄存器
#define AT91C_SPI1_TDR  ((AT91_REG *) 	0xFFFE400C) // （SPI1）发送数据寄存器
#define AT91C_SPI1_CR   ((AT91_REG *) 	0xFFFE4000) // （SPI1）控制寄存器
#define AT91C_SPI1_CSR  ((AT91_REG *) 	0xFFFE4030) // （SPI1）芯片选择寄存器
// ============PDC_SPI0外围设备的寄存器定义============
#define AT91C_SPI0_PTCR ((AT91_REG *) 	0xFFFE0120) // （PDC_SPI0）PDC传输控制寄存器
#define AT91C_SPI0_TPR  ((AT91_REG *) 	0xFFFE0108) // （PDC_SPI0）传输指针寄存器
#define AT91C_SPI0_TCR  ((AT91_REG *) 	0xFFFE010C) // （PDC_SPI0）传输计数器寄存器
#define AT91C_SPI0_RCR  ((AT91_REG *) 	0xFFFE0104) // （PDC_SPI0）接收计数器寄存器
#define AT91C_SPI0_PTSR ((AT91_REG *) 	0xFFFE0124) // （PDC_SPI0）PDC传输状态寄存器
#define AT91C_SPI0_RNPR ((AT91_REG *) 	0xFFFE0110) // （PDC_SPI0）接收下一个指针寄存器
#define AT91C_SPI0_RPR  ((AT91_REG *) 	0xFFFE0100) // （PDC_SPI0）接收指针寄存器
#define AT91C_SPI0_TNCR ((AT91_REG *) 	0xFFFE011C) // （PDC_SPI0）发送下一计数器寄存器
#define AT91C_SPI0_RNCR ((AT91_REG *) 	0xFFFE0114) // （PDC_SPI0）接收下一个计数器寄存器
#define AT91C_SPI0_TNPR ((AT91_REG *) 	0xFFFE0118) // （PDC_SPI0）发送下一个指针寄存器
// ============SPI0外围设备的寄存器定义============
#define AT91C_SPI0_IER  ((AT91_REG *) 	0xFFFE0014) // （SPI0）中断启用寄存器
#define AT91C_SPI0_SR   ((AT91_REG *) 	0xFFFE0010) // （SPI0）状态寄存器
#define AT91C_SPI0_IDR  ((AT91_REG *) 	0xFFFE0018) // （SPI0）中断禁用寄存器
#define AT91C_SPI0_CR   ((AT91_REG *) 	0xFFFE0000) // （SPI0）控制寄存器
#define AT91C_SPI0_MR   ((AT91_REG *) 	0xFFFE0004) // （SPI0）模式寄存器
#define AT91C_SPI0_IMR  ((AT91_REG *) 	0xFFFE001C) // （SPI0）中断掩码寄存器
#define AT91C_SPI0_TDR  ((AT91_REG *) 	0xFFFE000C) // （SPI0）传输数据寄存器
#define AT91C_SPI0_RDR  ((AT91_REG *) 	0xFFFE0008) // （SPI0）接收数据寄存器
#define AT91C_SPI0_CSR  ((AT91_REG *) 	0xFFFE0030) // （SPI0）芯片选择寄存器
// ============PDC_US1外围设备的寄存器定义============
#define AT91C_US1_RNCR  ((AT91_REG *) 	0xFFFC4114) // （PDC_US1）接收下一个计数器寄存器
#define AT91C_US1_PTCR  ((AT91_REG *) 	0xFFFC4120) // （PDC_US1）PDC传输控制寄存器
#define AT91C_US1_TCR   ((AT91_REG *) 	0xFFFC410C) // （PDC_US1）发送计数器寄存器
#define AT91C_US1_PTSR  ((AT91_REG *) 	0xFFFC4124) // （PDC_US1）PDC传输状态寄存器
#define AT91C_US1_TNPR  ((AT91_REG *) 	0xFFFC4118) // （PDC_US1）发送下一个指针寄存器
#define AT91C_US1_RCR   ((AT91_REG *) 	0xFFFC4104) // （PDC_US1）接收计数器寄存器
#define AT91C_US1_RNPR  ((AT91_REG *) 	0xFFFC4110) // （PDC_US1）接收下一个指针寄存器
#define AT91C_US1_RPR   ((AT91_REG *) 	0xFFFC4100) // （PDC_US1）接收指针寄存器
#define AT91C_US1_TNCR  ((AT91_REG *) 	0xFFFC411C) // （PDC_US1）发送下一计数器寄存器
#define AT91C_US1_TPR   ((AT91_REG *) 	0xFFFC4108) // （PDC_US1）发送指针寄存器
// ============US1外围设备的寄存器定义============
#define AT91C_US1_IF    ((AT91_REG *) 	0xFFFC404C) // （US1）IRDA_FILTER寄存器
#define AT91C_US1_NER   ((AT91_REG *) 	0xFFFC4044) // （US1）Nb错误寄存器
#define AT91C_US1_RTOR  ((AT91_REG *) 	0xFFFC4024) // （US1）接收机超时寄存器
#define AT91C_US1_CSR   ((AT91_REG *) 	0xFFFC4014) // （US1）信道状态寄存器
#define AT91C_US1_IDR   ((AT91_REG *) 	0xFFFC400C) // （US1）中断禁用寄存器
#define AT91C_US1_IER   ((AT91_REG *) 	0xFFFC4008) // （US1）中断启用寄存器
#define AT91C_US1_THR   ((AT91_REG *) 	0xFFFC401C) // （US1）发射机保持寄存器
#define AT91C_US1_TTGR  ((AT91_REG *) 	0xFFFC4028) // （US1）发射器时间保护寄存器
#define AT91C_US1_RHR   ((AT91_REG *) 	0xFFFC4018) // （US1）接收机保持寄存器
#define AT91C_US1_BRGR  ((AT91_REG *) 	0xFFFC4020) // （US1）波特率发生器寄存器
#define AT91C_US1_IMR   ((AT91_REG *) 	0xFFFC4010) // （US1）中断掩码寄存器
#define AT91C_US1_FIDI  ((AT91_REG *) 	0xFFFC4040) // （US1）FI_DI_Ratio寄存器
#define AT91C_US1_CR    ((AT91_REG *) 	0xFFFC4000) // （US1）控制寄存器
#define AT91C_US1_MR    ((AT91_REG *) 	0xFFFC4004) // （US1）模式寄存器
// ============PDC_US0外围设备的寄存器定义============
#define AT91C_US0_TNPR  ((AT91_REG *) 	0xFFFC0118) // （PDC_US0）发送下一个指针寄存器
#define AT91C_US0_RNPR  ((AT91_REG *) 	0xFFFC0110) // （PDC_US0）接收下一个指针寄存器
#define AT91C_US0_TCR   ((AT91_REG *) 	0xFFFC010C) // （PDC_US0）发送计数器寄存器
#define AT91C_US0_PTCR  ((AT91_REG *) 	0xFFFC0120) // （PDC_US0）PDC传输控制寄存器
#define AT91C_US0_PTSR  ((AT91_REG *) 	0xFFFC0124) // （PDC_US0）PDC传输状态寄存器
#define AT91C_US0_TNCR  ((AT91_REG *) 	0xFFFC011C) // （PDC_US0）发送下一计数器寄存器
#define AT91C_US0_TPR   ((AT91_REG *) 	0xFFFC0108) // （PDC_US0）发送指针寄存器
#define AT91C_US0_RCR   ((AT91_REG *) 	0xFFFC0104) // （PDC_US0）接收计数器寄存器
#define AT91C_US0_RPR   ((AT91_REG *) 	0xFFFC0100) // （PDC_US0）接收指针寄存器
#define AT91C_US0_RNCR  ((AT91_REG *) 	0xFFFC0114) // （PDC_US0）接收下一个计数器寄存器
// ============US0外围设备的寄存器定义============
#define AT91C_US0_BRGR  ((AT91_REG *) 	0xFFFC0020) // （US0）波特率发生器寄存器
#define AT91C_US0_NER   ((AT91_REG *) 	0xFFFC0044) // （US0）Nb错误寄存器
#define AT91C_US0_CR    ((AT91_REG *) 	0xFFFC0000) // （US0）控制寄存器
#define AT91C_US0_IMR   ((AT91_REG *) 	0xFFFC0010) // （US0）中断掩码寄存器
#define AT91C_US0_FIDI  ((AT91_REG *) 	0xFFFC0040) // （US0）FI_DI_Ratio寄存器
#define AT91C_US0_TTGR  ((AT91_REG *) 	0xFFFC0028) // （US0）发射器时间保护寄存器
#define AT91C_US0_MR    ((AT91_REG *) 	0xFFFC0004) // （US0）模式寄存器
#define AT91C_US0_RTOR  ((AT91_REG *) 	0xFFFC0024) // （US0）接收机超时寄存器
#define AT91C_US0_CSR   ((AT91_REG *) 	0xFFFC0014) // （US0）信道状态寄存器
#define AT91C_US0_RHR   ((AT91_REG *) 	0xFFFC0018) // （US0）接收机保持寄存器
#define AT91C_US0_IDR   ((AT91_REG *) 	0xFFFC000C) // （US0）中断禁用寄存器
#define AT91C_US0_THR   ((AT91_REG *) 	0xFFFC001C) // （US0）发射机保持寄存器
#define AT91C_US0_IF    ((AT91_REG *) 	0xFFFC004C) // （US0）IRDA_FILTER寄存器
#define AT91C_US0_IER   ((AT91_REG *) 	0xFFFC0008) // （US0）中断启用寄存器
// ============PDC_SSC外围设备的寄存器定义============
#define AT91C_SSC_TNCR  ((AT91_REG *) 	0xFFFD411C) // （PDC_SSC）发送下一计数器寄存器
#define AT91C_SSC_RPR   ((AT91_REG *) 	0xFFFD4100) // （PDC_SSC）接收指针寄存器
#define AT91C_SSC_RNCR  ((AT91_REG *) 	0xFFFD4114) // （PDC_SSC）接收下一计数器寄存器
#define AT91C_SSC_TPR   ((AT91_REG *) 	0xFFFD4108) // （PDC_SSC）发送指针寄存器
#define AT91C_SSC_PTCR  ((AT91_REG *) 	0xFFFD4120) // （PDC_SSC）PDC传输控制寄存器
#define AT91C_SSC_TCR   ((AT91_REG *) 	0xFFFD410C) // （PDC_SSC）发送计数器寄存器
#define AT91C_SSC_RCR   ((AT91_REG *) 	0xFFFD4104) // （PDC_SSC）接收计数器寄存器
#define AT91C_SSC_RNPR  ((AT91_REG *) 	0xFFFD4110) // （PDC_SSC）接收下一个指针寄存器
#define AT91C_SSC_TNPR  ((AT91_REG *) 	0xFFFD4118) // （PDC_SSC）发送下一个指针寄存器
#define AT91C_SSC_PTSR  ((AT91_REG *) 	0xFFFD4124) // （PDC_SSC）PDC传输状态寄存器
// ============SSC外围设备的寄存器定义============
#define AT91C_SSC_RHR   ((AT91_REG *) 	0xFFFD4020) // （SSC）接收保持寄存器
#define AT91C_SSC_RSHR  ((AT91_REG *) 	0xFFFD4030) // （SSC）接收同步保持寄存器
#define AT91C_SSC_TFMR  ((AT91_REG *) 	0xFFFD401C) // （SSC）发送帧模式寄存器
#define AT91C_SSC_IDR   ((AT91_REG *) 	0xFFFD4048) // （SSC）中断禁用寄存器
#define AT91C_SSC_THR   ((AT91_REG *) 	0xFFFD4024) // （SSC）发送保持寄存器
#define AT91C_SSC_RCMR  ((AT91_REG *) 	0xFFFD4010) // （SSC）接收时钟模式寄存器
#define AT91C_SSC_IER   ((AT91_REG *) 	0xFFFD4044) // （SSC）中断启用寄存器
#define AT91C_SSC_TSHR  ((AT91_REG *) 	0xFFFD4034) // （SSC）传输同步保持寄存器
#define AT91C_SSC_SR    ((AT91_REG *) 	0xFFFD4040) // （SSC）状态寄存器
#define AT91C_SSC_CMR   ((AT91_REG *) 	0xFFFD4004) // （SSC）时钟模式寄存器
#define AT91C_SSC_TCMR  ((AT91_REG *) 	0xFFFD4018) // （SSC）发送时钟模式寄存器
#define AT91C_SSC_CR    ((AT91_REG *) 	0xFFFD4000) // （SSC）控制寄存器
#define AT91C_SSC_IMR   ((AT91_REG *) 	0xFFFD404C) // （SSC）中断掩码寄存器
#define AT91C_SSC_RFMR  ((AT91_REG *) 	0xFFFD4014) // （SSC）接收帧模式寄存器
// ============TWI外围设备的寄存器定义============
#define AT91C_TWI_IER   ((AT91_REG *) 	0xFFFB8024) // （TWI）中断启用寄存器
#define AT91C_TWI_CR    ((AT91_REG *) 	0xFFFB8000) // （TWI）控制寄存器
#define AT91C_TWI_SR    ((AT91_REG *) 	0xFFFB8020) // （TWI）状态寄存器
#define AT91C_TWI_IMR   ((AT91_REG *) 	0xFFFB802C) // （TWI）中断掩码寄存器
#define AT91C_TWI_THR   ((AT91_REG *) 	0xFFFB8034) // （TWI）发送保持寄存器
#define AT91C_TWI_IDR   ((AT91_REG *) 	0xFFFB8028) // （TWI）中断禁用寄存器
#define AT91C_TWI_IADR  ((AT91_REG *) 	0xFFFB800C) // （TWI）内部地址寄存器
#define AT91C_TWI_MMR   ((AT91_REG *) 	0xFFFB8004) // （TWI）主模式寄存器
#define AT91C_TWI_CWGR  ((AT91_REG *) 	0xFFFB8010) // （TWI）时钟波形发生器寄存器
#define AT91C_TWI_RHR   ((AT91_REG *) 	0xFFFB8030) // （TWI）接收保持寄存器
// ============PWMC_CH3外围设备的寄存器定义============
#define AT91C_PWMC_CH3_CUPDR ((AT91_REG *) 	0xFFFCC270) // （PWMC_CH3）信道更新寄存器
#define AT91C_PWMC_CH3_Reserved ((AT91_REG *) 	0xFFFCC274) // （PWMC_CH3）保留
#define AT91C_PWMC_CH3_CPRDR ((AT91_REG *) 	0xFFFCC268) // （PWMC_CH3）信道周期寄存器
#define AT91C_PWMC_CH3_CDTYR ((AT91_REG *) 	0xFFFCC264) // （PWMC_CH3）信道占空比寄存器
#define AT91C_PWMC_CH3_CCNTR ((AT91_REG *) 	0xFFFCC26C) // （PWMC_CH3）信道计数器寄存器
#define AT91C_PWMC_CH3_CMR ((AT91_REG *) 	0xFFFCC260) // （PWMC_CH3）信道模式寄存器
// ============PWMC_CH2外围设备的寄存器定义============
#define AT91C_PWMC_CH2_Reserved ((AT91_REG *) 	0xFFFCC254) // （PWMC_CH2）保留
#define AT91C_PWMC_CH2_CMR ((AT91_REG *) 	0xFFFCC240) // （PWMC_CH2）信道模式寄存器
#define AT91C_PWMC_CH2_CCNTR ((AT91_REG *) 	0xFFFCC24C) // （PWMC_CH2）信道计数器寄存器
#define AT91C_PWMC_CH2_CPRDR ((AT91_REG *) 	0xFFFCC248) // （PWMC_CH2）信道周期寄存器
#define AT91C_PWMC_CH2_CUPDR ((AT91_REG *) 	0xFFFCC250) // （PWMC_CH2）信道更新寄存器
#define AT91C_PWMC_CH2_CDTYR ((AT91_REG *) 	0xFFFCC244) // （PWMC_CH2）通道占空比寄存器
// ============PWMC_CH1外围设备的寄存器定义============
#define AT91C_PWMC_CH1_Reserved ((AT91_REG *) 	0xFFFCC234) // （PWMC_CH1）保留
#define AT91C_PWMC_CH1_CUPDR ((AT91_REG *) 	0xFFFCC230) // （PWMC_CH1）信道更新寄存器
#define AT91C_PWMC_CH1_CPRDR ((AT91_REG *) 	0xFFFCC228) // （PWMC_CH1）信道周期寄存器
#define AT91C_PWMC_CH1_CCNTR ((AT91_REG *) 	0xFFFCC22C) // （PWMC_CH1）信道计数器寄存器
#define AT91C_PWMC_CH1_CDTYR ((AT91_REG *) 	0xFFFCC224) // （PWMC_CH1）通道占空比寄存器
#define AT91C_PWMC_CH1_CMR ((AT91_REG *) 	0xFFFCC220) // （PWMC_CH1）信道模式寄存器
// ============PWMC_CH0外围设备的寄存器定义============
#define AT91C_PWMC_CH0_Reserved ((AT91_REG *) 	0xFFFCC214) // （PWMC_CH0）保留
#define AT91C_PWMC_CH0_CPRDR ((AT91_REG *) 	0xFFFCC208) // （PWMC_CH0）信道周期寄存器
#define AT91C_PWMC_CH0_CDTYR ((AT91_REG *) 	0xFFFCC204) // （PWMC_CH0）通道占空比寄存器
#define AT91C_PWMC_CH0_CMR ((AT91_REG *) 	0xFFFCC200) // （PWMC_CH0）信道模式寄存器
#define AT91C_PWMC_CH0_CUPDR ((AT91_REG *) 	0xFFFCC210) // （PWMC_CH0）信道更新寄存器
#define AT91C_PWMC_CH0_CCNTR ((AT91_REG *) 	0xFFFCC20C) // （PWMC_CH0）信道计数器寄存器
// ============PWMC外围设备的寄存器定义============
#define AT91C_PWMC_IDR  ((AT91_REG *) 	0xFFFCC014) // （PWMC）PWMC中断禁用寄存器
#define AT91C_PWMC_DIS  ((AT91_REG *) 	0xFFFCC008) // （PWMC）PWMC禁用寄存器
#define AT91C_PWMC_IER  ((AT91_REG *) 	0xFFFCC010) // （PWMC）PWMC中断启用寄存器
#define AT91C_PWMC_VR   ((AT91_REG *) 	0xFFFCC0FC) // （PWMC）PWMC版本寄存器
#define AT91C_PWMC_ISR  ((AT91_REG *) 	0xFFFCC01C) // （PWMC）PWMC中断状态寄存器
#define AT91C_PWMC_SR   ((AT91_REG *) 	0xFFFCC00C) // （PWMC）PWMC状态寄存器
#define AT91C_PWMC_IMR  ((AT91_REG *) 	0xFFFCC018) // （PWMC）PWMC中断掩码寄存器
#define AT91C_PWMC_MR   ((AT91_REG *) 	0xFFFCC000) // （PWMC）PWMC模式寄存器
#define AT91C_PWMC_ENA  ((AT91_REG *) 	0xFFFCC004) // （PWMC）PWMC启用寄存器
// ============UDP外围设备的寄存器定义============
#define AT91C_UDP_IMR   ((AT91_REG *) 	0xFFFB0018) // （UDP）中断掩码寄存器
#define AT91C_UDP_FADDR ((AT91_REG *) 	0xFFFB0008) // （UDP）功能地址寄存器
#define AT91C_UDP_NUM   ((AT91_REG *) 	0xFFFB0000) // （UDP）帧号寄存器
#define AT91C_UDP_FDR   ((AT91_REG *) 	0xFFFB0050) // （UDP）端点FIFO数据寄存器
#define AT91C_UDP_ISR   ((AT91_REG *) 	0xFFFB001C) // （UDP）中断状态寄存器
#define AT91C_UDP_CSR   ((AT91_REG *) 	0xFFFB0030) // （UDP）端点控制和状态寄存器
#define AT91C_UDP_IDR   ((AT91_REG *) 	0xFFFB0014) // （UDP）中断禁用寄存器
#define AT91C_UDP_ICR   ((AT91_REG *) 	0xFFFB0020) // （UDP）中断清除寄存器
#define AT91C_UDP_RSTEP ((AT91_REG *) 	0xFFFB0028) // （UDP）重置终结点寄存器
#define AT91C_UDP_TXVC  ((AT91_REG *) 	0xFFFB0074) // （UDP）收发器控制寄存器
#define AT91C_UDP_GLBSTATE ((AT91_REG *) 	0xFFFB0004) // （UDP）全局状态寄存器
#define AT91C_UDP_IER   ((AT91_REG *) 	0xFFFB0010) // （UDP）中断启用寄存器
// ============TC0外围设备的寄存器定义============
#define AT91C_TC0_SR    ((AT91_REG *) 	0xFFFA0020) // （TC0）状态寄存器
#define AT91C_TC0_RC    ((AT91_REG *) 	0xFFFA001C) // （TC0）寄存器C
#define AT91C_TC0_RB    ((AT91_REG *) 	0xFFFA0018) // （TC0）寄存器B
#define AT91C_TC0_CCR   ((AT91_REG *) 	0xFFFA0000) // （TC0）信道控制寄存器
#define AT91C_TC0_CMR   ((AT91_REG *) 	0xFFFA0004) // （TC0）信道模式寄存器（捕获模式/波形模式）
#define AT91C_TC0_IER   ((AT91_REG *) 	0xFFFA0024) // （TC0）中断启用寄存器
#define AT91C_TC0_RA    ((AT91_REG *) 	0xFFFA0014) // （TC0）寄存器A
#define AT91C_TC0_IDR   ((AT91_REG *) 	0xFFFA0028) // （TC0）中断禁用寄存器
#define AT91C_TC0_CV    ((AT91_REG *) 	0xFFFA0010) // （TC0）计数器值
#define AT91C_TC0_IMR   ((AT91_REG *) 	0xFFFA002C) // （TC0）中断掩码寄存器
// ==========TC1外围设备的寄存器定义==========
#define AT91C_TC1_RB    ((AT91_REG *) 	0xFFFA0058) // （TC1）寄存器B
#define AT91C_TC1_CCR   ((AT91_REG *) 	0xFFFA0040) // （TC1）信道控制寄存器
#define AT91C_TC1_IER   ((AT91_REG *) 	0xFFFA0064) // （TC1）中断启用寄存器
#define AT91C_TC1_IDR   ((AT91_REG *) 	0xFFFA0068) // （TC1）中断禁用寄存器
#define AT91C_TC1_SR    ((AT91_REG *) 	0xFFFA0060) // （TC1）状态寄存器
#define AT91C_TC1_CMR   ((AT91_REG *) 	0xFFFA0044) // （TC1）信道模式寄存器（捕获模式/波形模式）
#define AT91C_TC1_RA    ((AT91_REG *) 	0xFFFA0054) // （TC1）寄存器A
