DYXX-X/Library_zh/ESP32_API_zh/cmock/CMock/test/iar/iar_v4/incIAR/ioat91sam7x256.h
#define AT91C_TC1_RC    ((AT91_REG *) 	0xFFFA005C) // （TC1）寄存器C
#define AT91C_TC1_IMR   ((AT91_REG *) 	0xFFFA006C) // （TC1）中断掩码寄存器
#define AT91C_TC1_CV    ((AT91_REG *) 	0xFFFA0050) // （TC1）计数器值
// ============TC2外围设备的寄存器定义============
#define AT91C_TC2_CMR   ((AT91_REG *) 	0xFFFA0084) // （TC2）信道模式寄存器（捕获模式/波形模式）
#define AT91C_TC2_CCR   ((AT91_REG *) 	0xFFFA0080) // （TC2）信道控制寄存器
#define AT91C_TC2_CV    ((AT91_REG *) 	0xFFFA0090) // （TC2）计数器值
#define AT91C_TC2_RA    ((AT91_REG *) 	0xFFFA0094) // （TC2）寄存器A
#define AT91C_TC2_RB    ((AT91_REG *) 	0xFFFA0098) // （TC2）寄存器B
#define AT91C_TC2_IDR   ((AT91_REG *) 	0xFFFA00A8) // （TC2）中断禁用寄存器
#define AT91C_TC2_IMR   ((AT91_REG *) 	0xFFFA00AC) // （TC2）中断掩码寄存器
#define AT91C_TC2_RC    ((AT91_REG *) 	0xFFFA009C) // （TC2）寄存器C
#define AT91C_TC2_IER   ((AT91_REG *) 	0xFFFA00A4) // （TC2）中断启用寄存器
#define AT91C_TC2_SR    ((AT91_REG *) 	0xFFFA00A0) // （TC2）状态寄存器
// ==========TCB外围设备的寄存器定义==========
#define AT91C_TCB_BMR   ((AT91_REG *) 	0xFFFA00C4) // （TCB）TC块模式寄存器
#define AT91C_TCB_BCR   ((AT91_REG *) 	0xFFFA00C0) // （TCB）TC块控制寄存器
// ============CAN_MB0外围设备的寄存器定义============
#define AT91C_CAN_MB0_MDL ((AT91_REG *) 	0xFFFD0214) // （CAN_MB0）邮箱数据低寄存器
#define AT91C_CAN_MB0_MAM ((AT91_REG *) 	0xFFFD0204) // （CAN_MB0）邮箱接受掩码寄存器
#define AT91C_CAN_MB0_MCR ((AT91_REG *) 	0xFFFD021C) // （CAN_MB0）邮箱控制寄存器
#define AT91C_CAN_MB0_MID ((AT91_REG *) 	0xFFFD0208) // （CAN_MB0）邮箱ID寄存器
#define AT91C_CAN_MB0_MSR ((AT91_REG *) 	0xFFFD0210) // （CAN_MB0）邮箱状态寄存器
#define AT91C_CAN_MB0_MFID ((AT91_REG *) 	0xFFFD020C) // （CAN_MB0）邮箱系列ID寄存器
#define AT91C_CAN_MB0_MDH ((AT91_REG *) 	0xFFFD0218) // （CAN_MB0）邮箱数据高位寄存器
#define AT91C_CAN_MB0_MMR ((AT91_REG *) 	0xFFFD0200) // （CAN_MB0）邮箱模式寄存器
// ============CAN_MB1外围设备的寄存器定义============
#define AT91C_CAN_MB1_MDL ((AT91_REG *) 	0xFFFD0234) // （CAN_MB1）邮箱数据低寄存器
#define AT91C_CAN_MB1_MID ((AT91_REG *) 	0xFFFD0228) // （CAN_MB1）邮箱ID寄存器
#define AT91C_CAN_MB1_MMR ((AT91_REG *) 	0xFFFD0220) // （CAN_MB1）邮箱模式寄存器
#define AT91C_CAN_MB1_MSR ((AT91_REG *) 	0xFFFD0230) // （CAN_MB1）邮箱状态寄存器
#define AT91C_CAN_MB1_MAM ((AT91_REG *) 	0xFFFD0224) // （CAN_MB1）邮箱接受掩码寄存器
#define AT91C_CAN_MB1_MDH ((AT91_REG *) 	0xFFFD0238) // （CAN_MB1）邮箱数据高位寄存器
#define AT91C_CAN_MB1_MCR ((AT91_REG *) 	0xFFFD023C) // （CAN_MB1）邮箱控制寄存器
#define AT91C_CAN_MB1_MFID ((AT91_REG *) 	0xFFFD022C) // （CAN_MB1）邮箱系列ID寄存器
// ============CAN_MB2外围设备的寄存器定义============
#define AT91C_CAN_MB2_MCR ((AT91_REG *) 	0xFFFD025C) // （CAN_MB2）邮箱控制寄存器
#define AT91C_CAN_MB2_MDH ((AT91_REG *) 	0xFFFD0258) // （CAN_MB2）邮箱数据高位寄存器
#define AT91C_CAN_MB2_MID ((AT91_REG *) 	0xFFFD0248) // （CAN_MB2）邮箱ID寄存器
#define AT91C_CAN_MB2_MDL ((AT91_REG *) 	0xFFFD0254) // （CAN_MB2）邮箱数据低寄存器
#define AT91C_CAN_MB2_MMR ((AT91_REG *) 	0xFFFD0240) // （CAN_MB2）邮箱模式寄存器
#define AT91C_CAN_MB2_MAM ((AT91_REG *) 	0xFFFD0244) // （CAN_MB2）邮箱接受掩码寄存器
#define AT91C_CAN_MB2_MFID ((AT91_REG *) 	0xFFFD024C) // （CAN_MB2）邮箱系列ID寄存器
#define AT91C_CAN_MB2_MSR ((AT91_REG *) 	0xFFFD0250) // （CAN_MB2）邮箱状态寄存器
// ============CAN_MB3外围设备的寄存器定义============
#define AT91C_CAN_MB3_MFID ((AT91_REG *) 	0xFFFD026C) // （CAN_MB3）邮箱系列ID寄存器
#define AT91C_CAN_MB3_MAM ((AT91_REG *) 	0xFFFD0264) // （CAN_MB3）邮箱接受掩码寄存器
#define AT91C_CAN_MB3_MID ((AT91_REG *) 	0xFFFD0268) // （CAN_MB3）邮箱ID寄存器
#define AT91C_CAN_MB3_MCR ((AT91_REG *) 	0xFFFD027C) // （CAN_MB3）邮箱控制寄存器
#define AT91C_CAN_MB3_MMR ((AT91_REG *) 	0xFFFD0260) // （CAN_MB3）邮箱模式寄存器
#define AT91C_CAN_MB3_MSR ((AT91_REG *) 	0xFFFD0270) // （CAN_MB3）邮箱状态寄存器
#define AT91C_CAN_MB3_MDL ((AT91_REG *) 	0xFFFD0274) // （CAN_MB3）邮箱数据低寄存器
#define AT91C_CAN_MB3_MDH ((AT91_REG *) 	0xFFFD0278) // （CAN_MB3）邮箱数据高位寄存器
// ============CAN_MB4外围设备的寄存器定义============
#define AT91C_CAN_MB4_MID ((AT91_REG *) 	0xFFFD0288) // （CAN_MB4）邮箱ID寄存器
#define AT91C_CAN_MB4_MMR ((AT91_REG *) 	0xFFFD0280) // （CAN_MB4）邮箱模式寄存器
#define AT91C_CAN_MB4_MDH ((AT91_REG *) 	0xFFFD0298) // （CAN_MB4）邮箱数据高位寄存器
#define AT91C_CAN_MB4_MFID ((AT91_REG *) 	0xFFFD028C) // （CAN_MB4）邮箱系列ID寄存器
#define AT91C_CAN_MB4_MSR ((AT91_REG *) 	0xFFFD0290) // （CAN_MB4）邮箱状态寄存器
#define AT91C_CAN_MB4_MCR ((AT91_REG *) 	0xFFFD029C) // （CAN_MB4）邮箱控制寄存器
#define AT91C_CAN_MB4_MDL ((AT91_REG *) 	0xFFFD0294) // （CAN_MB4）邮箱数据低寄存器
#define AT91C_CAN_MB4_MAM ((AT91_REG *) 	0xFFFD0284) // （CAN_MB4）邮箱接受掩码寄存器
// ============CAN_MB5外围设备的寄存器定义============
#define AT91C_CAN_MB5_MSR ((AT91_REG *) 	0xFFFD02B0) // （CAN_MB5）邮箱状态寄存器
#define AT91C_CAN_MB5_MCR ((AT91_REG *) 	0xFFFD02BC) // （CAN_MB5）邮箱控制寄存器
#define AT91C_CAN_MB5_MFID ((AT91_REG *) 	0xFFFD02AC) // （CAN_MB5）邮箱系列ID寄存器
#define AT91C_CAN_MB5_MDH ((AT91_REG *) 	0xFFFD02B8) // （CAN_MB5）邮箱数据高位寄存器
#define AT91C_CAN_MB5_MID ((AT91_REG *) 	0xFFFD02A8) // （CAN_MB5）邮箱ID寄存器
#define AT91C_CAN_MB5_MMR ((AT91_REG *) 	0xFFFD02A0) // （CAN_MB5）邮箱模式寄存器
#define AT91C_CAN_MB5_MDL ((AT91_REG *) 	0xFFFD02B4) // （CAN_MB5）邮箱数据低寄存器
#define AT91C_CAN_MB5_MAM ((AT91_REG *) 	0xFFFD02A4) // （CAN_MB5）邮箱接受掩码寄存器
// ============CAN_MB6外围设备的寄存器定义============
#define AT91C_CAN_MB6_MFID ((AT91_REG *) 	0xFFFD02CC) // （CAN_MB6）邮箱系列ID寄存器
#define AT91C_CAN_MB6_MID ((AT91_REG *) 	0xFFFD02C8) // （CAN_MB6）邮箱ID寄存器
#define AT91C_CAN_MB6_MAM ((AT91_REG *) 	0xFFFD02C4) // （CAN_MB6）邮箱接受掩码寄存器
#define AT91C_CAN_MB6_MSR ((AT91_REG *) 	0xFFFD02D0) // （CAN_MB6）邮箱状态寄存器
#define AT91C_CAN_MB6_MDL ((AT91_REG *) 	0xFFFD02D4) // （CAN_MB6）邮箱数据低寄存器
#define AT91C_CAN_MB6_MCR ((AT91_REG *) 	0xFFFD02DC) // （CAN_MB6）邮箱控制寄存器
#define AT91C_CAN_MB6_MDH ((AT91_REG *) 	0xFFFD02D8) // （CAN_MB6）邮箱数据高位寄存器
#define AT91C_CAN_MB6_MMR ((AT91_REG *) 	0xFFFD02C0) // （CAN_MB6）邮箱模式寄存器
// ============CAN_MB7外围设备的寄存器定义============
#define AT91C_CAN_MB7_MCR ((AT91_REG *) 	0xFFFD02FC) // （CAN_MB7）邮箱控制寄存器
#define AT91C_CAN_MB7_MDH ((AT91_REG *) 	0xFFFD02F8) // （CAN_MB7）邮箱数据高位寄存器
#define AT91C_CAN_MB7_MFID ((AT91_REG *) 	0xFFFD02EC) // （CAN_MB7）邮箱系列ID寄存器
#define AT91C_CAN_MB7_MDL ((AT91_REG *) 	0xFFFD02F4) // （CAN_MB7）邮箱数据低寄存器
#define AT91C_CAN_MB7_MID ((AT91_REG *) 	0xFFFD02E8) // （CAN_MB7）邮箱ID寄存器
#define AT91C_CAN_MB7_MMR ((AT91_REG *) 	0xFFFD02E0) // （CAN_MB7）邮箱模式寄存器
#define AT91C_CAN_MB7_MAM ((AT91_REG *) 	0xFFFD02E4) // （CAN_MB7）邮箱接受掩码寄存器
#define AT91C_CAN_MB7_MSR ((AT91_REG *) 	0xFFFD02F0) // （CAN_MB7）邮箱状态寄存器
// ============CAN外围设备的寄存器定义============
#define AT91C_CAN_TCR   ((AT91_REG *) 	0xFFFD0024) // （CAN）传输命令寄存器
#define AT91C_CAN_IMR   ((AT91_REG *) 	0xFFFD000C) // （CAN）中断掩码寄存器
#define AT91C_CAN_IER   ((AT91_REG *) 	0xFFFD0004) // （CAN）中断启用寄存器
#define AT91C_CAN_ECR   ((AT91_REG *) 	0xFFFD0020) // （CAN）错误计数器寄存器
#define AT91C_CAN_TIMESTP ((AT91_REG *) 	0xFFFD001C) // （CAN）时间戳寄存器
#define AT91C_CAN_MR    ((AT91_REG *) 	0xFFFD0000) // （CAN）模式寄存器
#define AT91C_CAN_IDR   ((AT91_REG *) 	0xFFFD0008) // （CAN）中断禁用寄存器
#define AT91C_CAN_ACR   ((AT91_REG *) 	0xFFFD0028) // （CAN）中止命令寄存器
#define AT91C_CAN_TIM   ((AT91_REG *) 	0xFFFD0018) // （CAN）计时器寄存器
#define AT91C_CAN_SR    ((AT91_REG *) 	0xFFFD0010) // （CAN）状态寄存器
#define AT91C_CAN_BR    ((AT91_REG *) 	0xFFFD0014) // （CAN）波特率寄存器
#define AT91C_CAN_VR    ((AT91_REG *) 	0xFFFD00FC) // （CAN）版本寄存器
// ============EMAC外围设备的寄存器定义============
#define AT91C_EMAC_ISR  ((AT91_REG *) 	0xFFFDC024) // （EMAC）中断状态寄存器
#define AT91C_EMAC_SA4H ((AT91_REG *) 	0xFFFDC0B4) // （EMAC）特定地址4顶部，最后2个字节
#define AT91C_EMAC_SA1L ((AT91_REG *) 	0xFFFDC098) // （EMAC）特定地址1底部，前4字节
#define AT91C_EMAC_ELE  ((AT91_REG *) 	0xFFFDC078) // （EMAC）过长错误寄存器
#define AT91C_EMAC_LCOL ((AT91_REG *) 	0xFFFDC05C) // （EMAC）延迟碰撞寄存器
#define AT91C_EMAC_RLE  ((AT91_REG *) 	0xFFFDC088) // （EMAC）接收长度字段不匹配寄存器
#define AT91C_EMAC_WOL  ((AT91_REG *) 	0xFFFDC0C4) // （EMAC）LAN唤醒寄存器
#define AT91C_EMAC_DTF  ((AT91_REG *) 	0xFFFDC058) // （EMAC）延迟传输帧寄存器
#define AT91C_EMAC_TUND ((AT91_REG *) 	0xFFFDC064) // （EMAC）传输欠载错误寄存器
#define AT91C_EMAC_NCR  ((AT91_REG *) 	0xFFFDC000) // （EMAC）网络控制寄存器
#define AT91C_EMAC_SA4L ((AT91_REG *) 	0xFFFDC0B0) // （EMAC）特定地址4底部，前4字节
#define AT91C_EMAC_RSR  ((AT91_REG *) 	0xFFFDC020) // （EMAC）接收状态寄存器
#define AT91C_EMAC_SA3L ((AT91_REG *) 	0xFFFDC0A8) // （EMAC）特定地址3底部，前4字节
#define AT91C_EMAC_TSR  ((AT91_REG *) 	0xFFFDC014) // （EMAC）传输状态寄存器
#define AT91C_EMAC_IDR  ((AT91_REG *) 	0xFFFDC02C) // （EMAC）中断禁用寄存器
#define AT91C_EMAC_RSE  ((AT91_REG *) 	0xFFFDC074) // （EMAC）接收符号错误寄存器
#define AT91C_EMAC_ECOL ((AT91_REG *) 	0xFFFDC060) // （EMAC）过度冲突寄存器
#define AT91C_EMAC_TID  ((AT91_REG *) 	0xFFFDC0B8) // （EMAC）类型ID检查寄存器
#define AT91C_EMAC_HRB  ((AT91_REG *) 	0xFFFDC090) // （EMAC）哈希地址底部[31:0]
#define AT91C_EMAC_TBQP ((AT91_REG *) 	0xFFFDC01C) // （EMAC）传输缓冲区队列指针
#define AT91C_EMAC_USRIO ((AT91_REG *) 	0xFFFDC0C0) // （EMAC）用户输入/输出寄存器
#define AT91C_EMAC_PTR  ((AT91_REG *) 	0xFFFDC038) // （EMAC）暂停时间寄存器
#define AT91C_EMAC_SA2H ((AT91_REG *) 	0xFFFDC0A4) // （EMAC）特定地址2顶部，最后2个字节
#define AT91C_EMAC_ROV  ((AT91_REG *) 	0xFFFDC070) // （EMAC）接收溢出错误寄存器
#define AT91C_EMAC_ALE  ((AT91_REG *) 	0xFFFDC054) // （EMAC）对齐错误寄存器
#define AT91C_EMAC_RJA  ((AT91_REG *) 	0xFFFDC07C) // （EMAC）接收Jabbers注册
#define AT91C_EMAC_RBQP ((AT91_REG *) 	0xFFFDC018) // （EMAC）接收缓冲区队列指针
#define AT91C_EMAC_TPF  ((AT91_REG *) 	0xFFFDC08C) // （EMAC）发送暂停帧寄存器
#define AT91C_EMAC_NCFGR ((AT91_REG *) 	0xFFFDC004) // （EMAC）网络配置寄存器
#define AT91C_EMAC_HRT  ((AT91_REG *) 	0xFFFDC094) // （EMAC）哈希地址顶部[63:32]
#define AT91C_EMAC_USF  ((AT91_REG *) 	0xFFFDC080) // （EMAC）缩小帧寄存器
#define AT91C_EMAC_FCSE ((AT91_REG *) 	0xFFFDC050) // （EMAC）帧检查序列错误寄存器
#define AT91C_EMAC_TPQ  ((AT91_REG *) 	0xFFFDC0BC) // （EMAC）传输暂停量子寄存器
#define AT91C_EMAC_MAN  ((AT91_REG *) 	0xFFFDC034) // （EMAC）PHY维护寄存器
#define AT91C_EMAC_FTO  ((AT91_REG *) 	0xFFFDC040) // （EMAC）帧发送OK寄存器
#define AT91C_EMAC_REV  ((AT91_REG *) 	0xFFFDC0FC) // （EMAC）修订登记簿
#define AT91C_EMAC_IMR  ((AT91_REG *) 	0xFFFDC030) // （EMAC）中断掩码寄存器
#define AT91C_EMAC_SCF  ((AT91_REG *) 	0xFFFDC044) // （EMAC）单冲突帧寄存器
#define AT91C_EMAC_PFR  ((AT91_REG *) 	0xFFFDC03C) // （EMAC）暂停帧接收寄存器
#define AT91C_EMAC_MCF  ((AT91_REG *) 	0xFFFDC048) // （EMAC）多冲突帧寄存器
#define AT91C_EMAC_NSR  ((AT91_REG *) 	0xFFFDC008) // （EMAC）网络状态寄存器
#define AT91C_EMAC_SA2L ((AT91_REG *) 	0xFFFDC0A0) // （EMAC）特定地址2底部，前4字节
#define AT91C_EMAC_FRO  ((AT91_REG *) 	0xFFFDC04C) // （EMAC）帧接收OK寄存器
#define AT91C_EMAC_IER  ((AT91_REG *) 	0xFFFDC028) // （EMAC）中断启用寄存器
#define AT91C_EMAC_SA1H ((AT91_REG *) 	0xFFFDC09C) // （EMAC）特定地址1顶部，最后2个字节
#define AT91C_EMAC_CSE  ((AT91_REG *) 	0xFFFDC068) // （EMAC）载波检测错误寄存器
#define AT91C_EMAC_SA3H ((AT91_REG *) 	0xFFFDC0AC) // （EMAC）特定地址3顶部，最后2个字节
#define AT91C_EMAC_RRE  ((AT91_REG *) 	0xFFFDC06C) // （EMAC）接收资源错误寄存器
#define AT91C_EMAC_STE  ((AT91_REG *) 	0xFFFDC084) // （EMAC）SQE测试错误寄存器
// ============PDC_ADC外围设备的寄存器定义============
#define AT91C_ADC_PTSR  ((AT91_REG *) 	0xFFFD8124) // （PDC_ADC）PDC传输状态寄存器
#define AT91C_ADC_PTCR  ((AT91_REG *) 	0xFFFD8120) // （PDC_ADC）PDC传输控制寄存器
#define AT91C_ADC_TNPR  ((AT91_REG *) 	0xFFFD8118) // （PDC_ADC）发送下一个指针寄存器
#define AT91C_ADC_TNCR  ((AT91_REG *) 	0xFFFD811C) // （PDC_ADC）发送下一计数器寄存器
#define AT91C_ADC_RNPR  ((AT91_REG *) 	0xFFFD8110) // （PDC_ADC）接收下一个指针寄存器
#define AT91C_ADC_RNCR  ((AT91_REG *) 	0xFFFD8114) // （PDC_ADC）接收下一计数器寄存器
#define AT91C_ADC_RPR   ((AT91_REG *) 	0xFFFD8100) // （PDC_ADC）接收指针寄存器
#define AT91C_ADC_TCR   ((AT91_REG *) 	0xFFFD810C) // （PDC_ADC）发送计数器寄存器
#define AT91C_ADC_TPR   ((AT91_REG *) 	0xFFFD8108) // （PDC_ADC）传输指针寄存器
#define AT91C_ADC_RCR   ((AT91_REG *) 	0xFFFD8104) // （PDC_ADC）接收计数器寄存器
// ============ADC外围设备的寄存器定义============
#define AT91C_ADC_CDR2  ((AT91_REG *) 	0xFFFD8038) // （ADC）ADC通道数据寄存器2
#define AT91C_ADC_CDR3  ((AT91_REG *) 	0xFFFD803C) // （ADC）ADC通道数据寄存器3
#define AT91C_ADC_CDR0  ((AT91_REG *) 	0xFFFD8030) // （ADC）ADC通道数据寄存器0
#define AT91C_ADC_CDR5  ((AT91_REG *) 	0xFFFD8044) // （ADC）ADC通道数据寄存器5
#define AT91C_ADC_CHDR  ((AT91_REG *) 	0xFFFD8014) // （ADC）ADC通道禁用寄存器
#define AT91C_ADC_SR    ((AT91_REG *) 	0xFFFD801C) // （ADC）ADC状态寄存器
#define AT91C_ADC_CDR4  ((AT91_REG *) 	0xFFFD8040) // （ADC）ADC通道数据寄存器4
#define AT91C_ADC_CDR1  ((AT91_REG *) 	0xFFFD8034) // （ADC）ADC通道数据寄存器1
#define AT91C_ADC_LCDR  ((AT91_REG *) 	0xFFFD8020) // （ADC）ADC上次转换数据寄存器
#define AT91C_ADC_IDR   ((AT91_REG *) 	0xFFFD8028) // （ADC）ADC中断禁用寄存器
#define AT91C_ADC_CR    ((AT91_REG *) 	0xFFFD8000) // （ADC）ADC控制寄存器
#define AT91C_ADC_CDR7  ((AT91_REG *) 	0xFFFD804C) // （ADC）ADC通道数据寄存器7
#define AT91C_ADC_CDR6  ((AT91_REG *) 	0xFFFD8048) // （ADC）ADC通道数据寄存器6
#define AT91C_ADC_IER   ((AT91_REG *) 	0xFFFD8024) // （ADC）ADC中断启用寄存器
#define AT91C_ADC_CHER  ((AT91_REG *) 	0xFFFD8010) // （ADC）ADC通道启用寄存器
#define AT91C_ADC_CHSR  ((AT91_REG *) 	0xFFFD8018) // （ADC）ADC通道状态寄存器
#define AT91C_ADC_MR    ((AT91_REG *) 	0xFFFD8004) // （ADC）ADC模式寄存器
#define AT91C_ADC_IMR   ((AT91_REG *) 	0xFFFD802C) // （ADC）ADC中断掩码寄存器

