DYXX-X/Library_zh/ESP32_API_zh/cmock/CMock/test/iar/iar_v4/incIAR/ioat91sam7x256.h
// *****************************************************************************
//               PIO DEFINITIONS FOR AT91SAM7X256
// *****************************************************************************
#define AT91C_PIO_PA0        ((unsigned int) 1 <<  0) // 引脚由PA0控制
#define AT91C_PA0_RXD0     ((unsigned int) AT91C_PIO_PA0) //  USART 0接收数据
#define AT91C_PIO_PA1        ((unsigned int) 1 <<  1) // 引脚由PA1控制
#define AT91C_PA1_TXD0     ((unsigned int) AT91C_PIO_PA1) //  USART 0传输数据
#define AT91C_PIO_PA10       ((unsigned int) 1 << 10) // 引脚由PA10控制
#define AT91C_PA10_TWD      ((unsigned int) AT91C_PIO_PA10) //  TWI双线串行数据
#define AT91C_PIO_PA11       ((unsigned int) 1 << 11) // 引脚由PA11控制
#define AT91C_PA11_TWCK     ((unsigned int) AT91C_PIO_PA11) //  TWI双线串行时钟
#define AT91C_PIO_PA12       ((unsigned int) 1 << 12) // 引脚由PA12控制
#define AT91C_PA12_SPI0_NPCS0 ((unsigned int) AT91C_PIO_PA12) //  SPI 0外围芯片选择0
#define AT91C_PIO_PA13       ((unsigned int) 1 << 13) // 引脚由PA13控制
#define AT91C_PA13_SPI0_NPCS1 ((unsigned int) AT91C_PIO_PA13) //  SPI 0外围芯片选择1
#define AT91C_PA13_PCK1     ((unsigned int) AT91C_PIO_PA13) //  PMC可编程时钟输出1
#define AT91C_PIO_PA14       ((unsigned int) 1 << 14) // 引脚由PA14控制
#define AT91C_PA14_SPI0_NPCS2 ((unsigned int) AT91C_PIO_PA14) //  SPI 0外围芯片选择2
#define AT91C_PA14_IRQ1     ((unsigned int) AT91C_PIO_PA14) //  外部中断1
#define AT91C_PIO_PA15       ((unsigned int) 1 << 15) // 引脚由PA15控制
#define AT91C_PA15_SPI0_NPCS3 ((unsigned int) AT91C_PIO_PA15) //  SPI 0外围芯片选择3
#define AT91C_PA15_TCLK2    ((unsigned int) AT91C_PIO_PA15) //  定时器计数器2外部时钟输入
#define AT91C_PIO_PA16       ((unsigned int) 1 << 16) // 引脚由PA16控制
#define AT91C_PA16_SPI0_MISO ((unsigned int) AT91C_PIO_PA16) //  SPI 0主从
#define AT91C_PIO_PA17       ((unsigned int) 1 << 17) // 引脚由PA17控制
#define AT91C_PA17_SPI0_MOSI ((unsigned int) AT91C_PIO_PA17) //  SPI 0主输出从
#define AT91C_PIO_PA18       ((unsigned int) 1 << 18) // 引脚由PA18控制
#define AT91C_PA18_SPI0_SPCK ((unsigned int) AT91C_PIO_PA18) //  SPI 0串行时钟
#define AT91C_PIO_PA19       ((unsigned int) 1 << 19) // 引脚由PA19控制
#define AT91C_PA19_CANRX    ((unsigned int) AT91C_PIO_PA19) //  CAN接收
#define AT91C_PIO_PA2        ((unsigned int) 1 <<  2) // 引脚由PA2控制
#define AT91C_PA2_SCK0     ((unsigned int) AT91C_PIO_PA2) //  USART 0串行时钟
#define AT91C_PA2_SPI1_NPCS1 ((unsigned int) AT91C_PIO_PA2) //  SPI 1外围芯片选择1
#define AT91C_PIO_PA20       ((unsigned int) 1 << 20) // 引脚由PA20控制
#define AT91C_PA20_CANTX    ((unsigned int) AT91C_PIO_PA20) //  CAN传输
#define AT91C_PIO_PA21       ((unsigned int) 1 << 21) // 引脚由PA21控制
#define AT91C_PA21_TF       ((unsigned int) AT91C_PIO_PA21) //  SSC传输帧同步
#define AT91C_PA21_SPI1_NPCS0 ((unsigned int) AT91C_PIO_PA21) //  SPI 1外围芯片选择0
#define AT91C_PIO_PA22       ((unsigned int) 1 << 22) // 引脚由PA22控制
#define AT91C_PA22_TK       ((unsigned int) AT91C_PIO_PA22) //  SSC发送时钟
#define AT91C_PA22_SPI1_SPCK ((unsigned int) AT91C_PIO_PA22) //  SPI 1串行时钟
#define AT91C_PIO_PA23       ((unsigned int) 1 << 23) // 引脚由PA23控制
#define AT91C_PA23_TD       ((unsigned int) AT91C_PIO_PA23) //  SSC传输数据
#define AT91C_PA23_SPI1_MOSI ((unsigned int) AT91C_PIO_PA23) //  SPI 1主输出从
#define AT91C_PIO_PA24       ((unsigned int) 1 << 24) // 引脚由PA24控制
#define AT91C_PA24_RD       ((unsigned int) AT91C_PIO_PA24) //  SSC接收数据
#define AT91C_PA24_SPI1_MISO ((unsigned int) AT91C_PIO_PA24) //  SPI 1主从
#define AT91C_PIO_PA25       ((unsigned int) 1 << 25) // 引脚由PA25控制
#define AT91C_PA25_RK       ((unsigned int) AT91C_PIO_PA25) //  SSC接收时钟
#define AT91C_PA25_SPI1_NPCS1 ((unsigned int) AT91C_PIO_PA25) //  SPI 1外围芯片选择1
#define AT91C_PIO_PA26       ((unsigned int) 1 << 26) // 引脚由PA26控制
#define AT91C_PA26_RF       ((unsigned int) AT91C_PIO_PA26) //  SSC接收帧同步
#define AT91C_PA26_SPI1_NPCS2 ((unsigned int) AT91C_PIO_PA26) //  SPI 1外围芯片选择2
#define AT91C_PIO_PA27       ((unsigned int) 1 << 27) // 引脚由PA27控制
#define AT91C_PA27_DRXD     ((unsigned int) AT91C_PIO_PA27) //  DBGU调试接收数据
#define AT91C_PA27_PCK3     ((unsigned int) AT91C_PIO_PA27) //  PMC可编程时钟输出3
#define AT91C_PIO_PA28       ((unsigned int) 1 << 28) // 引脚由PA28控制
#define AT91C_PA28_DTXD     ((unsigned int) AT91C_PIO_PA28) //  DBGU调试传输数据
#define AT91C_PIO_PA29       ((unsigned int) 1 << 29) // 引脚由PA29控制
#define AT91C_PA29_FIQ      ((unsigned int) AT91C_PIO_PA29) //  AIC快速中断输入
#define AT91C_PA29_SPI1_NPCS3 ((unsigned int) AT91C_PIO_PA29) //  SPI 1外围芯片选择3
#define AT91C_PIO_PA3        ((unsigned int) 1 <<  3) // 引脚由PA3控制
#define AT91C_PA3_RTS0     ((unsigned int) AT91C_PIO_PA3) //  USART 0准备发送
#define AT91C_PA3_SPI1_NPCS2 ((unsigned int) AT91C_PIO_PA3) //  SPI 1外围芯片选择2
#define AT91C_PIO_PA30       ((unsigned int) 1 << 30) // 引脚由PA30控制
#define AT91C_PA30_IRQ0     ((unsigned int) AT91C_PIO_PA30) //  外部中断0
#define AT91C_PA30_PCK2     ((unsigned int) AT91C_PIO_PA30) //  PMC可编程时钟输出2
#define AT91C_PIO_PA4        ((unsigned int) 1 <<  4) // 引脚由PA4控制
#define AT91C_PA4_CTS0     ((unsigned int) AT91C_PIO_PA4) //  USART 0清除发送
#define AT91C_PA4_SPI1_NPCS3 ((unsigned int) AT91C_PIO_PA4) //  SPI 1外围芯片选择3
#define AT91C_PIO_PA5        ((unsigned int) 1 <<  5) // 引脚由PA5控制
#define AT91C_PA5_RXD1     ((unsigned int) AT91C_PIO_PA5) //  USART 1接收数据
#define AT91C_PIO_PA6        ((unsigned int) 1 <<  6) // 引脚由PA6控制
#define AT91C_PA6_TXD1     ((unsigned int) AT91C_PIO_PA6) //  USART 1传输数据
#define AT91C_PIO_PA7        ((unsigned int) 1 <<  7) // 引脚由PA7控制
#define AT91C_PA7_SCK1     ((unsigned int) AT91C_PIO_PA7) //  USART 1串行时钟
#define AT91C_PA7_SPI0_NPCS1 ((unsigned int) AT91C_PIO_PA7) //  SPI 0外围芯片选择1
#define AT91C_PIO_PA8        ((unsigned int) 1 <<  8) // 引脚由PA8控制
#define AT91C_PA8_RTS1     ((unsigned int) AT91C_PIO_PA8) //  USART 1准备发送
#define AT91C_PA8_SPI0_NPCS2 ((unsigned int) AT91C_PIO_PA8) //  SPI 0外围芯片选择2
#define AT91C_PIO_PA9        ((unsigned int) 1 <<  9) // 引脚由PA9控制
#define AT91C_PA9_CTS1     ((unsigned int) AT91C_PIO_PA9) //  USART 1清除发送
#define AT91C_PA9_SPI0_NPCS3 ((unsigned int) AT91C_PIO_PA9) //  SPI 0外围芯片选择3
#define AT91C_PIO_PB0        ((unsigned int) 1 <<  0) // 引脚由PB0控制
#define AT91C_PB0_ETXCK_EREFCK ((unsigned int) AT91C_PIO_PB0) //  以太网MAC传输时钟/参考时钟
#define AT91C_PB0_PCK0     ((unsigned int) AT91C_PIO_PB0) //  PMC可编程时钟输出0
#define AT91C_PIO_PB1        ((unsigned int) 1 <<  1) // 引脚由PB1控制
#define AT91C_PB1_ETXEN    ((unsigned int) AT91C_PIO_PB1) //  以太网MAC传输启用
#define AT91C_PIO_PB10       ((unsigned int) 1 << 10) // 由PB10控制的引脚
#define AT91C_PB10_ETX2     ((unsigned int) AT91C_PIO_PB10) //  以太网MAC传输数据2
#define AT91C_PB10_SPI1_NPCS1 ((unsigned int) AT91C_PIO_PB10) //  SPI 1外围芯片选择1
#define AT91C_PIO_PB11       ((unsigned int) 1 << 11) // 引脚由PB11控制
#define AT91C_PB11_ETX3     ((unsigned int) AT91C_PIO_PB11) //  以太网MAC传输数据3
#define AT91C_PB11_SPI1_NPCS2 ((unsigned int) AT91C_PIO_PB11) //  SPI 1外围芯片选择2
#define AT91C_PIO_PB12       ((unsigned int) 1 << 12) // 引脚由PB12控制
#define AT91C_PB12_ETXER    ((unsigned int) AT91C_PIO_PB12) //  以太网MAC传输编码错误
#define AT91C_PB12_TCLK0    ((unsigned int) AT91C_PIO_PB12) //  定时器计数器0外部时钟输入
#define AT91C_PIO_PB13       ((unsigned int) 1 << 13) // 引脚由PB13控制
#define AT91C_PB13_ERX2     ((unsigned int) AT91C_PIO_PB13) //  以太网MAC接收数据2
#define AT91C_PB13_SPI0_NPCS1 ((unsigned int) AT91C_PIO_PB13) //  SPI 0外围芯片选择1
#define AT91C_PIO_PB14       ((unsigned int) 1 << 14) // 引脚由PB14控制
#define AT91C_PB14_ERX3     ((unsigned int) AT91C_PIO_PB14) //  以太网MAC接收数据3
#define AT91C_PB14_SPI0_NPCS2 ((unsigned int) AT91C_PIO_PB14) //  SPI 0外围芯片选择2
#define AT91C_PIO_PB15       ((unsigned int) 1 << 15) // 引脚由PB15控制
#define AT91C_PB15_ERXDV_ECRSDV ((unsigned int) AT91C_PIO_PB15) //  以太网MAC接收数据有效
#define AT91C_PIO_PB16       ((unsigned int) 1 << 16) // 引脚由PB16控制
#define AT91C_PB16_ECOL     ((unsigned int) AT91C_PIO_PB16) //  检测到以太网MAC冲突
#define AT91C_PB16_SPI1_NPCS3 ((unsigned int) AT91C_PIO_PB16) //  SPI 1外围芯片选择3
#define AT91C_PIO_PB17       ((unsigned int) 1 << 17) // 引脚由PB17控制
#define AT91C_PB17_ERXCK    ((unsigned int) AT91C_PIO_PB17) //  以太网MAC接收时钟
#define AT91C_PB17_SPI0_NPCS3 ((unsigned int) AT91C_PIO_PB17) //  SPI 0外围芯片选择3
#define AT91C_PIO_PB18       ((unsigned int) 1 << 18) // 引脚由PB18控制
#define AT91C_PB18_EF100    ((unsigned int) AT91C_PIO_PB18) //  以太网MAC强制100 Mbit/s
#define AT91C_PB18_ADTRG    ((unsigned int) AT91C_PIO_PB18) //  ADC外部触发器
#define AT91C_PIO_PB19       ((unsigned int) 1 << 19) // 引脚由PB19控制
#define AT91C_PB19_PWM0     ((unsigned int) AT91C_PIO_PB19) //  PWM通道0
#define AT91C_PB19_TCLK1    ((unsigned int) AT91C_PIO_PB19) //  定时器计数器1外部时钟输入
#define AT91C_PIO_PB2        ((unsigned int) 1 <<  2) // 引脚由PB2控制
#define AT91C_PB2_ETX0     ((unsigned int) AT91C_PIO_PB2) //  以太网MAC传输数据0
#define AT91C_PIO_PB20       ((unsigned int) 1 << 20) // 由PB20控制的引脚
#define AT91C_PB20_PWM1     ((unsigned int) AT91C_PIO_PB20) //  PWM通道1
#define AT91C_PB20_PCK0     ((unsigned int) AT91C_PIO_PB20) //  PMC可编程时钟输出0
#define AT91C_PIO_PB21       ((unsigned int) 1 << 21) // 引脚由PB21控制
#define AT91C_PB21_PWM2     ((unsigned int) AT91C_PIO_PB21) //  PWM通道2
#define AT91C_PB21_PCK1     ((unsigned int) AT91C_PIO_PB21) //  PMC可编程时钟输出1
#define AT91C_PIO_PB22       ((unsigned int) 1 << 22) // 引脚由PB22控制
#define AT91C_PB22_PWM3     ((unsigned int) AT91C_PIO_PB22) //  PWM通道3
#define AT91C_PB22_PCK2     ((unsigned int) AT91C_PIO_PB22) //  PMC可编程时钟输出2
#define AT91C_PIO_PB23       ((unsigned int) 1 << 23) // 引脚由PB23控制
#define AT91C_PB23_TIOA0    ((unsigned int) AT91C_PIO_PB23) //  定时器计数器0多用途定时器I/O引脚A
#define AT91C_PB23_DCD1     ((unsigned int) AT91C_PIO_PB23) //  USART 1数据载体检测
#define AT91C_PIO_PB24       ((unsigned int) 1 << 24) // 引脚由PB24控制
#define AT91C_PB24_TIOB0    ((unsigned int) AT91C_PIO_PB24) //  定时器计数器0多用途定时器I/O引脚B
#define AT91C_PB24_DSR1     ((unsigned int) AT91C_PIO_PB24) //  USART 1数据集就绪
#define AT91C_PIO_PB25       ((unsigned int) 1 << 25) // 由PB25控制的引脚
#define AT91C_PB25_TIOA1    ((unsigned int) AT91C_PIO_PB25) //  定时器计数器1多用途定时器I/O引脚A
#define AT91C_PB25_DTR1     ((unsigned int) AT91C_PIO_PB25) //  USART 1数据终端准备就绪
#define AT91C_PIO_PB26       ((unsigned int) 1 << 26) // 由PB26控制的引脚
#define AT91C_PB26_TIOB1    ((unsigned int) AT91C_PIO_PB26) //  定时器计数器1多用途定时器I/O引脚B
#define AT91C_PB26_RI1      ((unsigned int) AT91C_PIO_PB26) //  USART 1环指示器
#define AT91C_PIO_PB27       ((unsigned int) 1 << 27) // 引脚由PB27控制
#define AT91C_PB27_TIOA2    ((unsigned int) AT91C_PIO_PB27) //  定时器计数器2多用途定时器I/O引脚A
#define AT91C_PB27_PWM0     ((unsigned int) AT91C_PIO_PB27) //  PWM通道0
#define AT91C_PIO_PB28       ((unsigned int) 1 << 28) // 引脚由PB28控制
#define AT91C_PB28_TIOB2    ((unsigned int) AT91C_PIO_PB28) //  定时器计数器2多用途定时器I/O引脚B
#define AT91C_PB28_PWM1     ((unsigned int) AT91C_PIO_PB28) //  PWM通道1
#define AT91C_PIO_PB29       ((unsigned int) 1 << 29) // 由PB29控制的引脚
#define AT91C_PB29_PCK1     ((unsigned int) AT91C_PIO_PB29) //  PMC可编程时钟输出1
#define AT91C_PB29_PWM2     ((unsigned int) AT91C_PIO_PB29) //  PWM通道2
#define AT91C_PIO_PB3        ((unsigned int) 1 <<  3) // 引脚由PB3控制
#define AT91C_PB3_ETX1     ((unsigned int) AT91C_PIO_PB3) //  以太网MAC传输数据1
#define AT91C_PIO_PB30       ((unsigned int) 1 << 30) // 引脚由PB30控制
#define AT91C_PB30_PCK2     ((unsigned int) AT91C_PIO_PB30) //  PMC可编程时钟输出2
#define AT91C_PB30_PWM3     ((unsigned int) AT91C_PIO_PB30) //  PWM通道3
#define AT91C_PIO_PB4        ((unsigned int) 1 <<  4) // 引脚由PB4控制
#define AT91C_PB4_ECRS     ((unsigned int) AT91C_PIO_PB4) //  以太网MAC载波检测/载波检测和数据有效
#define AT91C_PIO_PB5        ((unsigned int) 1 <<  5) // 引脚由PB5控制
#define AT91C_PB5_ERX0     ((unsigned int) AT91C_PIO_PB5) //  以太网MAC接收数据0
#define AT91C_PIO_PB6        ((unsigned int) 1 <<  6) // 引脚由PB6控制
#define AT91C_PB6_ERX1     ((unsigned int) AT91C_PIO_PB6) //  以太网MAC接收数据1
#define AT91C_PIO_PB7        ((unsigned int) 1 <<  7) // 引脚由PB7控制
#define AT91C_PB7_ERXER    ((unsigned int) AT91C_PIO_PB7) //  以太网MAC接收错误
#define AT91C_PIO_PB8        ((unsigned int) 1 <<  8) // 引脚由PB8控制
#define AT91C_PB8_EMDC     ((unsigned int) AT91C_PIO_PB8) //  以太网MAC管理数据时钟
#define AT91C_PIO_PB9        ((unsigned int) 1 <<  9) // 引脚由PB9控制
#define AT91C_PB9_EMDIO    ((unsigned int) AT91C_PIO_PB9) //  以太网MAC管理数据输入/输出

// *****************************************************************************
//               PERIPHERAL ID DEFINITIONS FOR AT91SAM7X256
// *****************************************************************************
#define AT91C_ID_FIQ    ((unsigned int)  0) // 高级中断控制器（FIQ）
#define AT91C_ID_SYS    ((unsigned int)  1) // 系统外围设备
#define AT91C_ID_PIOA   ((unsigned int)  2) // 并行IO控制器A
#define AT91C_ID_PIOB   ((unsigned int)  3) // 并行IO控制器B
#define AT91C_ID_SPI0   ((unsigned int)  4) // 串行外围接口0
#define AT91C_ID_SPI1   ((unsigned int)  5) // 串行外围接口1
#define AT91C_ID_US0    ((unsigned int)  6) // USART 0
#define AT91C_ID_US1    ((unsigned int)  7) // USART 1
#define AT91C_ID_SSC    ((unsigned int)  8) // 串行同步控制器
#define AT91C_ID_TWI    ((unsigned int)  9) // 双线接口
#define AT91C_ID_PWMC   ((unsigned int) 10) // PWM控制器
#define AT91C_ID_UDP    ((unsigned int) 11) // USB设备端口
#define AT91C_ID_TC0    ((unsigned int) 12) // 计时器计数器0
#define AT91C_ID_TC1    ((unsigned int) 13) // 计时器计数器1
#define AT91C_ID_TC2    ((unsigned int) 14) // 计时器计数器2
#define AT91C_ID_CAN    ((unsigned int) 15) // 控制区域网络控制器
#define AT91C_ID_EMAC   ((unsigned int) 16) // 以太网MAC
#define AT91C_ID_ADC    ((unsigned int) 17) // 模数转换器
#define AT91C_ID_18_Reserved ((unsigned int) 18) // 保留
#define AT91C_ID_19_Reserved ((unsigned int) 19) // 保留
#define AT91C_ID_20_Reserved ((unsigned int) 20) // 保留
#define AT91C_ID_21_Reserved ((unsigned int) 21) // 保留
#define AT91C_ID_22_Reserved ((unsigned int) 22) // 保留
#define AT91C_ID_23_Reserved ((unsigned int) 23) // 保留
#define AT91C_ID_24_Reserved ((unsigned int) 24) // 保留
#define AT91C_ID_25_Reserved ((unsigned int) 25) // 保留
#define AT91C_ID_26_Reserved ((unsigned int) 26) // 保留
#define AT91C_ID_27_Reserved ((unsigned int) 27) // 保留
#define AT91C_ID_28_Reserved ((unsigned int) 28) // 保留
#define AT91C_ID_29_Reserved ((unsigned int) 29) // 保留
#define AT91C_ID_IRQ0   ((unsigned int) 30) // 高级中断控制器（IRQ0）
#define AT91C_ID_IRQ1   ((unsigned int) 31) // 高级中断控制器（IRQ1）
#define AT91C_ALL_INT   ((unsigned int) 0xC003FFFF) // ALL VALID INTERRUPTS

// *****************************************************************************
//               BASE ADDRESS DEFINITIONS FOR AT91SAM7X256
// *****************************************************************************
#define AT91C_BASE_SYS       ((AT91PS_SYS) 	0xFFFFF000) // （SYS）基址
#define AT91C_BASE_AIC       ((AT91PS_AIC) 	0xFFFFF000) // （AIC）基本地址
#define AT91C_BASE_PDC_DBGU  ((AT91PS_PDC) 	0xFFFFF300) // （PDC_DBGU）基址
#define AT91C_BASE_DBGU      ((AT91PS_DBGU) 	0xFFFFF200) // （DBGU）基址
#define AT91C_BASE_PIOA      ((AT91PS_PIO) 	0xFFFFF400) // （PIOA）基本地址
#define AT91C_BASE_PIOB      ((AT91PS_PIO) 	0xFFFFF600) // （PIOB）基址
#define AT91C_BASE_CKGR      ((AT91PS_CKGR) 	0xFFFFFC20) // （CKGR）基址
#define AT91C_BASE_PMC       ((AT91PS_PMC) 	0xFFFFFC00) // （PMC）基址
#define AT91C_BASE_RSTC      ((AT91PS_RSTC) 	0xFFFFFD00) // （RSTC）基址
#define AT91C_BASE_RTTC      ((AT91PS_RTTC) 	0xFFFFFD20) // （RTTC）基址
#define AT91C_BASE_PITC      ((AT91PS_PITC) 	0xFFFFFD30) // （PITC）基址
#define AT91C_BASE_WDTC      ((AT91PS_WDTC) 	0xFFFFFD40) // （WDTC）基址
#define AT91C_BASE_VREG      ((AT91PS_VREG) 	0xFFFFFD60) // （VREG）基址
#define AT91C_BASE_MC        ((AT91PS_MC) 	0xFFFFFF00) // （MC）基址
#define AT91C_BASE_PDC_SPI1  ((AT91PS_PDC) 	0xFFFE4100) // （PDC_SPI1）基址
#define AT91C_BASE_SPI1      ((AT91PS_SPI) 	0xFFFE4000) // （SPI1）基址
#define AT91C_BASE_PDC_SPI0  ((AT91PS_PDC) 	0xFFFE0100) // （PDC_SPI0）基址
#define AT91C_BASE_SPI0      ((AT91PS_SPI) 	0xFFFE0000) // （SPI0）基址
#define AT91C_BASE_PDC_US1   ((AT91PS_PDC) 	0xFFFC4100) // （PDC_US1）基址
#define AT91C_BASE_US1       ((AT91PS_USART) 	0xFFFC4000) // （US1）基址
#define AT91C_BASE_PDC_US0   ((AT91PS_PDC) 	0xFFFC0100) // （PDC_US0）基址
#define AT91C_BASE_US0       ((AT91PS_USART) 	0xFFFC0000) // （US0）基址
#define AT91C_BASE_PDC_SSC   ((AT91PS_PDC) 	0xFFFD4100) // （PDC_SSC）基址
#define AT91C_BASE_SSC       ((AT91PS_SSC) 	0xFFFD4000) // （SSC）基址
#define AT91C_BASE_TWI       ((AT91PS_TWI) 	0xFFFB8000) // （TWI）基址
#define AT91C_BASE_PWMC_CH3  ((AT91PS_PWMC_CH) 	0xFFFCC260) // （PWMC_CH3）基址
#define AT91C_BASE_PWMC_CH2  ((AT91PS_PWMC_CH) 	0xFFFCC240) // （PWMC_CH2）基址
#define AT91C_BASE_PWMC_CH1  ((AT91PS_PWMC_CH) 	0xFFFCC220) // （PWMC_CH1）基址
#define AT91C_BASE_PWMC_CH0  ((AT91PS_PWMC_CH) 	0xFFFCC200) // （PWMC_CH0）基址
#define AT91C_BASE_PWMC      ((AT91PS_PWMC) 	0xFFFCC000) // （PWMC）基址
#define AT91C_BASE_UDP       ((AT91PS_UDP) 	0xFFFB0000) // （UDP）基址
#define AT91C_BASE_TC0       ((AT91PS_TC) 	0xFFFA0000) // （TC0）基址
#define AT91C_BASE_TC1       ((AT91PS_TC) 	0xFFFA0040) // （TC1）基址
#define AT91C_BASE_TC2       ((AT91PS_TC) 	0xFFFA0080) // （TC2）基址
#define AT91C_BASE_TCB       ((AT91PS_TCB) 	0xFFFA0000) // （TCB）基址
#define AT91C_BASE_CAN_MB0   ((AT91PS_CAN_MB) 	0xFFFD0200) // （CAN_MB0）基址
#define AT91C_BASE_CAN_MB1   ((AT91PS_CAN_MB) 	0xFFFD0220) // （CAN_MB1）基址
#define AT91C_BASE_CAN_MB2   ((AT91PS_CAN_MB) 	0xFFFD0240) // （CAN_MB2）基址
#define AT91C_BASE_CAN_MB3   ((AT91PS_CAN_MB) 	0xFFFD0260) // （CAN_MB3）基址
#define AT91C_BASE_CAN_MB4   ((AT91PS_CAN_MB) 	0xFFFD0280) // （CAN_MB4）基址
#define AT91C_BASE_CAN_MB5   ((AT91PS_CAN_MB) 	0xFFFD02A0) // （CAN_MB5）基址
#define AT91C_BASE_CAN_MB6   ((AT91PS_CAN_MB) 	0xFFFD02C0) // （CAN_MB6）基址
#define AT91C_BASE_CAN_MB7   ((AT91PS_CAN_MB) 	0xFFFD02E0) // （CAN_MB7）基址
#define AT91C_BASE_CAN       ((AT91PS_CAN) 	0xFFFD0000) // （CAN）基址
#define AT91C_BASE_EMAC      ((AT91PS_EMAC) 	0xFFFDC000) // （EMAC）基本地址
#define AT91C_BASE_PDC_ADC   ((AT91PS_PDC) 	0xFFFD8100) // （PDC_ADC）基址
#define AT91C_BASE_ADC       ((AT91PS_ADC) 	0xFFFD8000) // （ADC）基址

// *****************************************************************************
//               MEMORY MAPPING DEFINITIONS FOR AT91SAM7X256
// *****************************************************************************
// ISRAM
#define AT91C_ISRAM	 ((char *) 	0x00200000) // 内部SRAM基址
#define AT91C_ISRAM_SIZE	 ((unsigned int) 0x00010000) // 内部SRAM大小（字节）（64 KB）
// IFLASH
#define AT91C_IFLASH	 ((char *) 	0x00100000) // 内部FLASH基地址
#define AT91C_IFLASH_SIZE	 ((unsigned int) 0x00040000) // 内部FLASH大小（字节）（256 KB）
#define AT91C_IFLASH_PAGE_SIZE	 ((unsigned int) 256) // 内部FLASH页面大小：256字节
#define AT91C_IFLASH_LOCK_REGION_SIZE	 ((unsigned int) 16384) // 内部FLASH锁定区域大小：16 KB
#define AT91C_IFLASH_NB_OF_PAGES	 ((unsigned int) 1024) // 内部FLASH页数：1024字节
#define AT91C_IFLASH_NB_OF_LOCK_BITS	 ((unsigned int) 16) // 内部FLASH锁定位数：16字节
#endif /* __IAR_SYSTEMS_ICC__ */

